[
    {
        "ID": 1,
        "Arabic": "بِسْمِ  اللّٰهِ   الرَّحْمٰنِ  الرَّحِيْمٌ",
        "Traslation": "شروع کرتا ہوں اللہ کے نام سے جو بہت مہربان اور رحم والا ہے"
    },
    {
        "ID": 2,
        "Arabic": "اَسْتَغْفِرُ اللّٰهَ  الْعَظِيْمِ",
        "Traslation": "میں خدائے بزرگ سے مغفرت مانگتا ہوں"
    },
    {
        "ID": 3,
        "Arabic": "اَسْتَغْفِرُ اللّٰهَ  الْعَظِيْمِ",
        "Traslation": "میں خدائے بزرگ سے مغفرت مانگتا ہوں"
    },
    {
        "ID": 4,
        "Arabic": "اَسْتَغْفِرُ اللّٰهَ  الْعَظِيْمِ",
        "Traslation": "میں خدائے بزرگ سے مغفرت مانگتا ہوں"
    },
    {
        "ID": 5,
        "Arabic": "اَلَّذِىْ  لَآ  اِلٰهَ  اِلَّا  هُوَ  الْحَيُّ  الْقَيُّوْمُ  وَ  اَتُوْبُ  اِلَيْهِ  وَاَسْأَلُهُ  التَّوْبَةَ",
        "Traslation": "جس کے بغیر کوئی معبود نہیں وہ ہمیشہ زندہ اور تمام کائنات کو سنبھالے ہوئے ہے۔ میں اُسی کی طرف لوٹتا ہوں اور اُسی سے توبہ کی قبولیت چاہتا ہوں"
    },
    {
        "ID": 6,
        "Arabic": "اَللّٰهُمَّ  اَنْتَ  السَّلَامُ  وَمِنْكَ  السَّلَامُ  وَاِلَيْكَ  يَرْجِعُ  السَّلَامُ  حَيِّنَا  رَبَّنَا  بِاالسَّلَامِ  وَاَدْخِلْنَا  دَارَ  السَّلَامِ  تَبَارَكْتَ  رَبَّنَا  وَتَعَالَيْتَ  يَا ذَالْجَلٰالِ  وَلْاِكْرَامِ",
        "Traslation": "اے اللہ تو سلامتی ہے اور تجھ سے ہی سلامتی ہے اور تیری ہی طرف سلامتی لوٹتی ہے۔ زندہ رکھ ہمیں اے پروردگار سلامتی سے اور داخل کر ہمیں سلامتی کے گھر(جنّت) میں۔ تو برکت والا ہے اے ہمارے رب اور تو بہت بلند ہے اے عزّت اور بزرگی والے الٰہی"
    },
    {
        "ID": 7,
        "Arabic": "اَللّٰهُمَّ  لَكَ  الْحَمْدُ  حَمْدًا  يُّوَافِىْ  نِعَمَكَ  وَيُكَافِىْ  مَذِيْدَ  كَرَمِكَ  اَحْمَدُكَ  بِجَمِيْعِ  مَحَامِدِكَ  مَا  عَلِمْتُ  مِنْهَا  وَمَالَمْ  اَعْلَمْ",
        "Traslation": "تیرے لیے ایسی تعریف ہے جو تیری تمام نعمتوں کو پورا کردے اور تیری مزید بخشش کی برابری کرے۔ میں تیری تعریف کرتا ہوں اور تیری ان تمام خوبیوں کی جنھیں میں جانتا ہوں اور جنھیں میں نہیں جانتا ہوں"
    },
    {
        "ID": 8,
        "Arabic": "وَ  عَلٰى  جَمِيْعِ  نِعَمِكَ  مَا  عَلِمْتُ  مِنْهَا  وَ  مَا  لَمْ  اَعْلَمْ  وَ  عَلٰى  كُلِّ  حَالٍ",
        "Traslation": "اور تیری ان تمام نعمتوں کا شکر گزار ہوں جنھیں میں جانتا ہوں اور جنھیں میں نہیں جانتا ہوں اور ہر حال پر (شکر گزار ہوں )"
    },
    {
        "ID": 9,
        "Arabic": "اَعُوْذُ  بِاللّٰهِ  مِنَ  الشَّيْطٰنِ  الرَّجِيْمِ",
        "Traslation": "میں پناہ مانگتا ہوں اللہ سے شیطان مردود (کی شر) سے"
    },
    {
        "ID": 10,
        "Arabic": "اللَّهُ  لَا  اِلٰهَ  اِلَّا  هُوَ  الْحَيُّ  الْقَيُّومُ  لَا  تَاْخُذُهٗ  سِنَةٌ  وَلَا  نَوْمٌ  لَهٗ  مَا  فِي  السَّمٰوَاتِ  وَمَا  فِي  الْاَرْضِ  مَنْ  ذَالَّذِي  يَشْفَعُ  عِنْدَهٗ  اِلَّا  بِاِذْنِهٖ  يَعْلَمُ  مَا بَيْنَ  اَيْدِيهِمْ  وَمَا  خَلْفَهُمْ  وَلَا  يُحِيْطُوْنَ  بِشَىْءٍ  مِّۢنْ  عِلْمِهٖ  اِلَّا  بِمَا  شَآءَ  وَسِعَ  كُرْسِيُّهُ  السَّمٰوَاتِ  وَالْاَرْضَ  وَلَا  يَئُودُهٗ  حِفْظُهُمَا  وَهُوَ  الْعَلِىُّ  الْعَظِيمُ",
        "Traslation": "اللہ ہے اس کے سوا کوئی معبود نہیں ، وہ ہمیشہ زندہ اور تمام کائنات کو سنبھالے ہوئے ہے۔ نہ اُسے اونگھ پکڑتی ہے اور نہ نیند۔ اسی کی ہیں وہ ساری چیزیں جو آسمانوں اور زمینوں میں ہیں۔ کون ہے وہ جو اس کے پاس اس کی اجازت کے بغیر (کسی کی) سفارش کرے۔ وہ ان کے سامنے کی اور پیچھے کی سب چیزیں جانتا ہے۔ لوگ خدا کی معلومات سے صرف اسی قدر جانتے ہیں جتنا خدا چاہتا ہے۔ اس کی حکومت تمام آسمانوں اور زمینوں پر چھائی ہوئی ہے۔ اور اُس (خدا)کو ان کی حفاظت تھکاتی نہیں ہے اور وہ تو بہت بلند اور بزرگ ہے"
    },
    {
        "ID": 11,
        "Arabic": "سُبْحَانَ  اللّٰهِ  (33)",
        "Traslation": "اللہ منزّہ اور پاک ہے - ۳۳ بار-"
    },
    {
        "ID": 12,
        "Arabic": "اَلْحَمْدُ  لِلّٰهِ  (33)",
        "Traslation": "تمام تعریفیں اللہ ہی کے لیے ہیں - ۳۳ بار-"
    },
    {
        "ID": 13,
        "Arabic": "اَللّٰهُ  اَكْبَرُ  (34)",
        "Traslation": "اللہ سب سے بڑا ہے - ۳۴ بار -"
    },
    {
        "ID": 14,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  وَحْدَهٗ  لَا  شَرِيْكَ  لَهٗ  لَهُ  الْمُلْكُ  وَلَهُ  الْحَمْدُ  وَ  هُوَ  عَلٰى  كُلِّ  شَىْءٍ  قَدِيْرٌ  - (10)",
        "Traslation": "اللہ کے بغیر کوئی معبود برحق نہیں ، وہ اکیلا ہے اس کا کوئی شریک نہیں۔ اسی کی پادشاہی ہے اور اسی کے لیے تمام تعریفیں ہیں اور وہی ہر چیز پر قدرت رکھنے والا ہے - ۱۰ بار -"
    },
    {
        "ID": 15,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَلِكُ  الْجَبَّارُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو زبردست اور زور آور بادشاہ ہے"
    },
    {
        "ID": 16,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْوَاحِدُ  الْقَهَّارُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو اکیلا غالب ہے"
    },
    {
        "ID": 17,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْعَزِيْزُ  الْغَفَّار",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو طاقت والا ، بہت فغفرت کرنے والا ہے"
    },
    {
        "ID": 18,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْكَرِيْمُ  السَّتَّارُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو کریم اور عیبوں پر پردہ ڈالنے والا ہے"
    },
    {
        "ID": 19,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْكَبِيْرُ  الْمُتَعَالُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو بزرگ اور فائق ہے"
    },
    {
        "ID": 20,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَالِقُ  اللَّيْلِ  وَ  النَّهَارُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو دن رات کا پیدا کرنے والا ہے"
    },
    {
        "ID": 21,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَعْبُوْدُ  بِكُلِّ  مَكَانٍ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جس کی ہر جگہ عبادت کی جاتی ہے"
    },
    {
        "ID": 22,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَذْكُوْرُ  بِكُلِّ  لِسَانٍ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جس کا ہر زبان سے ذکر کیا جاتا ہے"
    },
    {
        "ID": 23,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَعْرُوْفُ  بِكُلِّ  اِحْسَانٍ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو ہر احسان کے ساتھ مشہور ہے"
    },
    {
        "ID": 24,
        "Arabic": "لَا  ِلٰهَ  اِلَّا  اللّٰهُ  كُلَّ  يَوْمٍ  هُوَ  فِى  شَانٍ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو ہر دن ایک نئی شان میں ہوتا ہے"
    },
    {
        "ID": 25,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اِيْمَانًا  بِۢااللّٰهِ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں اللہ پر ایمان لاتے ہوئے"
    },
    {
        "ID": 26,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَمَانًا  مِّنَّ  اللّٰهِ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں اللہ سے امن مانگتے ہوئے"
    },
    {
        "ID": 27,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَمَانَةً مِنْ عِنْدِ  اللّٰهِ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں اللہ کے پاس امانت رکھتے ہوئے"
    },
    {
        "ID": 28,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  وَلَا حَوْلَ  وَلَا  قُوَّةَ  اِلَّا بِااللّٰه",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں اور اللہ کے سوا کسی اور کو طاقت نہیں"
    },
    {
        "ID": 29,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  وَلَا  نَعْبُدُ  اِلَّا  اِيَّاهُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں اور ہم اس کے بغیر کسی اور کی عبادت نہیں کرتے"
    },
    {
        "ID": 30,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  حَقًّا  حَقًّا",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں اور یہ بات بالکل سچ ہے"
    },
    {
        "ID": 31,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اِيْمَانًا  وَّصِدْقًا",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں ایمان اور سچّائی سے (کہتا ہوں)"
    },
    {
        "ID": 32,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  تَعَبُّدًا  وَّرِقًّا",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں بندگی اور غلامی کے ساتھ (کہتا ہوں)"
    },
    {
        "ID": 33,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  تَلَطُّفًا  وَّرِفْقًا",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں مہربانی اور رفاقت(کے اعتبار) سے"
    },
    {
        "ID": 34,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  قَبْلَ  كُلِّ  شىْءٍ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو ہر چیز سے پہلے ہے"
    },
    {
        "ID": 35,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  بَعْدَ  كُلِّ  شىْءٍ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو ہر چیز کے بعد باقی ہے"
    },
    {
        "ID": 36,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  يَبْقٰى  رَبُّنَا  وَ  يَفْنٰى  وَيَمُوْتُ  كُلُّ  شىْءٍ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں ، ہمارا پروردگار باقی رہے گا اور ہر ایک چیز فنا ہو جائے گی اور مر جائے گی"
    },
    {
        "ID": 37,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَلِكُ  الْحَقُّ  الْمُبِيْنُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو بادشاہِ حقیقی اور ظاہر و ممتاز ہے"
    },
    {
        "ID": 38,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَلِكُ  الْحَقُّ  الْيَقِيْنُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو بادشاہِ حقیقی و یقینی ہے"
    },
    {
        "ID": 39,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْعَلِىُّ  الْعَظِيْمُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو بلند اور بڑا ہے"
    },
    {
        "ID": 40,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْحَلِيْمُ  الْكَرِيْمُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو بردبار اور سخی ہے"
    },
    {
        "ID": 41,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  رَبُّ  السَّمٰوٰتِ  السَّبْعِ  وَ  رَبُّ  الْعَرْشِ  الْعَظِيْمُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو سات آسمانوں کا پالنے والا اور عرش عظیم کا پروردگار ہے"
    },
    {
        "ID": 42,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَكْرَمُ  الْاَكْرَمِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو تمام سخیوں سے زیادہ سخی ہے"
    },
    {
        "ID": 43,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَرْحَمُ  الرَّاحِمِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو تمام مہربانوں سے زیادہ مہربان ہے"
    },
    {
        "ID": 44,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  حَبِيْبُ  التَّوَّابِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو تمام توبہ کرنے والوں کو دوست رکتھا ہے"
    },
    {
        "ID": 45,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  رَاحِمُ  الْمَسَاكِيْنِ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو مسکینوں پر رحم کرنے والا ہے"
    },
    {
        "ID": 46,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  هَادِىَ  الْمُضَلِّيْنِ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو گمراہوں کو سیدھا راستہ دکھانے والا ہے"
    },
    {
        "ID": 47,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  دَلِيْلُ  الْحَاْئِرِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو حیرانوں کا راہ نما ہے"
    },
    {
        "ID": 48,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَمَانُ  الْخَاْئِفِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو خوف کے ماروں کے لئے امن ہے"
    },
    {
        "ID": 49,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  غَيٰاثُ  الْمُسْتَغِيْثِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو فریادیوں کی فریاد کو پہنچنے والا ہے"
    },
    {
        "ID": 50,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  النَّاصِرِيْنِ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو مددگاروں میں سے بہتر مددگار ہے"
    },
    {
        "ID": 51,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الْحَافِظِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو محافظوں میں سے بہتر محافظ ہے"
    },
    {
        "ID": 52,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الْوَارِثِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو بہتر وارث عطا کرنے والا ہے"
    },
    {
        "ID": 53,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الْحَاكِمِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو بہترین حاکم ہے"
    },
    {
        "ID": 54,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الرَّازِقِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو سب سے اچھا رزق دینے والا ہے"
    },
    {
        "ID": 55,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الْفَاتِحِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو تمام مشکلوں کو حل کرنے والا ہے"
    },
    {
        "ID": 56,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الْغَافِرِيْنَ",
        "Traslation": "کے بغیر کوئی اور معبود نہیں جو بہتر مغفرت کرنے والا ہے"
    },
    {
        "ID": 57,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الرَّاحِمِيْنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو بہتر رحم کرنے والا ہے"
    },
    {
        "ID": 58,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  وَحْدَهٗ  وَصَدَقَ  وَعْدَهٗ  وَنَصَرَ  عَبْدَهٗ  وَاَعَذَّ  جُنْدُهٗ  وَ  هَذَمَ  الْاَحْذَاْبَ  وَحْدَهٗ  وَلَاْ  شَىْءَ  بَعْدَهٗ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں وہ اکیلا ہے اور اس نے اپنا وعدہ سچّا کیا اور اپنے بندے (حضرت محمدؐ) کی مدد کی اور ان کے لشکر کو غالب بنا دیا اور اس کی اکیلی ذات نے کافروں کو شکست دی اور اس کے بعد کوئی اور چیز نہیں"
    },
    {
        "ID": 59,
        "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَهْلُ  النِّعْمَةِ  وَ  لَهُ  الْفَضْلُ  وَلَهُ  الْثَنَآءُ  الْحَسَنَ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو نعمت والا ہے اور اسی کے لئے فضیلت ہے اور اسی کے لئے اچھی تعریف ہے"
    },
    {
        "ID": 60,
        "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  عَدَدَ  خَلْقِهٖ  وَذِنَةَ  عَرْشِهٖ  وَرِضَآءَ  نَفْسِهٖ  وَمِدَادَ  كَلِمَاتِهٖ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں ، اس کی مخلوق کے شمار، اس کے عرش کے وزن، اس کی ذات کی رضامندی اور اس کے کلمات کی روشنائی کے برابر"
    },
    {
        "ID": 61,
        "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  صَاحِبُ  الْوَحْدَانِيَّةِ  الْفَرْدَانِيَّةِ  الْقَدِيْمِيَّةِ  الْاَذَلِيَّةِ  الْاَبَدِيَّةِ  لَيْسَ  لَهُ  ضِدٌّ  وَلَا  نِدٌّ  وَلَا  شِبْهٌ  وَلَا  شَرِيْكٌ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو صرف ایک واحد مفرد اور ابتدائ سے لے کر ہمیشہ رہنے والی ذات ہے۔ جس کی نہ کوئی ضد ہے نہ کوئی اس کے برابر کا ہے۔ نہ کوئی اس کے مانند ہے اور نہ ساجھی ہے اس ک"
    },
    {
        "ID": 62,
        "Arabic": "لَا  اِلٰهَ  الَّا  اللّٰهُ  وَحْدَهٗ  لَا  شَرِيْكَ  لَهٗ  لَهُ  الْمَلْكُ  وَ  لَهُ  الْحَمْدُ  يُحْيِىْ  وَ  يُمِيْتُ  وَ  هُوَ  حَىٌّ  لَّا  يَمُوْتُ  بِيَدِهِ  الْخَيْرُ  وَ  هُوَ  عَلٰى  كُلِّ  شىْءٍ  قَدِيْرٌ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں۔ وہ اکیلا ہے۔ اس کا کوئی شریک نہیں اسی کے لئے بادشاہی شایانِ شان ہے اور اسی کے لئے تمام تعریفیں ہیں جو زندہ کرتا اور مارتا ہے۔ وہ زندہ ہے۔ جو کبھی نہیں مریگا۔ اسی کے اختیار میں خیر ہے۔ اور وہ ہر چیز پر قدرت رکھتا ہے"
    },
    {
        "ID": 63,
        "Arabic": "وَاِلَيْهِ  الْمَصِيْرُ  هُوَ  الْاَوَّلُ  وَلْاٰخِرُ  وَالظَّاهِرُ  وَالْبَاطِنُ  وَ  هُوَ  بِكُلِّ  شَىْءٍ  عَلِيْمٌ  لَيْسَ  كَمِثْلِهٖ  شَىْءٌ  وَّ  هُوَ  السَّمِيْعُ  الْبَصِيْرُ",
        "Traslation": "اور اسی کی طرف سب کو لوٹنا ہے۔ وہ سب سے پہلے ہے اور سب سے پیچھے وہ ظاہر بھی ہے اور باطن بھی وہ ہر چیز کو جانتا ہے۔ اس جیسی کوئی چیز نہیں وہ سننے اور دیکھنے والا ہے"
    },
    {
        "ID": 64,
        "Arabic": "حَسْبَنَا  اللّٰهُ  وَ  نِعْمَ  الْوَكِيْلُ  نِعْمَ  الْمَوْلٰى  وَ  نِعْمَ  النَّصِيْرُ",
        "Traslation": "ہمیں اللہ کافی ہے اور وہ بہتر کارساز ہے ۔ اچھا آقا اور اچھا مددگار ہے"
    },
    {
        "ID": 65,
        "Arabic": "حَسْبَنَا  اللّٰهُ  وَ  نِعْمَ  الْوَكِيْلُ  نِعْمَ  الْمَوْلٰى  وَ  نِعْمَ  النَّصِيْرُ",
        "Traslation": "ہمیں اللہ کافی ہے اور وہ بہتر کارساز ہے ۔ اچھا آقا اور اچھا مددگار ہے"
    },
    {
        "ID": 66,
        "Arabic": "حَسْبَنَا  اللّٰهُ  وَ  نِعْمَ  الْوَكِيْلُ  نِعْمَ  الْمَوْلٰى  وَ  نِعْمَ  النَّصِيْرُ",
        "Traslation": "ہمیں اللہ کافی ہے اور وہ بہتر کارساز ہے ۔ اچھا آقا اور اچھا مددگار ہے"
    },
    {
        "ID": 67,
        "Arabic": "غُفْرَانَكَ  رَبَّنَا  وَ  اِلَيْكَ  الْمَصِيْرُ",
        "Traslation": "اے ہمارے پروردگار ۔ ہم تیری مغفرت چاہتے ہیں اور تیری ہی طرف لوٹنے کی جگہ ہے"
    },
    {
        "ID": 68,
        "Arabic": "اَللّٰهُمَّ  لَا  مَانِعَ  لِمَا  اَعْطَيْتَ  وَلَا  مُعْطِےَ  لِمَا  مَنَعْتَ  وَلَا  رَآدَّ  لِمَا  قَضَيْتَ  وَلَا  يَنْفَعُ  ذَالْجَدِّ  مِنْكَ  الْجَدُّ",
        "Traslation": "اے میرے اللہ جو کچھ تو عطا کرے اسے کوئی روکنے والا نہیں اور جو چیز تو روک لے گا وہ کوئی دے نہیں سکتا۔ اور جو کچھ تو فیصلہ کر دے اسے کوئی ٹال نہیں سکتا۔ اور تیرے سامنے دولت مند کو دولت مندی کوئی فائدہ نہیں دیتی ہے"
    },
    {
        "ID": 69,
        "Arabic": "سُبْحَانَ  رَبِّىَ  الْعَلِىَّ  الْاَعْلَى  الوَهَابِ",
        "Traslation": "بہت پاک ہے میرا پروردگار جو بہت ہی اونچا اور بہت بخشنے والا ہے"
    },
    {
        "ID": 70,
        "Arabic": "سُبْحَانَ  رَبِّىَ  الْعَلِىَّ  الْاَعْلَى  الوَهَابِ",
        "Traslation": "بہت پاک ہے میرا پروردگار جو بہت ہی اونچا اور بہت بخشنے والا ہے"
    },
    {
        "ID": 71,
        "Arabic": "سُبْحَانَ  رَبِّىَ  الْعَلِىَّ  الْاَعْلَى  الوَهَابِ",
        "Traslation": "بہت پاک ہے میرا پروردگار جو بہت ہی اونچا اور بہت بخشنے والا ہے"
    },
    {
        "ID": 72,
        "Arabic": "سُبْحَانَ  رَبِّىَ  الْعَلِّىِ  الْاَعْلَى  الْكَرِيْمِ  الْوَهَابِ  يَا  وَهَّابُ",
        "Traslation": "پاک ہے میرا رب جو سب سے بلند اور بخشنے والا اور بہت عطا کرنے والا ہے، اے بہت بخشنے والے"
    },
    {
        "ID": 73,
        "Arabic": "سُبْحٰنَكَ  مَا  عَبَدْنَاكَ  حَقَّ  عِبَادَتِكَ",
        "Traslation": "تو پاک ہے ۔ ہم نے تیری عبادت جیسا کہ تیرا حق تھا نہیں کی"
    },
    {
        "ID": 74,
        "Arabic": "سُبْحٰنَكَ  مَا  عَرَفْنَاكَ  حَقَّ  مَعْرِفَتِكَ",
        "Traslation": "تو پاک ہے ہم نے تجھے جیسا کہ تیرا حق تھا نہیں پہچان"
    },
    {
        "ID": 75,
        "Arabic": "سُبْحٰنَكَ  مَا  ذَكَرْنَاكَ  حَقَّ  ذِكْرِكَ",
        "Traslation": "تو پاک ہے (اے خدا) ہم نے تیرا ذکر جیسا کہ تیرا حق تھا نہیں کی"
    },
    {
        "ID": 76,
        "Arabic": "سُبْحٰنَكَ  مَا  شَكَرْنَاكَ  حَقَّ  شُكْرِكَ",
        "Traslation": "تو پاک ہے۔ ہم نے تیرے حق کے مطابق تیرا شکر نہیں کیا"
    },
    {
        "ID": 77,
        "Arabic": "سُبْحٰنَ  اللّٰهِ  الْاَبَدِىِّ  الْاَبَدِ",
        "Traslation": "میں اللہ کی پاکی بیان کرتا ہوں جو ہمیشہ ہمیشہ رہنے والا ہے"
    },
    {
        "ID": 78,
        "Arabic": "سُبْحٰنَ  اللّٰهِ  الْوَاحِدِ  الْاَحَدِ",
        "Traslation": "میں اللہ کی پاکی بیان کرتا ہوں جو ایک اکیلا ہے"
    },
    {
        "ID": 79,
        "Arabic": "سُبْحَانَ  اللّٰهِ  الْفَرَدِ  الصَّمَدِ",
        "Traslation": "اس اللہ کی پاکی بیان کرتا ہوں جو ایک اور بے نیاز ہے"
    },
    {
        "ID": 80,
        "Arabic": "سُبْحٰنَ  اللّٰهِ  رَافِعِ  السَّمٰوٰتِ  بِغَيْرِ  عَمَدٍ",
        "Traslation": "اللہ کی پاکی بیان کرتا ہوں جو آسمانوں کو بغیر ستونوں کے بلند کرنے والا ہے"
    },
    {
        "ID": 81,
        "Arabic": "سُبْحَانَ  اللّٰهِ  الَّذِىْ  لَمْ  يَتَّخِذْ  صَاحِبَةً  وَّلَا  وَلَدً",
        "Traslation": "اُس اللہ کی پاکی بیان کرتا ہوں جس نے نہ بیوی اختیار کی ہے اور نہ اولاد"
    },
    {
        "ID": 82,
        "Arabic": "سُبْحَانَ  اللّٰهِ  الَّذِىْ  لَمْ  يَلِدْ  وَ  لَمْ  يُوْلَدْ  وَلَمْ  يَكُنْ  لَهُ  كُفُوًا  اَحَدٌ",
        "Traslation": "پاک ہے وہ اللہ جس نے نہ تو کسی کو جنا ہے اور نہ وہ کسی سے جنا گیا ہے اور نہ ہی اس کا کوئی ہمسر اور برابر ہے"
    },
    {
        "ID": 83,
        "Arabic": "سُبْحَانَ اللّٰهِ الْملِكِ  الْقُدُّوْسِ",
        "Traslation": "پاک ہے (اللہ جو) پاکیزہ بادشاہ ہے"
    },
    {
        "ID": 84,
        "Arabic": "سُبْحَانَ  ذِىْ  الْمُلْكِ  وَ  الْمَلَكُوْتِ",
        "Traslation": "پاک ہے وہ اللہ جو ظاہری دنیا اور فرشتوں کی دنیا کا مالک ہے"
    },
    {
        "ID": 85,
        "Arabic": "سُبْحَانَ  ذِىْ  الْعِزَّةِ  وَ  الْعَظْمَةِ  وَالْقُدْرَةِ  وَالهَيْبَةِ  وَالْجَلَالِ  وَالْجَمَالِ  وَالْكَمَالِ  وَالْبَقَآءِ  وَالثَّنَاءِ  وَالضِّيْآءِ  وَلْاٰلَآءِ  وَالنَّعْمَآءِ  وَالْكِبْرِيَآءِ  وَالْجَبَرُوْتِ",
        "Traslation": "پاک ہے (اللہ جو) عزّت بڑائی، قدرت، ہیبت، اور رعب ، خوبصورتی، کمال، ہمیشگی، تعریف، روشنی اور باطنی اور ظاہری نعمتوں والا اور بڑائی اور بہت رعب داب والا ہے"
    },
    {
        "ID": 86,
        "Arabic": "سُبْحَانَ  الْمَلِكِ  الْحَىِّ  الَّذِىْ  لَا  يَنَامُ  وَلَا  يَمُوْتُ",
        "Traslation": "پاک ہے وہ بادشاہ جو زندہ جاوید ہے جو نہ سوتا ہے اور نہ مرتا ہے"
    },
    {
        "ID": 87,
        "Arabic": "سُبُّوْحٌ  قُدٌوْسٌ  رَبُّنَا  وَرَبُّ  الْمَلٰٓئِكَةِ  وَ  الرُّوْحِ",
        "Traslation": "وہ بہت پاک اور منزّہ ہے وہ ہمارا پروردگار اور فرشتوں کا پروردگار اور روح کا پروردگار ہے"
    },
    {
        "ID": 88,
        "Arabic": "سُبْحَانَ  اللّٰهِ  وَالْحَمدُ  لِلّٰهِ  وَ  لَا  اِلٰهَ  الَّا  اللّٰهُ  وَاللّٰهُ  اَكْبَرْ  وَلَا  حَوْلَ  وَلَا  قُوَّةَ  اِلَّا  بِااللّٰهِ  الْعَلِىِّ  الْعَظِيْم",
        "Traslation": "پاک ہے اللہ اور تمام تعریفیں اللہ کے لیے ہیں۔ اور اللہ کے بغیر کوئی اور معبود نہیں اور اللہ سب سے بڑا ہے اور اللہ کے بغیر کسی اور کو طاقت اور قدرت نہیں جو بلند اور برتر ہے"
    },
    {
        "ID": 89,
        "Arabic": "اَللّٰهُمَّ  اَنْتَ  الْمَلِكُ  الْحَقُّ  الَّذِىْ  لَا  اِلٰهَ  اِلَّا  اَنْتَ",
        "Traslation": "اے میرے اللہ تو بادشاہِ حقیقی ہے۔ تیری بغیر کوئی معبود نہیں"
    },
    {
        "ID": 90,
        "Arabic": "يَااَللّٰهُ",
        "Traslation": "۔ اے خدا"
    },
    {
        "ID": 91,
        "Arabic": "يَارَحْمٰنُ",
        "Traslation": "اے دنیا کے مہربان"
    },
    {
        "ID": 92,
        "Arabic": "يَارَحِيْمُ",
        "Traslation": "اے آخرت کے مہربان"
    },
    {
        "ID": 93,
        "Arabic": "يَامَلِكُ",
        "Traslation": "اے بادشاہ"
    },
    {
        "ID": 94,
        "Arabic": "يَاقُدُّوْسُ",
        "Traslation": "اے پاک"
    },
    {
        "ID": 95,
        "Arabic": "يَاسَلَامُ",
        "Traslation": "اےسلامتی والے"
    },
    {
        "ID": 96,
        "Arabic": "يَامُؤْمِنُ",
        "Traslation": "اے امن دینے والا"
    },
    {
        "ID": 97,
        "Arabic": "يَامُهَيْمِنُ",
        "Traslation": "اے نگہبان"
    },
    {
        "ID": 98,
        "Arabic": "يَاعَزِيْزُ",
        "Traslation": "اے غالب"
    },
    {
        "ID": 99,
        "Arabic": "يَاجَبَّارُ",
        "Traslation": "اے زبردست"
    },
    {
        "ID": 100,
        "Arabic": "يَامُتَكَبِّرُ",
        "Traslation": "اے عظمت والے"
    },
    {
        "ID": 101,
        "Arabic": "يَاخَالِقُ",
        "Traslation": "اے پیدا کرنے والے"
    },
    {
        "ID": 102,
        "Arabic": "يَابَارِئُ",
        "Traslation": "اے آسمان پیدا کرنے والے"
    },
    {
        "ID": 103,
        "Arabic": "يَامُصَوِّرُ",
        "Traslation": "اے صورتیں بنانے والے"
    },
    {
        "ID": 104,
        "Arabic": "يَاغَفَّارُ",
        "Traslation": "اے بہت مغفرت کرنیوالے"
    },
    {
        "ID": 105,
        "Arabic": "يَاقَهَّارُ",
        "Traslation": "اے بہت قہر کرنے والے"
    },
    {
        "ID": 106,
        "Arabic": "يَاوَهَّابُ",
        "Traslation": "اے بہت بخشنے والے"
    },
    {
        "ID": 107,
        "Arabic": "يَارَزَّاقُ",
        "Traslation": "اے بہت رزق دینے والے"
    },
    {
        "ID": 108,
        "Arabic": "يَافَتَّاحُ",
        "Traslation": "اے رحمت کا دروازہ کھولنے والے"
    },
    {
        "ID": 109,
        "Arabic": "يَاعَلِيْمُ",
        "Traslation": "اے بہت جاننے والے"
    },
    {
        "ID": 110,
        "Arabic": "يَاقَابِضُ",
        "Traslation": "اے رزق تنگ کرنیوالے"
    },
    {
        "ID": 111,
        "Arabic": "يَابَاسِطُ",
        "Traslation": "اے وسعت عطا کرنےوالے"
    },
    {
        "ID": 112,
        "Arabic": "يَاخَافِضُ",
        "Traslation": "اے پست کرنے والے"
    },
    {
        "ID": 113,
        "Arabic": "يَارَافِعُ",
        "Traslation": "اے بلند کرنے والے"
    },
    {
        "ID": 114,
        "Arabic": "يَامُعِزُّ",
        "Traslation": "اے عزّت دینے والے"
    },
    {
        "ID": 115,
        "Arabic": "يَامُزِلُّ",
        "Traslation": "اے ذلّت دینے والے"
    },
    {
        "ID": 116,
        "Arabic": "يَاسَمِيْعُ",
        "Traslation": "اے بہت سننے والے"
    },
    {
        "ID": 117,
        "Arabic": "يَابَصِيْرُ",
        "Traslation": "اے بہت دیکھنے والے"
    },
    {
        "ID": 118,
        "Arabic": "يَاحَكَمُ",
        "Traslation": "اے فیصلہ کرنے والے"
    },
    {
        "ID": 119,
        "Arabic": "يَاعَدْلُ",
        "Traslation": "اے انصاف کرنیوالے"
    },
    {
        "ID": 120,
        "Arabic": "يَالَطِيْفُ",
        "Traslation": "اے مہربان"
    },
    {
        "ID": 121,
        "Arabic": "يَاخَبِيْرُ",
        "Traslation": "اے خبر رکھنے والے"
    },
    {
        "ID": 122,
        "Arabic": "يَاحَلِيْمُ",
        "Traslation": "اے بردبار"
    },
    {
        "ID": 123,
        "Arabic": "يَاعَظِيْمُ",
        "Traslation": "اے عظمت والے"
    },
    {
        "ID": 124,
        "Arabic": "يَاغَفُوْرُ",
        "Traslation": "اے بخشنے والے"
    },
    {
        "ID": 125,
        "Arabic": "يَاشَكُوْرُ",
        "Traslation": "اے فررمابرداروں کے قدردان"
    },
    {
        "ID": 126,
        "Arabic": "يَاعَلِىُّ",
        "Traslation": "۔ اے بہت اونچے"
    },
    {
        "ID": 127,
        "Arabic": "يَاكَبِيْرُ",
        "Traslation": "اے بہت بڑے"
    },
    {
        "ID": 128,
        "Arabic": "يَاحَفِيْظُ",
        "Traslation": "اے حفاظت کرنیوالے"
    },
    {
        "ID": 129,
        "Arabic": "يَامُقِيْتُ",
        "Traslation": "اے روزی دینے والے"
    },
    {
        "ID": 130,
        "Arabic": "يَاحَسِيْبُ",
        "Traslation": "اے مصائب میں کافی ہونیوالے"
    },
    {
        "ID": 131,
        "Arabic": "يَاجَلِيْلُ",
        "Traslation": "اے بہت بڑے"
    },
    {
        "ID": 132,
        "Arabic": "يَاكَرِيْمُ",
        "Traslation": "اے بہت سخی"
    },
    {
        "ID": 133,
        "Arabic": "يَارَقِيْبُ",
        "Traslation": "اے خیال رکھنے والے"
    },
    {
        "ID": 134,
        "Arabic": "يَامُجِيْبُ",
        "Traslation": "اے دعا قبول کرنیوالے"
    },
    {
        "ID": 135,
        "Arabic": "يَاوَاسِعُ",
        "Traslation": "اے وسعت کرنے والے"
    },
    {
        "ID": 136,
        "Arabic": "يَاحَكِيْمُ",
        "Traslation": "اے حکمت کرنے والے"
    },
    {
        "ID": 137,
        "Arabic": "يَاوَدُوْدُ",
        "Traslation": "اے محبت کرنے والے"
    },
    {
        "ID": 138,
        "Arabic": "يَامَجِيْدُ",
        "Traslation": "اے بزرگی والے"
    },
    {
        "ID": 139,
        "Arabic": "يَابَاعِثُ",
        "Traslation": "اے قبروں سے اٹھانیوالے"
    },
    {
        "ID": 140,
        "Arabic": "يَاشَهِيْدُ",
        "Traslation": "اے حاضر و ناظر"
    },
    {
        "ID": 141,
        "Arabic": "يَاحَقُّ",
        "Traslation": "اے وہ ذات جسکا وجود ثابت ہے"
    },
    {
        "ID": 142,
        "Arabic": "يَاوَكِيْلُ",
        "Traslation": "اے کارساز"
    },
    {
        "ID": 143,
        "Arabic": "يَاقَوِىُّ",
        "Traslation": "اے طاقت والے"
    },
    {
        "ID": 144,
        "Arabic": "يَامَتِيْنُ",
        "Traslation": "اے سنجیدہ"
    },
    {
        "ID": 145,
        "Arabic": "يَاوَلِىُّ",
        "Traslation": "اے دوستی کرنیوالے"
    },
    {
        "ID": 146,
        "Arabic": "يَاحَمِيْدُ",
        "Traslation": "اے تعریف والے"
    },
    {
        "ID": 147,
        "Arabic": "يَامُحْصِىْ",
        "Traslation": "اے گِننے والے"
    },
    {
        "ID": 148,
        "Arabic": "يَامُبْدِئُ",
        "Traslation": "اے پیدا کرنے والے"
    },
    {
        "ID": 149,
        "Arabic": "يَامُعِيْدُ",
        "Traslation": "اے دوبارہ لوٹانے والے"
    },
    {
        "ID": 150,
        "Arabic": "يَامُحْيِىْ",
        "Traslation": "اے زندہ کرنے والے"
    },
    {
        "ID": 151,
        "Arabic": "يَامُمِيْتُ",
        "Traslation": "اے مارنے والے"
    },
    {
        "ID": 152,
        "Arabic": "يَاحَىُّ",
        "Traslation": "اے زندہ جاوید"
    },
    {
        "ID": 153,
        "Arabic": "يَاقَيُّوْمُ",
        "Traslation": "اے کائنات کو سنبھالنے والے"
    },
    {
        "ID": 154,
        "Arabic": "يَاوَاجِدُ",
        "Traslation": "اے صاحب وجود"
    },
    {
        "ID": 155,
        "Arabic": "يَامَاجِدُ",
        "Traslation": "اے بزرگی والے"
    },
    {
        "ID": 156,
        "Arabic": "يَاوَاحِدُ",
        "Traslation": "اے خوبیوں میں یکتا"
    },
    {
        "ID": 157,
        "Arabic": "يَااَحَدُ",
        "Traslation": "اے وجود میں ایک"
    },
    {
        "ID": 158,
        "Arabic": "يَاصَمَدُ",
        "Traslation": "اے بے نیاز"
    },
    {
        "ID": 159,
        "Arabic": "يَاقَادِرُ",
        "Traslation": "اے قدرت والے"
    },
    {
        "ID": 160,
        "Arabic": "يَامُقْتَدِرُ",
        "Traslation": "اے اقتدار و عزت والے"
    },
    {
        "ID": 161,
        "Arabic": "يَامُقَدِّمُ",
        "Traslation": "اے آگے کرنے والے"
    },
    {
        "ID": 162,
        "Arabic": "يَامُؤَخِّرُ",
        "Traslation": "اے پیچھے کرنے والے"
    },
    {
        "ID": 163,
        "Arabic": "يَااَوَّلُ",
        "Traslation": "اے سب سے پہلے"
    },
    {
        "ID": 164,
        "Arabic": "يَااٰخِرُ",
        "Traslation": "اے سب سے آخر"
    },
    {
        "ID": 165,
        "Arabic": "يَاظَاهِرُ",
        "Traslation": "اے ظاہر"
    },
    {
        "ID": 166,
        "Arabic": "يَابَاطِنُ",
        "Traslation": "اے پوشیدہ"
    },
    {
        "ID": 167,
        "Arabic": "يَاوَالِىْ",
        "Traslation": "اے مالک"
    },
    {
        "ID": 168,
        "Arabic": "يَامُتَعَالِىْ",
        "Traslation": "اے بلند"
    },
    {
        "ID": 169,
        "Arabic": "يَابَرُّ",
        "Traslation": "اے احسان کرنیوالے"
    },
    {
        "ID": 170,
        "Arabic": "يَاتَوَّابُ",
        "Traslation": "اے توبہ قبول کرنے والے"
    },
    {
        "ID": 171,
        "Arabic": "يَامُنْعِمُ",
        "Traslation": "اے نعمتیں عطا کرنیوالے"
    },
    {
        "ID": 172,
        "Arabic": "يَامُنْتَقِمُ",
        "Traslation": "اے بدلہ لینے والے"
    },
    {
        "ID": 173,
        "Arabic": "يَاعَفُوُّ",
        "Traslation": "اے معاف کرنیوالے"
    },
    {
        "ID": 174,
        "Arabic": "يَارَؤُفُ",
        "Traslation": "اے مہربان"
    },
    {
        "ID": 175,
        "Arabic": "يَامَالِكَ  الْمُلْكِ",
        "Traslation": "اے تمام جہاں کے بادشاہ"
    },
    {
        "ID": 176,
        "Arabic": "يَا  ذَالْجَلَالِ  وَالْاِكْرَامِ",
        "Traslation": "اے عزّت اور بزرگی والے"
    },
    {
        "ID": 177,
        "Arabic": "يَارَبُّ",
        "Traslation": "اے پالنے والے"
    },
    {
        "ID": 178,
        "Arabic": "يَامُقْسِطُ",
        "Traslation": "اے انصاف کرنیوالے"
    },
    {
        "ID": 179,
        "Arabic": "يَاجَامِعُ",
        "Traslation": "اے جمع کرنے والے"
    },
    {
        "ID": 180,
        "Arabic": "يَاغَنِىُّ",
        "Traslation": "اے بے نیاز"
    },
    {
        "ID": 181,
        "Arabic": "يَامُغْنِى",
        "Traslation": "اے بے نیاز کرنے والے"
    },
    {
        "ID": 182,
        "Arabic": "يَامُعْطِىْ",
        "Traslation": "اے عطا کرنے والے"
    },
    {
        "ID": 183,
        "Arabic": "يَامَانِعُ",
        "Traslation": "برائیوں سے روکنے والے"
    },
    {
        "ID": 184,
        "Arabic": "يَاضَآرُّ",
        "Traslation": "اے نقصان پہنچانے والے"
    },
    {
        "ID": 185,
        "Arabic": "يَانَافِعُ",
        "Traslation": "اے نفع دینے والے"
    },
    {
        "ID": 186,
        "Arabic": "يَانُوْرُ",
        "Traslation": "اے نور بخشنے والے"
    },
    {
        "ID": 187,
        "Arabic": "يَاهَادِىْ",
        "Traslation": "اے ہدایت کرنےوالے"
    },
    {
        "ID": 188,
        "Arabic": "يَابَدِيْعُ",
        "Traslation": "اےپیدا کرنے والے"
    },
    {
        "ID": 189,
        "Arabic": "يَابَاقِىْ",
        "Traslation": "اے ہمیشہ رہنے والے"
    },
    {
        "ID": 190,
        "Arabic": "يَاوِارثُ",
        "Traslation": "اے کائنات کے مالک"
    },
    {
        "ID": 191,
        "Arabic": "يَارَشِيْدُ",
        "Traslation": "اے ہدایت کرنیوالے"
    },
    {
        "ID": 192,
        "Arabic": "يَاصَبُوْرُ",
        "Traslation": "اے بہت صبر کرنیوالے"
    },
    {
        "ID": 193,
        "Arabic": "يَاصَبُوْرُ",
        "Traslation": "اے بہت صبر کرنیوالے"
    },
    {
        "ID": 194,
        "Arabic": "يَاصَادِقُ",
        "Traslation": "اے سچّے"
    },
    {
        "ID": 195,
        "Arabic": "يَاسَتَّارُ",
        "Traslation": "اے پردہ کرنیوالے"
    },
    {
        "ID": 196,
        "Arabic": "يَا  مَنْ  تَقَدَّسَتْ  عَنِ  الْاشْبَاهِ  ذَاتُهٗ",
        "Traslation": "اے وہ خدا جس کی ذات ہم شکل ہونے سے پاک ہے"
    },
    {
        "ID": 197,
        "Arabic": "وَ  تَنَزَّهَتْ  عَنْ  مُشَابَهَةِ  الْاَمْثَالِ  صِفَاتُهٗ",
        "Traslation": "اور جس کی صفتیں مثل ہونے سے پاک اور منزّہ ہیں"
    },
    {
        "ID": 198,
        "Arabic": "يَا  مَنْ  دَلَّتْ  عَلٰى  وَحْدَانِيَّتِهٖ  اٰيَاتُهٗ  وَ  شَهِدَتْ  بِرَبُوْبِيَّتِهٖ  مَصْنُوْعَاتُهٗ",
        "Traslation": "اور اے وہ خدا جس کے ایک ہونے پر اس کی نشانیاں دلالت کرتی ہیں اور اس کی بنائی ہوئی چیزیں اس کے پروردگار ہونے پر گواہ ہیں"
    },
    {
        "ID": 199,
        "Arabic": "وَاحِدٌ  لَّا  مِنْ  قِلَّةٍ  وَّ  مَوْجُوْدٌ  لَّا  مِنْ  عِلَّةٍ",
        "Traslation": "وہ ایک ہے (مگر) کسی کمی کی وجہ سے نہیں اور موجود ہے (مگر) کسی علّت سے نہیں"
    },
    {
        "ID": 200,
        "Arabic": "يَا  مَنْ  هُوَ  بِلْبِرِّ  مَعْرُوْفٌ  وَّ  بِالْاِحْسَانِ  مَوْصُوْفٌ  مَّۢعْرُوْفٌ  بِۢلَاْ  غَايَةٍ  وَّ  مَوْصُوْفٌ  بِۢلَاْ  نِهَايَةٍ",
        "Traslation": "اے وہ خدا جو نیکی میں مشہور ہے اور احسان (کی صفت) سے موصوف ہے جس کی مشہوری کی کوئی حد نہیں اور (وہ) بے انتہا تعریف کیا گیا ہے"
    },
    {
        "ID": 201,
        "Arabic": "اَوَّلٌ  قَدِيْمٌ  بِۢلَاْ  اِبْتِدَاءٍ  وَّ  اٰخِرٌ  كَرِيْمٌ  بِۢلَاْ  اِنْتِهَآءٍ",
        "Traslation": "(وہ) ابتدا کے بغیر پہلا اور ازلی و ابدی ہے اور بغیر انتہا کے سب سے اخیر اور سخی ہے"
    },
    {
        "ID": 202,
        "Arabic": "وَّغَفَرَ  ذَنُوْبَ  الْمُذْنِبِيْنَ  كَرَمً  وَّ  حِلْماً  يَا  مَنْ  لَّيْسَ  كَمِثْلِهٖ  شَىْءٌ  وَّ هُوَ  السَّمِيْعُ  الْبَصِيْرُ",
        "Traslation": "اور اس نے گناہ گاروں کے گناہ اپنے کرم اور بردباری سے معاف کردیئے۔ اے وہ ذات جس کے مثل کوئی چیز نہیں اور وہ (خدا) بہت سننے اور دیکھنے والا ہے"
    },
    {
        "ID": 203,
        "Arabic": "حَسْبُنَا  اللّٰهُ  وَ  نِعْمَ  الْوَكِيْلُ  نِعْمَ  الْمَوْلٰى  وَ  نِعْمَ  النَّصِيْرُ",
        "Traslation": "ہمیں اللہ کافی ہے اور (وہ) اچھا کارساز ہے اچھا آقا ہے اور کیا خوب مددگار ہے"
    },
    {
        "ID": 204,
        "Arabic": "يَا  دَآئِمًا  بِۢلَاْ  فَنَآءٍ  وَّ  يَا  قَآئِمًا  بِۢلَاْ  زَوَالٍ  وَ  يَا  مُدَبِّرًا  بِۢلَاْ  وَزِيْر",
        "Traslation": "اے فنا کے بغیر ہمیشہ رہنے والے اور اے زوال کے بغیر قائم رہنے والے اور اے وزیر کے بغیر تدبیر کرنے والے"
    },
    {
        "ID": 205,
        "Arabic": "سَهِّلْ  عَلَيْنَا  وَ  عَلٰى  وَالِدَيْنَا  كُلَّ  عَسِيْرٍ",
        "Traslation": "آسان کر ہم پر اور ہمارے ماں باپ پر ہر مشکل کو"
    },
    {
        "ID": 206,
        "Arabic": "لَّآ  اُحْصِىْ  ثَنَآءً  عَلَيْكَ  اَنْتَ  كَمَآ  اَثْنَيْتَ  عَلٰى  نَفْسِكَ  عَزَّ  جَارُكَ  وَجَلَّ  ثَنَآؤُكَ",
        "Traslation": "میں تیری تعریف کا شمار نہیں کر سکتا ہوں۔ تو ایسا ہے جیسا کہ تو نے خود اپنی ذات کی صفات بیان کی ہیں۔ غالب ہے وہ جو تیری پناہ میں آئے اور تیری تعریف سب سے برتر ہے"
    },
    {
        "ID": 207,
        "Arabic": "وَ  تَقَدَّسَتْ  اَسْمَآؤُكَ  وَ  عَظُمَ  شَأْنُكَ  وَلَآ  اِلٰهَ  غَيْرُكَ",
        "Traslation": "اور بہت پاکیزہ ہیں تیرے نام اور تیری شان بلند ہے اور تیرے بغیر کوئی معبود نہیں"
    },
    {
        "ID": 208,
        "Arabic": "يَفْعَلُ  اللّٰهُ  مَا  يَشَآءُ  بِقُدْرَتِهٖ  وَ  يَحْكُمُ  مَا  يُرِيْدُ  بِعِزَّتِهِ",
        "Traslation": "اللہ جو چاہتا ہے کرتا ہے اپنی قدرت سے اور اپنی قوت اور غلبہ سے جو چاہتا ہے حکم دیتا ہے"
    },
    {
        "ID": 209,
        "Arabic": "اَلَآ  اِلَى  اللّٰهِ  تَصِيْرُ  الْاُمُوْرُ  كُلُّ  شَئٍ  هَالِكٌ  اِلَّا  وَجْهَهٗ",
        "Traslation": "خبردار ۔ اللہ کی طرف ہی سب چیزیں لوٹتی ہیں۔ اس کی ذات کے سوا ہر چیز فنا ہونے والی ہے"
    },
    {
        "ID": 210,
        "Arabic": "لَهُ  الحُكْمُ  وَاِلَيْهِ  تُرْجَعُوْنَ",
        "Traslation": "اور اسی کی طرف تم لوٹائے جاؤ گے"
    },
    {
        "ID": 211,
        "Arabic": "فَسَيَكْفِيْكَهُمُ  اللّٰهُ  وَ  هُوَ  السَّمِيْعُ  الْعَلِيْمُ",
        "Traslation": "پس جلد ہی آپ کو (اے محمدؐ) اللہ تعالیٰ ان (منافقوں) سے کفایت کرے گا وہ بہت سننے اور جاننے والا ہے"
    },
    {
        "ID": 212,
        "Arabic": "حَسْبُنَا  اللّٰهُ  وَكَفٰى  سَمِعَ  اللّٰهُ  لِمَنْ  دَعَا وَ لَيْسَ  وَرَآءَ  اللّٰهِ  الْمُنْتَهٰى  مَنِ  اعْتَصَمَ  بِااللّٰهِ  فَقَدْ  نَجٰى",
        "Traslation": "اللہ ہمارے لیے کافی ہے۔ خدا نے اس کی سن لی جس نے اس کو پکارا۔ خدا کے بعد لوگوں کی مرادوں کی اور کہیں انتہا نہیں جس شخص نے اللہ کا دامن پکڑا وہ نجات پاگیا"
    },
    {
        "ID": 213,
        "Arabic": "سُبْحَانَ  مَنْ  لَّمْ  يَزَلْ  رَبَّا  رَّحِيْمًا  وَّ  لَا  يَزَالُ  كَرِيْماً",
        "Traslation": "پاک ہے وہ ذات جو ہمیشہ سے رحم کرنے والا پروردگار ہے اور ہمیشہ سے سخی رہا ہے"
    },
    {
        "ID": 214,
        "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  الْحلِيْمُ  الْكَرِيْمُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں جو بردبار سخی ہے"
    },
    {
        "ID": 215,
        "Arabic": "سُبْحَانَ  اللّٰهِ  وَتَبَارَكَ  اللّٰهُ  رَبُّ  السَّمٰوَاتِ  وَ  رَبُّ  الْعَرْشِ  الْعَظِيْمِ",
        "Traslation": "اللہ پاک ہے اور بابرکت ہے اللہ جو سات آسمانوں اور عرش عظیم کا پالنے والا ہے"
    },
    {
        "ID": 216,
        "Arabic": "وَالْحَمَدُ  لِلّٰهِ  رَبِّ  الْعٰلَمِيْنَ",
        "Traslation": "اور تمام تعریفیں اللہ کے لئے ہیں جو تمام جہانوں کا پروردگار ہے"
    },
    {
        "ID": 217,
        "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  وَحْدَهُ  لَا  شَرِيْكَ  لَهٗ  اِلٰهًا  وَّاحِدًا  اَحَدًا  صَمَدًا  فَرْدًا  وِّتْرًا  حَيًّا  قَيُّوْمًا  دَآئِمًا  اَبَدًا",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں، اکیلا ہے، اس کا کوئی شریک نہیں جو صفت اور ذات میں ایک ہے۔ بے نیاز، یگانہ اور طاق ہے۔ زندہ ہے قائم، دائم اور ہمیشہ رہنے والا"
    },
    {
        "ID": 218,
        "Arabic": "لَّمْ  يَتَّخِذْ  صَاحِبَةً  وَّلَا  وَلَدًا  وَّ  لَمْ  يَكُنْ  لَّهُ  شَرِيْكٌ  فِى  الْمُلْكِ  وَلَمْ  يَكُنْ  لَّهُ  وَلِىٌّ  مِّنَ  الذُّلِّ  وَكَبِّرْهُ  تَكُبِيْرًا",
        "Traslation": "جس کی نہ بیوی ہے اور نہ اوالاد۔ جس کا ملک میں کوئی شریک نہیں ۔ جو کسی عیب یا کمزوری کے سبب مددگار کا محتاج نہیں ہے۔ اس خدا کی بڑائی بیان کرو"
    },
    {
        "ID": 219,
        "Arabic": "اَللّٰهُ  اَكْبَرُ",
        "Traslation": "اللہ بہت بڑا ہے"
    },
    {
        "ID": 220,
        "Arabic": "حَسْبُنَا  اللّٰهُ  لِدِيْنِنَا",
        "Traslation": "ہمیں ہمارے دین کے لیے کافی ہے"
    },
    {
        "ID": 221,
        "Arabic": "حَسْبُنَا  اللّٰهُ  لِدُنْيَانَا",
        "Traslation": "اللہ ہمیں ہماری دنیا کے لئے کافی ہے"
    },
    {
        "ID": 222,
        "Arabic": "حَسْبُنَا  اللّٰهُ  لِمَا  اَهَمَّنَا",
        "Traslation": "اللہ ہمیں ہماری مصیبت کے لئے کافی ہے"
    },
    {
        "ID": 223,
        "Arabic": "حَسْبُنَا  اللّٰهُ  لِمَنْ  بَۢغٰى  عَلَيْنَا",
        "Traslation": "اللہ ہمیں اس شخص کے لئے کافی ہے جو ہم پر ظلم کرے"
    },
    {
        "ID": 224,
        "Arabic": "حَسْبُنَا  اللّٰهُ  لِمَنْ  حَسَدَنَا",
        "Traslation": "اللہ ہمیں اس شخص کے لئے کافی ہے جو ہم سے حسد کرے"
    },
    {
        "ID": 225,
        "Arabic": "حَسْبُنَا  اللّٰهُ  لِمَنْ  كَادَنَا  بالسُّوْءِ",
        "Traslation": "اللہ ہمیں اس شخص کے لئے کافی ہے جو ہمارے خلاف سازش کرے"
    },
    {
        "ID": 226,
        "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  المَوْتِ",
        "Traslation": "اللہ ہمیں موت کے وقت کافی ہے"
    },
    {
        "ID": 227,
        "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  القَبْرِ",
        "Traslation": "اللہ ہمیں قبر کے وقت کافی ہے"
    },
    {
        "ID": 228,
        "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  المَسَآئِلِ",
        "Traslation": "اللہ ہمیں کافی ہے سوالوں کے وقت"
    },
    {
        "ID": 229,
        "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  الصِّرَاطِ",
        "Traslation": "اللہ ہمیں پل صراط کے وقت کافی ہے"
    },
    {
        "ID": 230,
        "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  الْحِسَابِ",
        "Traslation": "اللہ ہمیں حساب کے وقت کافی ہے"
    },
    {
        "ID": 231,
        "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  المِيْزَانِ",
        "Traslation": "اللہ ہمیں تولنے کے وقت کافی ہے"
    },
    {
        "ID": 232,
        "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  الجَنَّةِ  وَالنَّارِ",
        "Traslation": "اللہ ہمیں جنّت اور جہنم میں جانےکے وقت کافی ہے"
    },
    {
        "ID": 233,
        "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  اللِّقآءِ",
        "Traslation": "اللہ ہمیں کافی ہے اللہ کے دیدار کے وقت"
    },
    {
        "ID": 234,
        "Arabic": "حَسْبِىَ  اللّٰهُ  الَّذِىْ  لَآ  اِلٰهَ  اِلَّا  هُوَ  عَلَيْهِ  تَوَكَّلْتُ  وَ هُوَ  رَبُّ  الْعَرْشِ الْعَظِيْمِ",
        "Traslation": "مجھے اللہ کافی ہے جس کے بغیر کوئی اور معبود نہیں اسی پر میں بھروسہ کرتا ہوں اور اسی کی طرف میں لوٹوں گا"
    },
    {
        "ID": 235,
        "Arabic": "لآ  اِلٰهَ  اِلَّا  اللّٰهُ  سُبْحٰنَ  اللّٰهِ  مَآ  اَعْظَمَ  اللّٰهُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں۔ سبحان اللہ (کلمہ تعجب) خدا کس قدر بڑا ہے"
    },
    {
        "ID": 236,
        "Arabic": "لَآ  اِلٰهَ  الَّا  اللّٰهُ  سُبْحٰنَ  اللّٰهِ  مَآ  اَحْلَمَ  اللّٰهُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں ۔ سبحان اللہ ۔ اللہ کس قدر بردبار ہے"
    },
    {
        "ID": 237,
        "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  سُبْحٰنَ  اللّٰهِ  مَا  اَكْرَمَ  اللّٰهُ",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں۔ سبحان اللہ ۔ اللہ کس قدر بزرگ ہے"
    },
    {
        "ID": 238,
        "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  وَحْدَهٗ  لَا  شَرِيْكَ  لَهٗ  مُحَمَّدٌ  رَّسُوْلُ  اللّٰهِ  حَقًا",
        "Traslation": "اللہ کے بغیر کوئی اور معبود نہیں۔ وہ ایک ہے اس کا کوئی شریک نہیں۔ (حضرت) محمدؐ سچّے طور اللہ کے بیغمبر ہیں"
    },
    {
        "ID": 239,
        "Arabic": "اَللّٰهُمَّ  صَلِّ  عَلٰى سَيِّدِنَا  مُحَمَّدٍ وَ عَلٰى اٰلِ سَيِّدِنَا  مُحَمَّدٍ كُلَّمَا  ذَكَرَهُ  الذَّاكِرُوْنَ",
        "Traslation": "اے میرے اللہ درود بھیج (حضرت) محمدؐ پر اور (حضرت) محمدؐ کی آل پر جب جب کہ ذکر کرنے والے آپ کا ذکر کریں"
    },
    {
        "ID": 240,
        "Arabic": "وَ  صَلِّ  عَلٰى سَيِّدِنَا  مُحَمَّدٍ وَ عَلٰى اٰلِ سَيِّدِنَا  مُحَمَّدٍ  كُلَّمَا  غَفَلَ  عَنْ  ذِكْرِهِ  الغَافِلُوْنَ",
        "Traslation": "اور درود بھیج (حضرت) محمدؐ پر جب جب کہ غافل لوگ آپ کے ذکر سے غفلت کریں"
    },
    {
        "ID": 241,
        "Arabic": "رَضِيْنَا  بِاللّٰهِ  تَعَالٰى  رَبًّا  وَّ  بِالْاِسْلامِ  دِيْنًا  وَّ  سَيِّدِنَا  مُحَمَّدٍ  صَلَّى  اللُّٰهُ  عَلَيْهِ  وَسَلَّمَ  نَبِيًّا  وَّ  رَسُوْلًا",
        "Traslation": "۔ ہم اللہ تعالیٰ سے راضی ہیں کہ وہ ربّ ہے اور اسلام سے کہ وہ دین ہے اور (حضرت ) محمد صلی اللہ علیہ وسلم سے کہ وہ نبی اور رسول ہیں"
    },
    {
        "ID": 242,
        "Arabic": "وَ  بِا  لْقُرْاٰنِ  اِمَامًا  وَّ  بِالْكَعْبَةِ  قِبْلَةً  وَّ  بِالصَّلوٰةِ  فَرِيْضَةً",
        "Traslation": "او رقرآن سے کہ وہ راہنما ہے اور کعبہ سے کہ وہ ہمارا قبلہ ہے اور نماز سے کہ وہ ہم پر فرض ہے"
    },
    {
        "ID": 243,
        "Arabic": "وَّبِالْمُؤْمِنِيْنَ  اِخْوَانًا  وَ  بسَيِّدِنَا اِلصِّدِّيْقِ  وَ  سَيِّدِنَا الْفَارُوْقِ  وَ  سَيِّدِنَا ذِى النُّوْرَيْنِ  وَ  سَيِّدِنَا الْمُرْتَضٰى  اَئِمَّةً  الْهُدَاْ  رِضْوَانُ  اللّٰهِ  تَعَالٰى  عَلَيْهِمْ  اَجْمَعِيْنْ",
        "Traslation": "اور مومنوں سے کہ وہ (ہمارے ) بھائی ہیں اور حضرت ابوبکر صدیقؓ اور حضرت عمر فاروقؓ، حضرت عثمانؓ ذو النورین اور حضرت علی المرتضیٰؓ سے کہ وہ (ہمارے) پیشوا ہیں۔ ان سب پر اللہ تعالیٰ کی رضامندیاں ہوں"
    },
    {
        "ID": 244,
        "Arabic": "مَرْحَبًا  بِۢالصَّبَاحِ  الْجَدِيْدِ  وَ  بِالْيَوْمِ  السَّعِيْدِ  وَبِالْمَلَكَيْنِ  الْكَاتِبَيْنِ  الشَّاهِدَيْنِ  العَادِلَيْنِ",
        "Traslation": "مبارک ہو نئی صبح اور اچھا دن اور مبارک ہو ہمارے اعمال لکھنے والے دہ فرشتوں کو جو عدل و انصاف والے گواہ ہیں"
    },
    {
        "ID": 245,
        "Arabic": "حَيَّا كُمَا  اللّٰهُ  تَعَالٰى  فِى  غُرَّةِ  يَوْمِنَا  هٰذَا  اكْتُبَا  فِى  اوَّلِ  صَحِيْفَتِنَا",
        "Traslation": "اللہ تم دونوں کو اپنے سلام کے تحفے ہمارے اس دن کے آغاز میں عنایت کرے۔ ہمارے نامئہ اعمال کے پہلے صفحہ میں لکھئ"
    },
    {
        "ID": 246,
        "Arabic": "بِسْمِ  اللّٰهِ  الرَّحْمٰنِ  الرَّحِيْمِ",
        "Traslation": "اللہ کے نام سے جو نہایت مہربان اور رحم والا ہے"
    },
    {
        "ID": 247,
        "Arabic": "وَ اَشْهَدُ  اَنْ  لَّآ  اِلٰهَ  اِلَّا  اللّٰهُ  وَحْدَهٗ  لَا  شَرِيْكَ  لَهٗ  وَاَشْهَدُ  اَنَّ  مُحَمَّدًا  اعَبْدَهٗ  وَ  رَسُوْلُهٗ",
        "Traslation": "اور تم (دونوں) گواہ ہو کہ ہم گواہی دیتے ہیں کہ اللہ کے بغیر کوئی اور معبود نہیں، وہ ایک ہے۔ اس کوئی شریک نہیں اور ہم گواہی دیتے ہیں کہ (حضرت محمدؐ) اس (اللہ) کے بندے اور رسول ہیں"
    },
    {
        "ID": 248,
        "Arabic": "اَرْسَلَهٗ  بِالْهُدٰى  وَ  دِيْنِ  الْحَقِّ  لِيُظْهِرَهُ  عَلَى  الدِّيْنِ  كُلِّهِ  وَلَوْ  كَرِهَ  المُشْرِكُوْنَ",
        "Traslation": "جنھیں اللہ نے ہدایت (قرآن) اور سچّے دین (اسلام) کے ساتھ بحھیجا ہے تاکہ وہ اس (اسلام) کو باقی تمام دینوں پر غالب کر دے۔ اگر چہ مشرک لوگ اسے ناپسند ہی کریں"
    },
    {
        "ID": 249,
        "Arabic": "علٰى  هٰذِهِ  الشَّهَادةِ  نَحْيٰ  وَ  عَلَيْهَا  نَمُوْتُ  وَ  عَلَيْهَا  نُبْعَثُ",
        "Traslation": "اسی شہادت پر ہم زندہ ہیں اور اسی پر ہم مریں گے۔ اور اسی پر ہم قیامت کے دن اٹھائے جائیں گے"
    },
    {
        "ID": 250,
        "Arabic": "اِنْ  شَآءَ  اللّٰهُ  تَعَالٰى  اَعُوْذُ  بِكَلِمٰتِ  اللّٰهِ  التَّآمَّاتِ  كُلِّهَا  مِنْ  شَرِّ  مَا خَلَقَ",
        "Traslation": "انشاء اللہ تعالیٰ میں اللہ تعالیٰ کے ان پورے اور تمام کلمات کے ساتھ مخلوق کے شر سے پناہ مانگتا ہوں"
    },
    {
        "ID": 251,
        "Arabic": "بِسْمِ  اللّٰهِ  خَيْرِ  الْاَسْمَآءِ",
        "Traslation": "اللہ کے نام سے جو تمام ناموں سے بہتر ہے"
    },
    {
        "ID": 252,
        "Arabic": "بِسْمِ  اللّٰهِ  رَبِّ  الْاَرْضِ  وَ  رَبِّ  السَّمَآءِ",
        "Traslation": "اللہ کے نام سے جو زمین اور آسمان کا رب ہے"
    },
    {
        "ID": 253,
        "Arabic": "بِسْمِ  اللّٰهِ  الَّذِىْ  لَا  يَضُرُّ  مَعَ  اِسْمِهِ  شَىْءٌ  فِىْ  الْاَرْضِ  وَ لَا  فِى  السَّمَآءِ  وَ  هُوَ  السَّمِيْعُ  الْعَلِيْمُ",
        "Traslation": "اللہ کے نام سے جس کا نام لے کر کوئی چیز نقصان نہیں پہنچا سکتی نہ زمین میں اور نہ آسمان میں وہ بہت سننے اور جاننے والا ہے"
    },
    {
        "ID": 254,
        "Arabic": "اَلْحَمْدُ  لِلّٰهِ  الَّذِىْ  اَحْيَانَا  بَعْدَ  مَا  اَمَاتَنَا  وَ  اِلَيْهِ  الْبَعْثَ  وَ  النُّشُوْرُ  اَصْبَحْنَا",
        "Traslation": "تمام تعریفیں ہیں اس اللہ کے لئے جس نے ہمیں مارنے کے بعد زندہ کیا اور قیامت کے دن قبروں سے اٹھ کر اسی کی طرف لوٹنا ہے"
    },
    {
        "ID": 255,
        "Arabic": "وَ  اَصْبَحَ  الْمُلْكُ  لِلّٰهِ  الْعِزَّةُ  وَالْعَظْمَةُ  وَالْكِبْرِيَآءِ  والْجَبَرُوْتُ",
        "Traslation": "ہم نے اور تمام ملک نے اللہ کے فضل و کرم سے صبح کی اور قوّت، عظمت، بڑائی و بزرگی اور طاقت"
    },
    {
        "ID": 256,
        "Arabic": "وَالسَّلْطَانُ  والْبُرْهَانُ  لِلّٰهِ  والْاٰلٰآءُ  وَالنَّعْمَآءُ  لِلّٰهِ  وَالَّيْلُ  وَالنَّهَارُ  لِلّٰهِ",
        "Traslation": "اور بادشاہت اور روشن دلیلیں اللہ ہی کو شایان ہیں۔ تمام ظاہری اور باطنی نعمتیں اللہ ہی کی طرف سے ہیں۔ رات اور دن اللہ کی مخلوق ہیں اور جو چیزیں رات دن میں داخل ہیں"
    },
    {
        "ID": 257,
        "Arabic": "وَمَا  سَكَنَ  فِيْهِمَا  لِلّٰهِ  الْوَاحِدِ  الْقَهَّارِ",
        "Traslation": "وہ بھی خدائے واحد و قہار کی مخلوق ہیں"
    },
    {
        "ID": 258,
        "Arabic": "اَصْبَحْنَا  عَلٰى  فِطْرَةِ  الْاِسْلَامِ  وَكَلِمَةِ  الْاِخْلَاصِ  وَ  عَلٰى  دِيْنِ سَيِّدِنَاْ  وَنَبِيِّنَا  مُحَمَّدِ نِ الْمُصْطَفٰى  صَلَّى  اللّٰهُ  عَلَيْهِ  وَسَلَّمَ",
        "Traslation": "ہم نے دین فطرت اسلام پر صبح کی اور کلمہ توحید پر اور اپنے پیغمبر (حضرت ) محمدؐ کے دین پر"
    },
    {
        "ID": 259,
        "Arabic": "وَ  عَلٰى  مِلَّةِ  اَبِيْنَا  اِبْرَاهِيْمَ  عَلَيْهِمُ  السَّلَاٰمُ حَنِيْفًا  مُّسْلِمًا  وَ  مَا  كَانَ  مِنَ  الْمُشْرِكِيْنَ",
        "Traslation": "اور اپنے باپ حضرت ابراہیم علیہ السلام کی منّت حنیفہ پر۔ جو خالص موحد ومسلم تھے، مشرکوں میں سے نہیں تھ"
    },
    {
        "ID": 260,
        "Arabic": "صَلَوَاتُ  اللّٰهِ  وَ  مَلٰٓئِكَتِهٖ  وَ  اَنْۢبِيَآئِهٖ  وَ  رُسُلِهٖ  وَ  حَمَلَةِ  عَرْشِهٖ  وَ  جَمِيْعِ  خَلْقِهٖ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ  وَ اٰلِهٖ  وَ  اَصْحَابِهٖ  عَلَيْهِ  وَ  عَلَيْهِمُ  السَّلاٰمُ  وَ  رَحْمَةُ  اللّٰهِ  وَ  بَرَكٰاتُهُ",
        "Traslation": "درود رحمتیں ہوں اللہ تعالیٰ کی ، اس کے فرشتوں اور پیغمبروں کی اس کے رسولوں اور اس کا عرش اٹھانے والوں اور اس کی تمام مخلوق کی ہمارے سردار حضرت محمدؐ اور ان کی اولاد پر اور ان کے صحابہ کرامؓ پر، آپؐ پر اور آپؐ کے اصحاب پر سلام، اللہ کی رحمت اور اس کی برکتیں ہوں"
    },
    {
        "ID": 261,
        "Arabic": "اَلصَّلوٰةُ  وَالسَّلَامُ  عَلَيْكَ يَاسَيِّدِىْ يَا  رَسُوْلَ  اللّٰهِ",
        "Traslation": "درود سلام ہو آپ پر اے خدا کے رسول"
    },
    {
        "ID": 262,
        "Arabic": "الصَّلوٰةُ  وَالسَّلَامُ  عَلَيْكَ يَاسَيِّدِىْ يَا  حَبِيْبَ  اللّٰهِ",
        "Traslation": "درود اور سلام ہو آپ پر اے اللہ کے محبوب"
    },
    {
        "ID": 263,
        "Arabic": "اَلصَّلوٰةُ  والسَّلَامُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  خَلِيْلَ  اللّٰهِ",
        "Traslation": "درود اور سلام ہو آپ پر اے اللہ کے دوست"
    },
    {
        "ID": 264,
        "Arabic": "اَلصَّلوٰةُ  وَالسَّلَامُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  نَبِىَّ  اللّٰهِ",
        "Traslation": "درود اور سلام ہو آپ پر اے اللہ کے نبی"
    },
    {
        "ID": 265,
        "Arabic": "اَلصَّلوٰةُ  والسَّلَامُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  صَفِىَّ  اللّٰه",
        "Traslation": "درود اور سلام ہو آپ پر اے خدا کے برگزیدہ"
    },
    {
        "ID": 266,
        "Arabic": "اَلصَّلوٰةُ  والسَّلَامُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  خَيْرَ  خَلْقِ  اللّٰهِ",
        "Traslation": "درود اور سلام ہو آپ پر اے تمام خلقِ خدا سے بہتر"
    },
    {
        "ID": 267,
        "Arabic": "اَلصَّلوٰةُ  وَالسَّلٰامُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنِ  اخْتَارَهُ  اللّٰهِ",
        "Traslation": "درود اور سلام ہو آپ پر اےوہ ذات جسے خدا نے پسند کیا ہے"
    },
    {
        "ID": 268,
        "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنْ  اَرْسَلَهُ  اللّٰهِ",
        "Traslation": "درود اور سلام ہو آپ پر اے وہ ذات جسے اللہ نے رسول بنا کر بھیجا"
    },
    {
        "ID": 269,
        "Arabic": "اَلصَّلوٰةُ  وَالسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنْ  زَيَّنَهُ  اللّٰهُ",
        "Traslation": "درود اور سلام ہو آپ پر اے وہ ذات جسے خدا نے زینت دی ہے"
    },
    {
        "ID": 270,
        "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنْ  شَرَّفَهُ  اللّٰهُ",
        "Traslation": "درود اور سلام ہو آپ پر اے وہ ذات جسے خدا نے مشّرف بنایا ہے"
    },
    {
        "ID": 271,
        "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنْ  كَرَّمَهُ  اللّٰهُ",
        "Traslation": "درود اور سلام ہو آپ پر اے وہ ذات گرامی جسے خدا نے عزت بخشی ہے"
    },
    {
        "ID": 272,
        "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنْ  عَظَّمَهُ  اللّٰهُ",
        "Traslation": "درود اور سلام ہو آپ پر اے وہ ذات بابرکت جسے خدا نے عظیم بنایا ہے"
    },
    {
        "ID": 273,
        "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  سَيِّدَ  الْمُرْسَلِيْنَ",
        "Traslation": "درود اور سلام ہو آپ پر اے پیغمبروں کے سردار"
    },
    {
        "ID": 274,
        "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  اِمَامَ  الْمُتَّقِيْنَ",
        "Traslation": "درود اور سلام ہو آپ پر اے تمام پرہیزگاروں کے پیشوا"
    },
    {
        "ID": 275,
        "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  خَاتِمَ  النَّبِيِّيْنَ",
        "Traslation": "درود اور سلام ہو آپ پر اے تمام نبیوں کے بعد آنے والے"
    },
    {
        "ID": 276,
        "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  شَفِيْعَ  الْمَذْنِبِيْنَ  (3)",
        "Traslation": "درود اور سلام ہو آپ پر اے گناہ گاروں کی سفارش کرنے والے -۳ بار-"
    },
    {
        "ID": 277,
        "Arabic": "اَلصَّلوٰةُ  وَ  السَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  رَحْمَةً  الِّلْعٰلَمِيْنَ  اَلصَّلوٰةُ  وَ  السَّلاٰمُ  عَلَيْكَ يَاسَيِّدِىْ  يَا  رَسُوْلَ  رَبِّ  الْعٰلَمِيْنَ",
        "Traslation": "درود اور سلام ہو آپ پر اے تمام جہانوں کے پروردگار کے پیغمبر"
    },
    {
        "ID": 278,
        "Arabic": "صَلَوَاتُ  اللّٰهِ  تَعَالٰى  وَ  مَلٰئِكَتِهٖ  وَ  اَنْۢبِيَآئِهٖ  وَ  رُسُلِهٖ  وَ  حَمَلَةَ  عَرْشِهٖ  وَ  جَمِيْعَ  خَلْقِهٖ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ",
        "Traslation": "درود ہوں اللہ تعالیٰ کے اس کے فرشتوں کے اور اسے نبیوں اور رسولوں کے اس کا عرش اٹھانے والوں کے اور اس کی ساری مخلوقات کے، ہمارے سردار (حضرت) محمدؐ پر"
    },
    {
        "ID": 279,
        "Arabic": "وَ عَلٰى اٰلِهٖ  وَ  اَصْحَابِهٖ  اَجْمَعِيْنَ  عَلَيْهِ  وَ  عَلَيْهِمُ  السَّلاٰمُ  وَ  رَحْمَةُ  اللّٰهِ  وَ  بَرَكَاتُهُ",
        "Traslation": "آپؐ کی اولاد اور آپؐ کے اصحاب پر۔ آپؐ پر اور ان سب اصحاب پر سلا م اور اس کی رحمت اور اس کی برکتیں ہوں"
    },
    {
        "ID": 280,
        "Arabic": "اللّٰهُمَّ  صَلِّ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ  فِىْ  الْاَوَّلِيْنَ",
        "Traslation": "۔ اے میرے اللہ ہمارے سردار (حضرت) محمدؐ پر درود بھیج ہم سے پہلے لوگوں میں"
    },
    {
        "ID": 281,
        "Arabic": "وَ  صَلِّ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ  فِى  الْاٰخِرِيْنَ",
        "Traslation": "اور درود بھیج ہمارے سردار (حضرت) محمدؐ پر ہمارے بعد آنے والے لوگوں میں"
    },
    {
        "ID": 282,
        "Arabic": "و  صَلِّ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ  فِى  الْمَلَآءِ  الْاَعْلٰى  اِلٰى  يَوُمِ  الدِّيْنِ",
        "Traslation": "اور درود بھیج ہمارے سردار (حضرت) محمدؐ پر ملائکہ مقربین میں قیامت کے دن تک"
    },
    {
        "ID": 283,
        "Arabic": "وَ  صَلِّ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ  فِى  كُلِّ  وَقْتٍ  وَّحِيْنٍ",
        "Traslation": "اور درود بھیج ہمارے سردار (حضرت ) محمدؐ پر ہر وقت اور ہر گھڑی میں"
    },
    {
        "ID": 284,
        "Arabic": "وَّ  صَلِّ  عَلٰى  جَمِيْعِ  الْاَنْۢبِيَآءِ  وَالْمُرْسَلِيْنَ  وَ  عَلٰى  مَلٰئِكَتِكَ  المُقَرَّبِيْنَ",
        "Traslation": "اور درود بھیج تمام نبیوں پر اور رسولوں پر اور اپنے تمام مقرّب فرشتوں پر"
    },
    {
        "ID": 285,
        "Arabic": "وَ  عَلٰى  عِبَادِكَ  الصّٰلِحِيْنَ  وَ  عَلٰى  اَهْلِ  طَاعَتِكَ  اَجْمَعِيْنَ  والرّْحَمْنَا  مَعَهُمْ  بِرَحْمَتِكَ  يَااَرْحَمَ  الرَّاحِمِيْنَ",
        "Traslation": "اور اپنے تمام نیک بندوں پر اور اپنے سب اطاعت گزار بندوں پر اور ہم پر رحم کر ان کے ساتھ اپنی مہربانی سے اے تمام رحم کرنیوالوں میں سب سے زیادہ رحم کرنیوالے"
    },
    {
        "ID": 286,
        "Arabic": "دُعاءِ  رِقَابْ",
        "Traslation": "دعاءِ رقاب"
    },
    {
        "ID": 287,
        "Arabic": "بِسْمِ  اللّٰهِ  الرَّحْمٰنِ  الرَّحِيْمٌ",
        "Traslation": "میں اللہ کے نام سے شروع کرتا ہوں جو بہت مہربان اور رحم والا ہے"
    },
    {
        "ID": 288,
        "Arabic": "اَللّٰهُمَّ  يا  مَالِكَ  الرِّقَابِ  وَ  يَا  مُفَتِّحَ  الْاَبْواْبِ  وَ  يَا  مُسَبِّبَ  الْاَسْبَابِ  هَيِّئْ  لَنَا  سَبَبًا  لَّا  نَسْتَطِيْعُ  لَهٗ  طَلَبًا",
        "Traslation": "اے اللہ ۔ اے گردنوں کے مالک اے رحمت کے دروازے کھولنے والے اور اے سبب ساز ہمارے لئے (رزق کا) ایسا سبب مہیّا کر جس کی تلاش کی ہمیں طاقت نہیں"
    },
    {
        "ID": 289,
        "Arabic": "اَللّٰهُمَّ  اجْعَلْنَا  مَشْغُوْلِيْنَ  بِاَمْرِكَ",
        "Traslation": "خدایا ہمیں اپنے حکم کی تعمیل میں مشغول رکھ"
    },
    {
        "ID": 290,
        "Arabic": "اٰمِنِيْنَ  بِعَدْلِكَ  اٰئِسِيْنَ  مِنْ  خَلْقِكَ",
        "Traslation": "۔ اپنے انصاف سے امن میں رکھ اپنی مخلوق سے بے نیاز بنا"
    },
    {
        "ID": 291,
        "Arabic": "اٰنِسِيْنَ  بِكَ  مُستَوْحِشِيْنَ  عَنْ  غَيْرِكَ  رَاضِيْنَ  بِقَضَآئِكَ  صَابِرِيْنَ  علٰى  بَلَآئِكَ",
        "Traslation": "اپنی ذات سے مانوس رکھ اپنے غیر سے ہراسان رکھ اپنے فیصلہ سے راضی رہنے والے بنا تیری آزمایش پر صبر گزار"
    },
    {
        "ID": 292,
        "Arabic": "قَانِعِيْنَ  لِعَطَائِكَ  شَاكِرِيْنَ  لِنِعْمَآئِكَ",
        "Traslation": "تیری بخشش پر قناعت کرنے والے، تیری نعمتوں کے شکر گزار بنا دے"
    },
    {
        "ID": 293,
        "Arabic": "مُتَلَذِّذِيْنَ  بِذِكْرِكَ  فَرِحِيْنَ  بِكِتَابِكَ  مُنَاجِيْنَ  بِكَ  فِىْ  اٰنَآءِ  اللَّيْلِ  وَ  اَطْرَافِ  النَّهَارِ",
        "Traslation": "تیری یاد سے لذّت اٹھانے والے تیری کتاب (قرآن) پر خوش ہونیوالے تیرے ساتھ راتوں کے وقت اور دن کے حصّوں میں سرگوشی کرنے والے بنا دے"
    },
    {
        "ID": 294,
        "Arabic": "مُبْغِضِيْنَ  لِلدُّنْيَا  وَ  مُحِبِّيْنَ  لِلْآخِرَةِ  مُشْتَاقِيْنَ  اِلٰى  لِقَآئِكَ",
        "Traslation": "دنیا سے نفرت کرنے والے اور آخرت کی محبت رکھنے والے، تیرے دیدار کے شوقین"
    },
    {
        "ID": 295,
        "Arabic": "مُتَوَجِّهِيْنَ  اِلٰى  جَنَابِكَ  مُسْتَعِدِّيْنَ  لِلمَوْتِ",
        "Traslation": "تیرے دربار کی طرف متوجہ ہونے والے، موت کے لئے ہر وقت تیار رہنے والے بناؤ"
    },
    {
        "ID": 296,
        "Arabic": "رَبَّنَا  وَ  اٰتِنَا  مَا  وَعَدْتَّنَا  عَلٰى  رُسُلِكَ  وَ  لَا  تُخْزِنَا  يَوْمَ  الْقِيٰمَةِ  اِنَّكَ  لَا  تُخْلِفُ  الْميْعَادَ",
        "Traslation": "اے ہمارے پروردگار ہمیں وہ چیز دے جس کا تونے ہمیں وعدہ دیا ہے اپنے رسولوں کی زبانی اور ہمیں قیامت کے دن رسوا نہ کر ۔بے شک تو وعدہ کو پورا کرنے والا ہے"
    },
    {
        "ID": 297,
        "Arabic": "اَللّٰهُمَّ  اجْعَلِ  التَّوْفِيْقَ  رَفِيْقَنَا  وَالصِّرَاطَ  الْمُسْتَقِيْمَ  طَرِيْقَنَا",
        "Traslation": "اے اللہ توفیق کو ہمارا ساتھی بنا اور سیدھے راستے کو ہمارا راستہ بنا"
    },
    {
        "ID": 298,
        "Arabic": "اَللّٰهُمَّ  اَوْصِلْنَا  اِلٰى  مَقَاصِدِنَا  وَتُبْ  عَلَيْنَا  اِنَّكَ  اَنْتَ  التَّوَّابُ  الرَّحِيْمُ",
        "Traslation": "یا اللہ ۔ ہمیں اپنے مقصد تک پہنچا اور ہمیں توبہ کی توفیق بخش۔ بے شک تو اپنے بندوں کو توبہ کی توفیق بخشنے والا مہربان ہے"
    },
    {
        "ID": 299,
        "Arabic": "اَللّٰهُمَّ  بِكَ  اَصْبَحْنَا  وَبِكَ  اَمْسَيْنَا  وَبِكَ  نَحْيٰ  وَبِكَ  نَمُوْتَ  وَ  اِلَيْكَ  المَصِيْرُ",
        "Traslation": "اے اللہ ہم نے تیری ہی مہربانی سے صبح اور شام کی اور تیری ہی مہربانی سے زندہ ہیں اور تیرے ہی نام پر مر جائیں گے اور تیری ہی طرف لوٹ آئیں گے"
    },
    {
        "ID": 300,
        "Arabic": "اَللّٰهُمَّ  رْزُقْنَا  لَذَّةَ  النَّظَرَ  اِلٰى  وَجْهِكَ  وَالشَّوْقَ  اِلٰى  لِقَآئِكَ",
        "Traslation": "اے خدا ہمیں اپنی ذات کی طرف دیکھنے کی لذّت اور اپنے دیدار کا اشتیاق عطا فرما"
    },
    {
        "ID": 301,
        "Arabic": "اَللّٰهُمَّ  اَرِنَا  الْحَقَّ  حَقًّا  وَّارْزُقْنَا  اِتِّبَاعَهُ  وَاَرِنَا  الْبَاطِلَ  بَاطِلًا  وَّارْزُقْنَا  اجْتِنَابَهُ",
        "Traslation": "اے اللہ۔ ہمیں سچ کو سچ ہی دکھا اور اس کی پیروی کی توفیق دے اور ہمیں جھوٹ کو جھوٹ ہی دکھا اور ہمیں اس سے بچنے کی توفیق بخش"
    },
    {
        "ID": 302,
        "Arabic": "اَللّٰهُمَّ  اَرِنَا  حَقَآئِقَ  الْاَشْيآءِ  كَمَا  هِيَ  تَوَفَّنَا  مُسْلِمِيْنَ  وَاَلحِقْنَا  بِا  الصّٰلِحِيْنَ",
        "Traslation": "اے خدا ہمیں تمام چیزوں کی حقیقتیں ایسی ہی دکھا جیسی کہ وہ ہیں۔ ہمیں مسلمان ہونے کی حالت میں مار اور نیک لوگوں کے ساتھ مل"
    },
    {
        "ID": 303,
        "Arabic": "وَادْفَعْ  عَنَّاشَرَّ  الظّٰلِمِيْنَ  وَ  شَارِكْنَا  فِىْ  دَعَآءِ  الْمُؤْمِنِيْنَ",
        "Traslation": "اور ہم سے ظالموں کا شر دور کر اور ہمیں شریک ٹھہرا مومنوں کی دعائوں میں"
    },
    {
        "ID": 304,
        "Arabic": "وَ نَبِّهْنَا  عَنْ  نَوْمَةِ  الْغَافِلِيْنَ  وَارْزُقْنَا  شَفَاعَةَ  سَيِّدِ  الْمُرْسَلِيْنَ",
        "Traslation": "اور ہمیں غافلانہ نیند سے بیدار کر اور ہمیں تمام رسولوں کے سردار (حضرت محمدؐ) کی شفاعت نصیب کر"
    },
    {
        "ID": 305,
        "Arabic": "وَاَدْخِلْنَا  الْجَنَّةَ  بِسَلَامٍ  اٰمِنِيْنَ  وَ  احْشُرْنَا  مَعَ  الْمُتَّقِيْنَ  وَخَلِّصْنَا  مِنَ  النَّارِ  يَا  مُجِيْرُ",
        "Traslation": "اور ہمیں سلامتی اور امن کے ساتھ جنّت میں لے جا اور ہمیں قیامت کے روز پرہیزگاروں کے ساتھ اُٹھاؤ اور ہمیں آگ سے آزاد کر دے ، اے پناہ دینے والے خدا"
    },
    {
        "ID": 306,
        "Arabic": "اَللّٰهُمَّ  اغْفِرْ  لِاُمَّةِ  سَىِّدِنَا  مُحَمَّدٍ ﷺ",
        "Traslation": "اے اللہ۔ حضرت محمدؐ کی اُمت کے گناہ بخش دے"
    },
    {
        "ID": 307,
        "Arabic": "اَللّٰهُمَّ  ارْحَمْ  اُمَّةَ  سَىِّدِنَا  مُحَمَّدٍ ﷺ",
        "Traslation": "اے اللہ ۔ حضرت محمدؐ کی امّت پر رحم کر"
    },
    {
        "ID": 308,
        "Arabic": "اَللّٰهُمَّ  انْصُرْ  اُمَّةَ  سَىِّدِنَا  مُحَمَّدٍ ﷺ",
        "Traslation": "اے اللہ ۔ حضرت محمدؐ کی امّت کی مدد کر"
    },
    {
        "ID": 309,
        "Arabic": "اَللّٰهُمَّ  افْتَحْ  لِاُمَّةِ  سَىِّدِنَا  مُحَمَّدٍ  ﷺ",
        "Traslation": "اے اللہ۔ حضرت محمدؐ کی امّت کو (دشمنوں پر) فتح دے"
    },
    {
        "ID": 310,
        "Arabic": "اَللّٰهُمَّ  اَصْلِحْ  اُمَّةَ  سَىِّدِنَا  مُحَمَّدٍ  ﷺ  اَللّٰهُمَّ  فَرِّجْ  عَنْ  اُمَّةِ  سَىِّدِنَا مُحَمَّدٍ  ﷺ",
        "Traslation": "اے اللہ ۔ حضرت محمدؐ کی امّت کی اصلاح فرما۔ اے اللہ ۔ حضرت محمدؐ کی امّت کی پریشانی دور کر"
    },
    {
        "ID": 311,
        "Arabic": "اَللّٰهُمَّ  كَرِّمْ  اُمَّةَ  سَىِّدِنَا  مُحَمَّدٍ  ﷺ",
        "Traslation": "اے اللہ ۔ حضرت محمدؐ کی امّت کو عزّت مند بنا"
    },
    {
        "ID": 312,
        "Arabic": "اَللّٰهُمَّ  عَظِّمْ  اُمَّةَ  سَىِّدِنَا  مُحَمَّدٍ ﷺ",
        "Traslation": "اے اللہ ۔ حضرت محمدؐ کی امّت کو عظمت عطا کر"
    },
    {
        "ID": 313,
        "Arabic": "اَللّٰهُمَّ  تَجَاوَزْ  عَنْ اُمَّةِ  سَىِّدِنَا  مُحَمَّدٍ ﷺ",
        "Traslation": "اے اللہ ۔ حضرت محمدؐ کی امّت کی درگزر کر"
    },
    {
        "ID": 314,
        "Arabic": "اَللّٰهُمَّ  يَا  حَبِيْبَ  التَّوَّابِيْنَ  تُبْ  عَلَيْنَا  وَ  يَآ  اَمَانَ  الْخَآئِفِيْنَ  اٰمِنَّا",
        "Traslation": "اے اللہ اے توبہ کرنیوالوں کو دوست رکھنے والے ہمیں توبہ کی توفیق دے۔ تو امان ہے خوف کے ماروں کا ہمیں امان دے"
    },
    {
        "ID": 315,
        "Arabic": "وَ  يَا  دَلِيْلَ  الْمُتَحَيِّرِيْنَ  دُلَّنَا  وَ  يَا  هَادِيَ  الْمُضَلِّيْنَ  اهْدِنَا",
        "Traslation": "اور اے راستہ بھولے ہوئے لوگوں کو راستہ دکھانے والے ہمیں راستہ دکھا اور اے گمراہوں کو ہدایت کرنے والے ہمیں ہدایت دے"
    },
    {
        "ID": 316,
        "Arabic": "وَ  يَا  غِيَاثَ  الْمُسْتَغِيْثِيْنَ  اَغِثْنَا",
        "Traslation": "اور اے فریادیوں کی فریاد کو پہنچنے والے ہماری فریاد رسی کر"
    },
    {
        "ID": 317,
        "Arabic": "وَ  يَا  رَجَآءَ  الْمُنْقَطِعِيْنَ  لَا  تَقْطَعْ  رَجَآءَنَا",
        "Traslation": "اے نا امیدوں کی امید ہماری امید مت توڑ"
    },
    {
        "ID": 318,
        "Arabic": "وَ  يَا  رَاحِمَ  الْعَاصِيْنَ  اِرْحَمْنَا",
        "Traslation": "اے نافرمانوں پر رحم کرنے والے ہم پر رحم کر"
    },
    {
        "ID": 319,
        "Arabic": "وَ  يَا  غَافِرَ  الْمُذْنِبِيْنَ  اغْفِرْ  لَنَا  ذُنُوْبَنَا  وَ  كَفِّرْ  عَنَّا  سَيِّئٰاتِنَا  وَ  تَوَفَّنَا  مَعَ  الْاَبْرَارِ",
        "Traslation": "اے گناہگاروں کی مغفرت کرنے والے ہمارے گناہوں کی مغفرت کر اور ہمارے برائیاں ہم سے دور کر اور ہمیں نیک لوگوں کے ساتھ وفات دے"
    },
    {
        "ID": 320,
        "Arabic": "اَللّٰهُمَّ  اسْتُرْ  عُيُوْبَنَا",
        "Traslation": "اے اللہ۔ ہمارے گناہ بخش دے"
    },
    {
        "ID": 321,
        "Arabic": "اَللّٰهُمَّ  اغْفِرْ  ذُنُوْبَنَا",
        "Traslation": "اے اللہ۔ ہمارے عیبوں پر پردہ ڈال"
    },
    {
        "ID": 322,
        "Arabic": "اَللّٰهُمَّ  احْفَظْ  قُلُوْبَنَا",
        "Traslation": "اے اللہ۔ ہمارے سینوں کو کھول دے"
    },
    {
        "ID": 323,
        "Arabic": "اَللّٰهُمَّ  شْرَحْ  صُدُوْرَنَا",
        "Traslation": "اے اللہ ۔ ہمارے دلوں کو محفوظ رکھ"
    },
    {
        "ID": 325,
        "Arabic": "اَللّٰهُمَّ  نَوِّرْ  قُبُوْرَنَا",
        "Traslation": "اے اللہ۔ ہماری قبروں کو روشن کر"
    },
    {
        "ID": 326,
        "Arabic": "اَللّٰهُمَّ  يَسِّرْ  اُمُوْرَنَا",
        "Traslation": "اے اللہ۔ ہمارے کاموں کو آسان بنا دے"
    },
    {
        "ID": 327,
        "Arabic": "اَللّٰهُمَّ  حَصِّلْ  مُرَادَنَا",
        "Traslation": "اے اللہ۔ ہماری مراد پوری کر"
    },
    {
        "ID": 328,
        "Arabic": "اَللّٰهُمَّ  تَمِّمْ  تَقَاصِيْرَنَا",
        "Traslation": "اے اللہ۔ ہمارے تمام کوتاہیوں کو پورا کر دے"
    },
    {
        "ID": 329,
        "Arabic": "اَللّٰهُمَّ  نَجِّنَا  مِمَّا  نَخَافُ  يَا  خَفِيَّ  الْاَلْطَافِ",
        "Traslation": "اے اللہ۔ ہمیں اس چیز سے نجات دے جس سے ہم ڈرتے ہیں اے پوشیدہ مہربانیوں والے"
    },
    {
        "ID": 330,
        "Arabic": "اَللّٰهُمَّ  اغْفِرْلَنَا  وَلِوَالِدَيْنَا  وَلِمَشَآئِخِنَا  وَلِاُسْتَاذِنَا  وَلِاَصْحَابِنَا  وَلِاَحْبَابِنَا  وَ  لِعَشَآئِرِنَا  وَلِقَبَآئِلِنَا",
        "Traslation": "اے اللہ۔ مغفرت کر ہماری ، ہمارے ماں باپ کی، ہمارے بزرگوں کی، ہمارے استاد کی، ہمارے دوستوں کی، ہمارے رشتہ داروں کی، ہمارے قبیلہ والوں کی"
    },
    {
        "ID": 331,
        "Arabic": "وَلِمَنْ  لَّهٗ  حَقَّ  عَلَيْنَا  وَ  لِجَمِيْعِ  اُمَّةِ سَىِّدِنَا مُحَمَّدٍ  عَلَيْهِ  الصَّلوٰةُ  وَالسَّلَامُ",
        "Traslation": "اور اس کی بھی جس کا ہم پر کوئی حق ہے اور تمام امّت محمدؐ کی۔ آپؐ پر درود اور سلام ہو"
    },
    {
        "ID": 332,
        "Arabic": "وَقِنَا  رَبَّنَا  شَرَّ  مَا  قَضَيْتَ لَنَا  وَقِنَا  عَذَابَ  النَّارْ",
        "Traslation": "اے ہمارے پروردگار ہمیں اس شر سے بچا جو تونے مقدر کیا ہو"
    },
    {
        "ID": 333,
        "Arabic": "وَقِنَا عَذَابَ  الْقَبْرِ  وَ قِنَا  عَذَابَ  يَوْمِ  الْقِيٰمَةِ",
        "Traslation": "اور بچاؤ ہمیں اے ہمارے رب قبر اور جہنم کی آگ اور قیامت کے دن کے عذاب سے"
    },
    {
        "ID": 334,
        "Arabic": "وَاحْشُرْنَا  مَعَ  الْمُتَّقِيْنَ  وَلْاَبْرَارِ",
        "Traslation": "اور قیامت کے دن ہمیں پرہیزگاروں اور نیکوکاروں کے ساتھ اٹھا"
    },
    {
        "ID": 335,
        "Arabic": "اَللّٰهُمَّ بِحُرْمَةِ  هٰذِهِ  الْاَوْرَادِ  الْفَتْحِيَّةِ  اِفْتَحْ  لَنَا  اَبْوَابَ  الْعِنَايَاتِ  وَالْكَرَامَاتِ",
        "Traslation": "اے اللہ۔ اس اوراد فتحیہ کی برکت سے کھول دے ہمارے لئے اپنی مہربانیوں اور بخششوں کے دروازے"
    },
    {
        "ID": 336,
        "Arabic": "وَ  وَفِّقْنَا  لِلطَّاعَاتِ  وَالْعِبَادَاتِ  وَاحْفَظْنَا  مِنَ  الْاٰفَاتِ  وَالْبَلِيَّاتِ  وَبَارِكْ  لَنَا  فِى  الرِّزْقِ  وَالْحَسَنٰتِ",
        "Traslation": "اور ہمیں توفیق دے اپنی فرمانبرداریوں اور عبادتوں کی اور ہمیں محفوظ رکھ آفتوں اور آزمایشوں سے اور برکت دے ہمیں رزق، عمر اور نیکیوں میں"
    },
    {
        "ID": 337,
        "Arabic": "اَللّٰهُمَّ  احْفَظْنَا  يَا  فَيَّاضُ  مِنْ  جَمِيْعِ  الْبَلَاْ  يَا  وَالْاَمْرَاضِ",
        "Traslation": "یا اللہ۔ اے فیض و برکت والے خدا۔ ہمیں محفوظ رکھ تمام آزمائشوں اور بیماریوں سے"
    },
    {
        "ID": 338,
        "Arabic": "وَ  صَلَّى  اللّٰهُ  تَعٰلٰى  عَلٰى  خَيْرِ  خَلْقِهٖ  سَىِّدِنَاْ  مُحَمَّدٍ  وَّ  اٰلِهٖ  وَاَصْحَابِهٖ  اَجْمَعِيْنَ  بِرَحْمَتِكَ  يَا  اَرْحَمَ  الْرّٰحِمِيْنَ",
        "Traslation": "اللہ تعالیٰ درود و رحمت بھیجے اپنی مخلوقات میں سے سب سے بہترین (حضرت) محمدؐ پر، آپؐ کی اولاد اور آپؐ کے تمام صحابہ کرامؓ پر"
    }
]