[
    {
     "ID": 1,
     "Arabic": "بِسْمِ  اللّٰهِ   الرَّحْمٰنِ  الرَّحِيْمٌ",
     "Translation Urdu": "شروع کرتا ہوں اللہ کے نام سے جو بہت مہربان اور رحم والا ہے",
     "Translation English": "In the name of Allah, the Most Gracious, the Most Merciful"
    },
    {
     "ID": 2,
     "Arabic": "اَسْتَغْفِرُ اللّٰهَ  الْعَظِيْمِ",
     "Translation Urdu": "میں خدائے بزرگ سے مغفرت مانگتا ہوں",
     "Translation English": "I seek forgiveness from Allah, the Mighty."
    },
    {
     "ID": 3,
     "Arabic": "اَسْتَغْفِرُ اللّٰهَ  الْعَظِيْمِ",
     "Translation Urdu": "میں خدائے بزرگ سے مغفرت مانگتا ہوں",
     "Translation English": "I seek forgiveness from Allah, the Mighty."
    },
    {
     "ID": 4,
     "Arabic": "اَسْتَغْفِرُ اللّٰهَ  الْعَظِيْمِ",
     "Translation Urdu": "میں خدائے بزرگ سے مغفرت مانگتا ہوں",
     "Translation English": "I seek forgiveness from Allah, the Mighty."
    },
    {
     "ID": 5,
     "Arabic": "اَلَّذِىْ  لَآ  اِلٰهَ  اِلَّا  هُوَ  الْحَيُّ  الْقَيُّوْمُ  وَ  اَتُوْبُ  اِلَيْهِ  وَاَسْأَلُهُ  التَّوْبَةَ",
     "Translation Urdu": "جس کے بغیر کوئی معبود نہیں وہ ہمیشہ زندہ اور تمام کائنات کو سنبھالے ہوئے ہے۔ میں اُسی کی طرف لوٹتا ہوں اور اُسی سے توبہ کی قبولیت چاہتا ہوں",
     "Translation English": "The One who, there is no deity except Him, the Ever-Living, the Sustainer of existence, and I turn to Him in repentance, and I ask Him for repentance."
    },
    {
     "ID": 6,
     "Arabic": "اَللّٰهُمَّ  اَنْتَ  السَّلَامُ  وَمِنْكَ  السَّلَامُ  وَاِلَيْكَ  يَرْجِعُ  السَّلَامُ  حَيِّنَا  رَبَّنَا  بِاالسَّلَامِ  وَاَدْخِلْنَا  دَارَ  السَّلَامِ  تَبَارَكْتَ  رَبَّنَا  وَتَعَالَيْتَ  يَا ذَالْجَلٰالِ  وَلْاِكْرَامِ",
     "Translation Urdu": "اے اللہ تو سلامتی ہے اور تجھ سے ہی سلامتی ہے اور تیری ہی طرف سلامتی لوٹتی ہے۔ زندہ رکھ ہمیں اے پروردگار سلامتی سے اور داخل کر ہمیں سلامتی کے گھر(جنّت) میں۔ تو برکت والا ہے اے ہمارے رب اور تو بہت بلند ہے اے عزّت اور بزرگی والے الٰہی",
     "Translation English": "O Allah, You are the Source of Peace, and from You comes peace. To You, peace returns. Our Lord, bring us into the abode of peace. Blessed are You, our Lord, and Exalted in Majesty and Honor."
    },
    {
     "ID": 7,
     "Arabic": "اَللّٰهُمَّ  لَكَ  الْحَمْدُ  حَمْدًا  يُّوَافِىْ  نِعَمَكَ  وَيُكَافِىْ  مَذِيْدَ  كَرَمِكَ  اَحْمَدُكَ  بِجَمِيْعِ  مَحَامِدِكَ  مَا  عَلِمْتُ  مِنْهَا  وَمَالَمْ  اَعْلَمْ",
     "Translation Urdu": "تیرے لیے ایسی تعریف ہے جو تیری تمام نعمتوں کو پورا کردے اور تیری مزید بخشش کی برابری کرے۔ میں تیری تعریف کرتا ہوں اور تیری ان تمام خوبیوں کی جنھیں میں جانتا ہوں اور جنھیں میں نہیں جانتا ہوں",
     "Translation English": "O Allah, to You is all praise, a praise that encompasses Your blessings and complements Your grace. I acknowledge and praise You for all that I know and for what I do not know."
    },
    {
     "ID": 8,
     "Arabic": "وَ  عَلٰى  جَمِيْعِ  نِعَمِكَ  مَا  عَلِمْتُ  مِنْهَا  وَ  مَا  لَمْ  اَعْلَمْ  وَ  عَلٰى  كُلِّ  حَالٍ",
     "Translation Urdu": "اور تیری ان تمام نعمتوں کا شکر گزار ہوں جنھیں میں جانتا ہوں اور جنھیں میں نہیں جانتا ہوں اور ہر حال پر (شکر گزار ہوں )",
     "Translation English": "And for all Your blessings, whether I am aware of them or not, and in every circumstance."
    },
    {
     "ID": 9,
     "Arabic": "اَعُوْذُ  بِاللّٰهِ  مِنَ  الشَّيْطٰنِ  الرَّجِيْمِ",
     "Translation Urdu": "میں پناہ مانگتا ہوں اللہ سے شیطان مردود (کی شر) سے",
     "Translation English": "I seek refuge in Allah from the accursed devil."
    },
    {
     "ID": 10,
     "Arabic": "اللَّهُ  لَا  اِلٰهَ  اِلَّا  هُوَ  الْحَيُّ  الْقَيُّومُ  لَا  تَاْخُذُهٗ  سِنَةٌ  وَلَا  نَوْمٌ  لَهٗ  مَا  فِي  السَّمٰوَاتِ  وَمَا  فِي  الْاَرْضِ  مَنْ  ذَالَّذِي  يَشْفَعُ  عِنْدَهٗ  اِلَّا  بِاِذْنِهٖ  يَعْلَمُ  مَا بَيْنَ  اَيْدِيهِمْ  وَمَا  خَلْفَهُمْ  وَلَا  يُحِيْطُوْنَ  بِشَىْءٍ  مِّۢنْ  عِلْمِهٖ  اِلَّا  بِمَا  شَآءَ  وَسِعَ  كُرْسِيُّهُ  السَّمٰوَاتِ  وَالْاَرْضَ  وَلَا  يَئُودُهٗ  حِفْظُهُمَا  وَهُوَ  الْعَلِىُّ  الْعَظِيمُ",
     "Translation Urdu": "اللہ ہے اس کے سوا کوئی معبود نہیں ، وہ ہمیشہ زندہ اور تمام کائنات کو سنبھالے ہوئے ہے۔ نہ اُسے اونگھ پکڑتی ہے اور نہ نیند۔ اسی کی ہیں وہ ساری چیزیں جو آسمانوں اور زمینوں میں ہیں۔ کون ہے وہ جو اس کے پاس اس کی اجازت کے بغیر (کسی کی) سفارش کرے۔ وہ ان کے سامنے کی اور پیچھے کی سب چیزیں جانتا ہے۔ لوگ خدا کی معلومات سے صرف اسی قدر جانتے ہیں جتنا خدا چاہتا ہے۔ اس کی حکومت تمام آسمانوں اور زمینوں پر چھائی ہوئی ہے۔ اور اُس (خدا)کو ان کی حفاظت تھکاتی نہیں ہے اور وہ تو بہت بلند اور بزرگ ہے",
     "Translation English": "Allah! There is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great."
    },
    {
     "ID": 11,
     "Arabic": "سُبْحَانَ  اللّٰهِ  (33)",
     "Translation Urdu": "اللہ منزّہ اور پاک ہے - ۳۳ بار-",
     "Translation English": "Glory be to Allah (33)."
    },
    {
     "ID": 12,
     "Arabic": "اَلْحَمْدُ  لِلّٰهِ  (33)",
     "Translation Urdu": "تمام تعریفیں اللہ ہی کے لیے ہیں - ۳۳ بار-",
     "Translation English": "Praise be to Allah (33)."
    },
    {
     "ID": 13,
     "Arabic": "اَللّٰهُ  اَكْبَرُ  (34)",
     "Translation Urdu": "اللہ سب سے بڑا ہے - ۳۴ بار -",
     "Translation English": "Allah is the Greatest (34)."
    },
    {
     "ID": 14,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  وَحْدَهٗ  لَا  شَرِيْكَ  لَهٗ  لَهُ  الْمُلْكُ  وَلَهُ  الْحَمْدُ  وَ  هُوَ  عَلٰى  كُلِّ  شَىْءٍ  قَدِيْرٌ  - (10)",
     "Translation Urdu": "اللہ کے بغیر کوئی معبود برحق نہیں ، وہ اکیلا ہے اس کا کوئی شریک نہیں۔ اسی کی پادشاہی ہے اور اسی کے لیے تمام تعریفیں ہیں اور وہی ہر چیز پر قدرت رکھنے والا ہے - ۱۰ بار -",
     "Translation English": "There is no deity except Allah, alone, without any partner. To Him belongs the sovereignty, and to Him belongs all praise, and He is over all things competent. (10)"
    },
    {
     "ID": 15,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَلِكُ  الْجَبَّارُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو زبردست اور زور آور بادشاہ ہے",
     "Translation English": "There is no deity except Allah, the Mighty, the Compeller"
    },
    {
     "ID": 16,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْوَاحِدُ  الْقَهَّارُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو اکیلا غالب ہے",
     "Translation English": "There is no deity except Allah, the One, the Prevailing."
    },
    {
     "ID": 17,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْعَزِيْزُ  الْغَفَّار",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو طاقت والا ، بہت فغفرت کرنے والا ہے",
     "Translation English": "There is no deity except Allah, the Mighty, the Forgiving"
    },
    {
     "ID": 18,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْكَرِيْمُ  السَّتَّارُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو کریم اور عیبوں پر پردہ ڈالنے والا ہے",
     "Translation English": "There is no deity except Allah, the Generous, the Concealer."
    },
    {
     "ID": 19,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْكَبِيْرُ  الْمُتَعَالُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو بزرگ اور فائق ہے",
     "Translation English": "There is no deity except Allah, the Great, the Most High."
    },
    {
     "ID": 20,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَالِقُ  اللَّيْلِ  وَ  النَّهَارُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو دن رات کا پیدا کرنے والا ہے",
     "Translation English": "There is no deity except Allah, the Creator of the night and the day"
    },
    {
     "ID": 21,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَعْبُوْدُ  بِكُلِّ  مَكَانٍ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جس کی ہر جگہ عبادت کی جاتی ہے",
     "Translation English": "There is no deity except Allah, worshipped in every place."
    },
    {
     "ID": 22,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَذْكُوْرُ  بِكُلِّ  لِسَانٍ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جس کا ہر زبان سے ذکر کیا جاتا ہے",
     "Translation English": "There is no deity except Allah, mentioned on every tongue"
    },
    {
     "ID": 23,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَعْرُوْفُ  بِكُلِّ  اِحْسَانٍ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو ہر احسان کے ساتھ مشہور ہے",
     "Translation English": "There is no deity except Allah, recognized in every act of kindness."
    },
    {
     "ID": 24,
     "Arabic": "لَا  ِلٰهَ  اِلَّا  اللّٰهُ  كُلَّ  يَوْمٍ  هُوَ  فِى  شَانٍ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو ہر دن ایک نئی شان میں ہوتا ہے",
     "Translation English": "There is no deity except Allah, every day He is in a glorious state"
    },
    {
     "ID": 25,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اِيْمَانًا  بِۢااللّٰهِ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں اللہ پر ایمان لاتے ہوئے",
     "Translation English": "There is no deity except Allah, in faith in Allah."
    },
    {
     "ID": 26,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَمَانًا  مِّنَّ  اللّٰهِ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں اللہ سے امن مانگتے ہوئے",
     "Translation English": "There is no deity except Allah, seeking refuge in Allah."
    },
    {
     "ID": 27,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَمَانَةً مِنْ عِنْدِ  اللّٰهِ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں اللہ کے پاس امانت رکھتے ہوئے",
     "Translation English": "There is no deity except Allah, a trust from Allah"
    },
    {
     "ID": 28,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  وَلَا حَوْلَ  وَلَا  قُوَّةَ  اِلَّا بِااللّٰه",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں اور اللہ کے سوا کسی اور کو طاقت نہیں",
     "Translation English": "There is no deity except Allah, and there is no power or strength except by Allah."
    },
    {
     "ID": 29,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  وَلَا  نَعْبُدُ  اِلَّا  اِيَّاهُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں اور ہم اس کے بغیر کسی اور کی عبادت نہیں کرتے",
     "Translation English": "There is no deity except Allah, and we worship none but Him."
    },
    {
     "ID": 30,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  حَقًّا  حَقًّا",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں اور یہ بات بالکل سچ ہے",
     "Translation English": "There is no deity except Allah, in truth, in truth."
    },
    {
     "ID": 31,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اِيْمَانًا  وَّصِدْقًا",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں ایمان اور سچّائی سے (کہتا ہوں)",
     "Translation English": "There is no deity except Allah, in faith and truth."
    },
    {
     "ID": 32,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  تَعَبُّدًا  وَّرِقًّا",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں بندگی اور غلامی کے ساتھ (کہتا ہوں)",
     "Translation English": "There is no deity except Allah, worshipped with humility and sincerity."
    },
    {
     "ID": 33,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  تَلَطُّفًا  وَّرِفْقًا",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں مہربانی اور رفاقت(کے اعتبار) سے",
     "Translation English": "There is no deity except Allah, with gentleness and compassion."
    },
    {
     "ID": 34,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  قَبْلَ  كُلِّ  شىْءٍ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو ہر چیز سے پہلے ہے",
     "Translation English": "There is no deity except Allah, before everything."
    },
    {
     "ID": 35,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  بَعْدَ  كُلِّ  شىْءٍ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو ہر چیز کے بعد باقی ہے",
     "Translation English": "There is no deity except Allah, after everything."
    },
    {
     "ID": 36,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  يَبْقٰى  رَبُّنَا  وَ  يَفْنٰى  وَيَمُوْتُ  كُلُّ  شىْءٍ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں ، ہمارا پروردگار باقی رہے گا اور ہر ایک چیز فنا ہو جائے گی اور مر جائے گی",
     "Translation English": "There is no deity except Allah, our Lord, who remains while everything else perishes."
    },
    {
     "ID": 37,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَلِكُ  الْحَقُّ  الْمُبِيْنُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو بادشاہِ حقیقی اور ظاہر و ممتاز ہے",
     "Translation English": "There is no deity except Allah, the Sovereign, the Clear Truth"
    },
    {
     "ID": 38,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْمَلِكُ  الْحَقُّ  الْيَقِيْنُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو بادشاہِ حقیقی و یقینی ہے",
     "Translation English": "There is no deity except Allah, the Sovereign, the Sure Reality."
    },
    {
     "ID": 39,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْعَلِىُّ  الْعَظِيْمُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو بلند اور بڑا ہے",
     "Translation English": "There is no deity except Allah, the Most High, the Most Great"
    },
    {
     "ID": 40,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  الْحَلِيْمُ  الْكَرِيْمُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو بردبار اور سخی ہے",
     "Translation English": "There is no deity except Allah, the Forbearing, the Generous."
    },
    {
     "ID": 41,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  رَبُّ  السَّمٰوٰتِ  السَّبْعِ  وَ  رَبُّ  الْعَرْشِ  الْعَظِيْمُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو سات آسمانوں کا پالنے والا اور عرش عظیم کا پروردگار ہے",
     "Translation English": "There is no deity except Allah, the Lord of the seven heavens and the Great Throne."
    },
    {
     "ID": 42,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَكْرَمُ  الْاَكْرَمِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو تمام سخیوں سے زیادہ سخی ہے",
     "Translation English": "There is no deity except Allah, the Most Noble of the noble"
    },
    {
     "ID": 43,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَرْحَمُ  الرَّاحِمِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو تمام مہربانوں سے زیادہ مہربان ہے",
     "Translation English": "There is no deity except Allah, the Most Merciful of the merciful."
    },
    {
     "ID": 44,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  حَبِيْبُ  التَّوَّابِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو تمام توبہ کرنے والوں کو دوست رکتھا ہے",
     "Translation English": "There is no deity except Allah, the Beloved of those who repent"
    },
    {
     "ID": 45,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  رَاحِمُ  الْمَسَاكِيْنِ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو مسکینوں پر رحم کرنے والا ہے",
     "Translation English": "There is no deity except Allah, the Compassionate to the poor."
    },
    {
     "ID": 46,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  هَادِىَ  الْمُضَلِّيْنِ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو گمراہوں کو سیدھا راستہ دکھانے والا ہے",
     "Translation English": "There is no deity except Allah, the Guide of the astray."
    },
    {
     "ID": 47,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  دَلِيْلُ  الْحَاْئِرِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو حیرانوں کا راہ نما ہے",
     "Translation English": "There is no deity except Allah, the Evidence for the perplexed"
    },
    {
     "ID": 48,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَمَانُ  الْخَاْئِفِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو خوف کے ماروں کے لئے امن ہے",
     "Translation English": "There is no deity except Allah, the Refuge of the fearful."
    },
    {
     "ID": 49,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  غَيٰاثُ  الْمُسْتَغِيْثِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو فریادیوں کی فریاد کو پہنچنے والا ہے",
     "Translation English": "There is no deity except Allah, the Helper of the seekers of help."
    },
    {
     "ID": 50,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  النَّاصِرِيْنِ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو مددگاروں میں سے بہتر مددگار ہے",
     "Translation English": "There is no deity except Allah, the Best of the victors."
    },
    {
     "ID": 51,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الْحَافِظِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو محافظوں میں سے بہتر محافظ ہے",
     "Translation English": "There is no deity except Allah, the Best of the protectors."
    },
    {
     "ID": 52,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الْوَارِثِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو بہتر وارث عطا کرنے والا ہے",
     "Translation English": "There is no deity except Allah, the Best of the inheritors"
    },
    {
     "ID": 53,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الْحَاكِمِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو بہترین حاکم ہے",
     "Translation English": "There is no deity except Allah, the Best of the judges."
    },
    {
     "ID": 54,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الرَّازِقِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو سب سے اچھا رزق دینے والا ہے",
     "Translation English": "There is no deity except Allah, the Best of the sustainers"
    },
    {
     "ID": 55,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الْفَاتِحِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو تمام مشکلوں کو حل کرنے والا ہے",
     "Translation English": "There is no deity except Allah, the Best of the openers"
    },
    {
     "ID": 56,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الْغَافِرِيْنَ",
     "Translation Urdu": "کے بغیر کوئی اور معبود نہیں جو بہتر مغفرت کرنے والا ہے",
     "Translation English": "There is no deity except Allah, the Best of the forgivers"
    },
    {
     "ID": 57,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  خَيْرُ  الرَّاحِمِيْنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو بہتر رحم کرنے والا ہے",
     "Translation English": "There is no deity except Allah, the Best of the merciful"
    },
    {
     "ID": 58,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  وَحْدَهٗ  وَصَدَقَ  وَعْدَهٗ  وَنَصَرَ  عَبْدَهٗ  وَاَعَذَّ  جُنْدُهٗ  وَ  هَذَمَ  الْاَحْذَاْبَ  وَحْدَهٗ  وَلَاْ  شَىْءَ  بَعْدَهٗ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں وہ اکیلا ہے اور اس نے اپنا وعدہ سچّا کیا اور اپنے بندے (حضرت محمدؐ) کی مدد کی اور ان کے لشکر کو غالب بنا دیا اور اس کی اکیلی ذات نے کافروں کو شکست دی اور اس کے بعد کوئی اور چیز نہیں",
     "Translation English": "There is no deity except Allah, alone, fulfilling His promise, aiding His servant, defeating the parties alone. There is nothing after Him."
    },
    {
     "ID": 59,
     "Arabic": "لَا  اِلٰهَ  اِلَّا  اللّٰهُ  اَهْلُ  النِّعْمَةِ  وَ  لَهُ  الْفَضْلُ  وَلَهُ  الْثَنَآءُ  الْحَسَنَ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو نعمت والا ہے اور اسی کے لئے فضیلت ہے اور اسی کے لئے اچھی تعریف ہے",
     "Translation English": "There is no deity except Allah, the people of blessings, to whom belongs all virtue and commendation"
    },
    {
     "ID": 60,
     "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  عَدَدَ  خَلْقِهٖ  وَذِنَةَ  عَرْشِهٖ  وَرِضَآءَ  نَفْسِهٖ  وَمِدَادَ  كَلِمَاتِهٖ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں ، اس کی مخلوق کے شمار، اس کے عرش کے وزن، اس کی ذات کی رضامندی اور اس کے کلمات کی روشنائی کے برابر",
     "Translation English": "There is no deity except Allah, the number of His creation, the extent of His throne, and the satisfaction of His soul. And the ink of His words"
    },
    {
     "ID": 61,
     "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  صَاحِبُ  الْوَحْدَانِيَّةِ  الْفَرْدَانِيَّةِ  الْقَدِيْمِيَّةِ  الْاَذَلِيَّةِ  الْاَبَدِيَّةِ  لَيْسَ  لَهُ  ضِدٌّ  وَلَا  نِدٌّ  وَلَا  شِبْهٌ  وَلَا  شَرِيْكٌ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو صرف ایک واحد مفرد اور ابتدائ سے لے کر ہمیشہ رہنے والی ذات ہے۔ جس کی نہ کوئی ضد ہے نہ کوئی اس کے برابر کا ہے۔ نہ کوئی اس کے مانند ہے اور نہ ساجھی ہے اس ک",
     "Translation English": "There is no deity except Allah, the One with unique oneness, ancient and eternal, without any opposition, equal, or partner"
    },
    {
     "ID": 62,
     "Arabic": "لَا  اِلٰهَ  الَّا  اللّٰهُ  وَحْدَهٗ  لَا  شَرِيْكَ  لَهٗ  لَهُ  الْمَلْكُ  وَ  لَهُ  الْحَمْدُ  يُحْيِىْ  وَ  يُمِيْتُ  وَ  هُوَ  حَىٌّ  لَّا  يَمُوْتُ  بِيَدِهِ  الْخَيْرُ  وَ  هُوَ  عَلٰى  كُلِّ  شىْءٍ  قَدِيْرٌ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں۔ وہ اکیلا ہے۔ اس کا کوئی شریک نہیں اسی کے لئے بادشاہی شایانِ شان ہے اور اسی کے لئے تمام تعریفیں ہیں جو زندہ کرتا اور مارتا ہے۔ وہ زندہ ہے۔ جو کبھی نہیں مریگا۔ اسی کے اختیار میں خیر ہے۔ اور وہ ہر چیز پر قدرت رکھتا ہے",
     "Translation English": "There is no deity except Allah, alone, without any partner. To Him belongs the dominion, and to Him belongs the praise. He gives life and causes death, and He is, over all things, competent"
    },
    {
     "ID": 63,
     "Arabic": "وَاِلَيْهِ  الْمَصِيْرُ  هُوَ  الْاَوَّلُ  وَلْاٰخِرُ  وَالظَّاهِرُ  وَالْبَاطِنُ  وَ  هُوَ  بِكُلِّ  شَىْءٍ  عَلِيْمٌ  لَيْسَ  كَمِثْلِهٖ  شَىْءٌ  وَّ  هُوَ  السَّمِيْعُ  الْبَصِيْرُ",
     "Translation Urdu": "اور اسی کی طرف سب کو لوٹنا ہے۔ وہ سب سے پہلے ہے اور سب سے پیچھے وہ ظاہر بھی ہے اور باطن بھی وہ ہر چیز کو جانتا ہے۔ اس جیسی کوئی چیز نہیں وہ سننے اور دیکھنے والا ہے",
     "Translation English": "And to Him is the destination. He is the First and the Last, the Manifest and the Hidden, and He is, over all things, Knowing. There is nothing like unto Him, and He is the Hearing, the Seeing"
    },
    {
     "ID": 64,
     "Arabic": "حَسْبَنَا  اللّٰهُ  وَ  نِعْمَ  الْوَكِيْلُ  نِعْمَ  الْمَوْلٰى  وَ  نِعْمَ  النَّصِيْرُ",
     "Translation Urdu": "ہمیں اللہ کافی ہے اور وہ بہتر کارساز ہے ۔ اچھا آقا اور اچھا مددگار ہے",
     "Translation English": "Allah is sufficient for us, and He is the best Disposer of affairs. The best Guardian, the best Master, and the best Helper"
    },
    {
     "ID": 65,
     "Arabic": "حَسْبَنَا  اللّٰهُ  وَ  نِعْمَ  الْوَكِيْلُ  نِعْمَ  الْمَوْلٰى  وَ  نِعْمَ  النَّصِيْرُ",
     "Translation Urdu": "ہمیں اللہ کافی ہے اور وہ بہتر کارساز ہے ۔ اچھا آقا اور اچھا مددگار ہے",
     "Translation English": "Allah is sufficient for us, and He is the best Disposer of affairs. The best Master, and the best Helper"
    },
    {
     "ID": 66,
     "Arabic": "حَسْبَنَا  اللّٰهُ  وَ  نِعْمَ  الْوَكِيْلُ  نِعْمَ  الْمَوْلٰى  وَ  نِعْمَ  النَّصِيْرُ",
     "Translation Urdu": "ہمیں اللہ کافی ہے اور وہ بہتر کارساز ہے ۔ اچھا آقا اور اچھا مددگار ہے",
     "Translation English": "Allah is sufficient for us, and He is the best Disposer of affairs. The best Master, and the best Helper."
    },
    {
     "ID": 67,
     "Arabic": "غُفْرَانَكَ  رَبَّنَا  وَ  اِلَيْكَ  الْمَصِيْرُ",
     "Translation Urdu": "اے ہمارے پروردگار ۔ ہم تیری مغفرت چاہتے ہیں اور تیری ہی طرف لوٹنے کی جگہ ہے",
     "Translation English": "Forgiveness is Yours, our Lord, and to You is the final destination"
    },
    {
     "ID": 68,
     "Arabic": "اَللّٰهُمَّ  لَا  مَانِعَ  لِمَا  اَعْطَيْتَ  وَلَا  مُعْطِےَ  لِمَا  مَنَعْتَ  وَلَا  رَآدَّ  لِمَا  قَضَيْتَ  وَلَا  يَنْفَعُ  ذَالْجَدِّ  مِنْكَ  الْجَدُّ",
     "Translation Urdu": "اے میرے اللہ جو کچھ تو عطا کرے اسے کوئی روکنے والا نہیں اور جو چیز تو روک لے گا وہ کوئی دے نہیں سکتا۔ اور جو کچھ تو فیصلہ کر دے اسے کوئی ٹال نہیں سکتا۔ اور تیرے سامنے دولت مند کو دولت مندی کوئی فائدہ نہیں دیتی ہے",
     "Translation English": "O Allah, there is no preventer of what You have given, and no giver of what You have prevented. There is no one to overrule what You have decreed, and no one can benefit against Your will"
    },
    {
     "ID": 69,
     "Arabic": "سُبْحَانَ  رَبِّىَ  الْعَلِىَّ  الْاَعْلَى  الوَهَابِ",
     "Translation Urdu": "بہت پاک ہے میرا پروردگار جو بہت ہی اونچا اور بہت بخشنے والا ہے",
     "Translation English": "Glory be to my Lord, the Most High, the Bestower."
    },
    {
     "ID": 70,
     "Arabic": "سُبْحَانَ  رَبِّىَ  الْعَلِىَّ  الْاَعْلَى  الوَهَابِ",
     "Translation Urdu": "بہت پاک ہے میرا پروردگار جو بہت ہی اونچا اور بہت بخشنے والا ہے",
     "Translation English": "Glory be to my Lord, the Most High, the Bestower."
    },
    {
     "ID": 71,
     "Arabic": "سُبْحَانَ  رَبِّىَ  الْعَلِىَّ  الْاَعْلَى  الوَهَابِ",
     "Translation Urdu": "بہت پاک ہے میرا پروردگار جو بہت ہی اونچا اور بہت بخشنے والا ہے",
     "Translation English": "Glory be to my Lord, the Most High, the Bestower."
    },
    {
     "ID": 72,
     "Arabic": "سُبْحَانَ  رَبِّىَ  الْعَلِّىِ  الْاَعْلَى  الْكَرِيْمِ  الْوَهَابِ  يَا  وَهَّابُ",
     "Translation Urdu": "پاک ہے میرا رب جو سب سے بلند اور بخشنے والا اور بہت عطا کرنے والا ہے، اے بہت بخشنے والے",
     "Translation English": "Glory to my Lord, the Most High, the Most Generous Bestower. O Bestower!"
    },
    {
     "ID": 73,
     "Arabic": "سُبْحٰنَكَ  مَا  عَبَدْنَاكَ  حَقَّ  عِبَادَتِكَ",
     "Translation Urdu": "تو پاک ہے ۔ ہم نے تیری عبادت جیسا کہ تیرا حق تھا نہیں کی",
     "Translation English": "Glory be to You, we have not worshiped You as You truly deserve."
    },
    {
     "ID": 74,
     "Arabic": "سُبْحٰنَكَ  مَا  عَرَفْنَاكَ  حَقَّ  مَعْرِفَتِكَ",
     "Translation Urdu": "تو پاک ہے ہم نے تجھے جیسا کہ تیرا حق تھا نہیں پہچان",
     "Translation English": "Glory be to You, we have not known You as You truly deserve to be known."
    },
    {
     "ID": 75,
     "Arabic": "سُبْحٰنَكَ  مَا  ذَكَرْنَاكَ  حَقَّ  ذِكْرِكَ",
     "Translation Urdu": "تو پاک ہے (اے خدا) ہم نے تیرا ذکر جیسا کہ تیرا حق تھا نہیں کی",
     "Translation English": "Glory be to You; we have not mentioned You as You truly deserve to be mentioned."
    },
    {
     "ID": 76,
     "Arabic": "سُبْحٰنَكَ  مَا  شَكَرْنَاكَ  حَقَّ  شُكْرِكَ",
     "Translation Urdu": "تو پاک ہے۔ ہم نے تیرے حق کے مطابق تیرا شکر نہیں کیا",
     "Translation English": "Glory be to You; we have not thanked You as You truly deserve to be thanked."
    },
    {
     "ID": 77,
     "Arabic": "سُبْحٰنَ  اللّٰهِ  الْاَبَدِىِّ  الْاَبَدِ",
     "Translation Urdu": "میں اللہ کی پاکی بیان کرتا ہوں جو ہمیشہ ہمیشہ رہنے والا ہے",
     "Translation English": "Glory is to Allah, the Eternal, the Everlasting."
    },
    {
     "ID": 78,
     "Arabic": "سُبْحٰنَ  اللّٰهِ  الْوَاحِدِ  الْاَحَدِ",
     "Translation Urdu": "میں اللہ کی پاکی بیان کرتا ہوں جو ایک اکیلا ہے",
     "Translation English": "Glory is to Allah, the One, the Unique."
    },
    {
     "ID": 79,
     "Arabic": "سُبْحَانَ  اللّٰهِ  الْفَرَدِ  الصَّمَدِ",
     "Translation Urdu": "اس اللہ کی پاکی بیان کرتا ہوں جو ایک اور بے نیاز ہے",
     "Translation English": "Glory is to Allah, the Eternal, the Absolute."
    },
    {
     "ID": 80,
     "Arabic": "سُبْحٰنَ  اللّٰهِ  رَافِعِ  السَّمٰوٰتِ  بِغَيْرِ  عَمَدٍ",
     "Translation Urdu": "اللہ کی پاکی بیان کرتا ہوں جو آسمانوں کو بغیر ستونوں کے بلند کرنے والا ہے",
     "Translation English": "Glory is to Allah, who raises the heavens without any pillars."
    },
    {
     "ID": 81,
     "Arabic": "سُبْحَانَ  اللّٰهِ  الَّذِىْ  لَمْ  يَتَّخِذْ  صَاحِبَةً  وَّلَا  وَلَدً",
     "Translation Urdu": "اُس اللہ کی پاکی بیان کرتا ہوں جس نے نہ بیوی اختیار کی ہے اور نہ اولاد",
     "Translation English": "Glory is to Allah, who has neither a companion nor a son."
    },
    {
     "ID": 82,
     "Arabic": "سُبْحَانَ  اللّٰهِ  الَّذِىْ  لَمْ  يَلِدْ  وَ  لَمْ  يُوْلَدْ  وَلَمْ  يَكُنْ  لَهُ  كُفُوًا  اَحَدٌ",
     "Translation Urdu": "پاک ہے وہ اللہ جس نے نہ تو کسی کو جنا ہے اور نہ وہ کسی سے جنا گیا ہے اور نہ ہی اس کا کوئی ہمسر اور برابر ہے",
     "Translation English": "Glory is to Allah, who neither begets nor is begotten, and there is none comparable to Him."
    },
    {
     "ID": 83,
     "Arabic": "سُبْحَانَ اللّٰهِ الْملِكِ  الْقُدُّوْسِ",
     "Translation Urdu": "پاک ہے (اللہ جو) پاکیزہ بادشاہ ہے",
     "Translation English": "Glory is to Allah, the Sovereign, the Holy"
    },
    {
     "ID": 84,
     "Arabic": "سُبْحَانَ  ذِىْ  الْمُلْكِ  وَ  الْمَلَكُوْتِ",
     "Translation Urdu": "پاک ہے وہ اللہ جو ظاہری دنیا اور فرشتوں کی دنیا کا مالک ہے",
     "Translation English": "Glory is to the Possessor of dominion and sovereignty"
    },
    {
     "ID": 85,
     "Arabic": "سُبْحَانَ  ذِىْ  الْعِزَّةِ  وَ  الْعَظْمَةِ  وَالْقُدْرَةِ  وَالهَيْبَةِ  وَالْجَلَالِ  وَالْجَمَالِ  وَالْكَمَالِ  وَالْبَقَآءِ  وَالثَّنَاءِ  وَالضِّيْآءِ  وَلْاٰلَآءِ  وَالنَّعْمَآءِ  وَالْكِبْرِيَآءِ  وَالْجَبَرُوْتِ",
     "Translation Urdu": "پاک ہے (اللہ جو) عزّت بڑائی، قدرت، ہیبت، اور رعب ، خوبصورتی، کمال، ہمیشگی، تعریف، روشنی اور باطنی اور ظاہری نعمتوں والا اور بڑائی اور بہت رعب داب والا ہے",
     "Translation English": "Glory be to the One who possesses might, magnificence, power, awe, majesty, beauty, perfection, eternity, praise, radiance, grace, blessings, grandeur, and might."
    },
    {
     "ID": 86,
     "Arabic": "سُبْحَانَ  الْمَلِكِ  الْحَىِّ  الَّذِىْ  لَا  يَنَامُ  وَلَا  يَمُوْتُ",
     "Translation Urdu": "پاک ہے وہ بادشاہ جو زندہ جاوید ہے جو نہ سوتا ہے اور نہ مرتا ہے",
     "Translation English": "Glory is to the Living King who neither sleeps nor dies."
    },
    {
     "ID": 87,
     "Arabic": "سُبُّوْحٌ  قُدٌوْسٌ  رَبُّنَا  وَرَبُّ  الْمَلٰٓئِكَةِ  وَ  الرُّوْحِ",
     "Translation Urdu": "وہ بہت پاک اور منزّہ ہے وہ ہمارا پروردگار اور فرشتوں کا پروردگار اور روح کا پروردگار ہے",
     "Translation English": "Glory is to the Holy, the Lord of angels and spirits."
    },
    {
     "ID": 88,
     "Arabic": "سُبْحَانَ  اللّٰهِ  وَالْحَمدُ  لِلّٰهِ  وَ  لَا  اِلٰهَ  الَّا  اللّٰهُ  وَاللّٰهُ  اَكْبَرْ  وَلَا  حَوْلَ  وَلَا  قُوَّةَ  اِلَّا  بِااللّٰهِ  الْعَلِىِّ  الْعَظِيْم",
     "Translation Urdu": "پاک ہے اللہ اور تمام تعریفیں اللہ کے لیے ہیں۔ اور اللہ کے بغیر کوئی اور معبود نہیں اور اللہ سب سے بڑا ہے اور اللہ کے بغیر کسی اور کو طاقت اور قدرت نہیں جو بلند اور برتر ہے",
     "Translation English": "Glory is to Allah, and praise be to Allah, and there is no god but Allah, and Allah is the Greatest. There is no power or strength except with Allah, the Most High, the Supreme."
    },
    {
     "ID": 89,
     "Arabic": "اَللّٰهُمَّ  اَنْتَ  الْمَلِكُ  الْحَقُّ  الَّذِىْ  لَا  اِلٰهَ  اِلَّا  اَنْتَ",
     "Translation Urdu": "اے میرے اللہ تو بادشاہِ حقیقی ہے۔ تیری بغیر کوئی معبود نہیں",
     "Translation English": "O Allah, You are the true King; there is no god but You."
    },
    {
     "ID": 90,
     "Arabic": "يَااَللّٰهُ",
     "Translation Urdu": "۔ اے خدا",
     "Translation English": "O Allah"
    },
    {
     "ID": 91,
     "Arabic": "يَارَحْمٰنُ",
     "Translation Urdu": "اے دنیا کے مہربان",
     "Translation English": "O Ar-Rahman (The Most Gracious)"
    },
    {
     "ID": 92,
     "Arabic": "يَارَحِيْمُ",
     "Translation Urdu": "اے آخرت کے مہربان",
     "Translation English": "O Ar-Rahim (The Most Merciful)"
    },
    {
     "ID": 93,
     "Arabic": "يَامَلِكُ",
     "Translation Urdu": "اے بادشاہ",
     "Translation English": "O Al-Malik (The Sovereign)"
    },
    {
     "ID": 94,
     "Arabic": "يَاقُدُّوْسُ",
     "Translation Urdu": "اے پاک",
     "Translation English": "O Al-Quddus (The Holy)"
    },
    {
     "ID": 95,
     "Arabic": "يَاسَلَامُ",
     "Translation Urdu": "اےسلامتی والے",
     "Translation English": "O As-Salam (The Source of Peace)"
    },
    {
     "ID": 96,
     "Arabic": "يَامُؤْمِنُ",
     "Translation Urdu": "اے امن دینے والا",
     "Translation English": "O Al-Mu'min (The Guardian)"
    },
    {
     "ID": 97,
     "Arabic": "يَامُهَيْمِنُ",
     "Translation Urdu": "اے نگہبان",
     "Translation English": "O Al-Muhaymin (The Trustworthy)"
    },
    {
     "ID": 98,
     "Arabic": "يَاعَزِيْزُ",
     "Translation Urdu": "اے غالب",
     "Translation English": "O Al-Aziz (The Mighty)"
    },
    {
     "ID": 99,
     "Arabic": "يَاجَبَّارُ",
     "Translation Urdu": "اے زبردست",
     "Translation English": "O Al-Jabbar (The Compeller)"
    },
    {
     "ID": 100,
     "Arabic": "يَامُتَكَبِّرُ",
     "Translation Urdu": "اے عظمت والے",
     "Translation English": "O Al-Mutakabbir (The Majestic)"
    },
    {
     "ID": 101,
     "Arabic": "يَاخَالِقُ",
     "Translation Urdu": "اے پیدا کرنے والے",
     "Translation English": "O Al-Khaliq (The Creator)"
    },
    {
     "ID": 102,
     "Arabic": "يَابَارِئُ",
     "Translation Urdu": "اے آسمان پیدا کرنے والے",
     "Translation English": "O Al-Bari' (The Originator)"
    },
    {
     "ID": 103,
     "Arabic": "يَامُصَوِّرُ",
     "Translation Urdu": "اے صورتیں بنانے والے",
     "Translation English": "O Al-Musawwir (The Shaper)"
    },
    {
     "ID": 104,
     "Arabic": "يَاغَفَّارُ",
     "Translation Urdu": "اے بہت مغفرت کرنیوالے",
     "Translation English": "O Al-Ghaffar (The Forgiver)"
    },
    {
     "ID": 105,
     "Arabic": "يَاقَهَّارُ",
     "Translation Urdu": "اے بہت قہر کرنے والے",
     "Translation English": "O Al-Qahhar (The Subduer)"
    },
    {
     "ID": 106,
     "Arabic": "يَاوَهَّابُ",
     "Translation Urdu": "اے بہت بخشنے والے",
     "Translation English": "O Al-Wahhab (The Bestower)"
    },
    {
     "ID": 107,
     "Arabic": "يَارَزَّاقُ",
     "Translation Urdu": "اے بہت رزق دینے والے",
     "Translation English": "O Ar-Razzaq (The Provider)"
    },
    {
     "ID": 108,
     "Arabic": "يَافَتَّاحُ",
     "Translation Urdu": "اے رحمت کا دروازہ کھولنے والے",
     "Translation English": "O Al-Fattah (The Opener)"
    },
    {
     "ID": 109,
     "Arabic": "يَاعَلِيْمُ",
     "Translation Urdu": "اے بہت جاننے والے",
     "Translation English": "O Al-Alim (The Knower)"
    },
    {
     "ID": 110,
     "Arabic": "يَاقَابِضُ",
     "Translation Urdu": "اے رزق تنگ کرنیوالے",
     "Translation English": "O Al-Qabid (The Constrictor)"
    },
    {
     "ID": 111,
     "Arabic": "يَابَاسِطُ",
     "Translation Urdu": "اے وسعت عطا کرنےوالے",
     "Translation English": "O Al-Basit (The Expander)"
    },
    {
     "ID": 112,
     "Arabic": "يَاخَافِضُ",
     "Translation Urdu": "اے پست کرنے والے",
     "Translation English": "O Al-Khafid (The Abaser)"
    },
    {
     "ID": 113,
     "Arabic": "يَارَافِعُ",
     "Translation Urdu": "اے بلند کرنے والے",
     "Translation English": "O Ar-Rafi (The Exalter)"
    },
    {
     "ID": 114,
     "Arabic": "يَامُعِزُّ",
     "Translation Urdu": "اے عزّت دینے والے",
     "Translation English": "O Al-Mu'izz (The Honorer)"
    },
    {
     "ID": 115,
     "Arabic": "يَامُزِلُّ",
     "Translation Urdu": "اے ذلّت دینے والے",
     "Translation English": "O Al-Mudhill (The Humiliator)"
    },
    {
     "ID": 116,
     "Arabic": "يَاسَمِيْعُ",
     "Translation Urdu": "اے بہت سننے والے",
     "Translation English": "O As-Sami (The Hearer)"
    },
    {
     "ID": 117,
     "Arabic": "يَابَصِيْرُ",
     "Translation Urdu": "اے بہت دیکھنے والے",
     "Translation English": "O Al-Basir (The Seer)"
    },
    {
     "ID": 118,
     "Arabic": "يَاحَكَمُ",
     "Translation Urdu": "اے فیصلہ کرنے والے",
     "Translation English": "O Al-Hakam (The Judge)"
    },
    {
     "ID": 119,
     "Arabic": "يَاعَدْلُ",
     "Translation Urdu": "اے انصاف کرنیوالے",
     "Translation English": "O Al-Adl (The Just)"
    },
    {
     "ID": 120,
     "Arabic": "يَالَطِيْفُ",
     "Translation Urdu": "اے مہربان",
     "Translation English": "O Al-Latif (The Subtle)"
    },
    {
     "ID": 121,
     "Arabic": "يَاخَبِيْرُ",
     "Translation Urdu": "اے خبر رکھنے والے",
     "Translation English": "O Al-Khabir (The All-Knowing)"
    },
    {
     "ID": 122,
     "Arabic": "يَاحَلِيْمُ",
     "Translation Urdu": "اے بردبار",
     "Translation English": "O Al-Halim (The Clement)"
    },
    {
     "ID": 123,
     "Arabic": "يَاعَظِيْمُ",
     "Translation Urdu": "اے عظمت والے",
     "Translation English": "O Al-Azim (The Great)"
    },
    {
     "ID": 124,
     "Arabic": "يَاغَفُوْرُ",
     "Translation Urdu": "اے بخشنے والے",
     "Translation English": "Ya Ghafur: O Forgiving"
    },
    {
     "ID": 125,
     "Arabic": "يَاشَكُوْرُ",
     "Translation Urdu": "اے فررمابرداروں کے قدردان",
     "Translation English": "Ya Shakur: O Appreciative"
    },
    {
     "ID": 126,
     "Arabic": "يَاعَلِىُّ",
     "Translation Urdu": "۔ اے بہت اونچے",
     "Translation English": "Ya Aliyyu: O Most High"
    },
    {
     "ID": 127,
     "Arabic": "يَاكَبِيْرُ",
     "Translation Urdu": "اے بہت بڑے",
     "Translation English": "Ya Kabiru: O Great"
    },
    {
     "ID": 128,
     "Arabic": "يَاحَفِيْظُ",
     "Translation Urdu": "اے حفاظت کرنیوالے",
     "Translation English": "Ya Hafizu: O Protector"
    },
    {
     "ID": 129,
     "Arabic": "يَامُقِيْتُ",
     "Translation Urdu": "اے روزی دینے والے",
     "Translation English": "Ya Muqitu: O Sustainer"
    },
    {
     "ID": 130,
     "Arabic": "يَاحَسِيْبُ",
     "Translation Urdu": "اے مصائب میں کافی ہونیوالے",
     "Translation English": "Ya Hasibu: O Reckoner"
    },
    {
     "ID": 131,
     "Arabic": "يَاجَلِيْلُ",
     "Translation Urdu": "اے بہت بڑے",
     "Translation English": "Ya Jalilu: O Majestic"
    },
    {
     "ID": 132,
     "Arabic": "يَاكَرِيْمُ",
     "Translation Urdu": "اے بہت سخی",
     "Translation English": "Ya Karimu: O Generous"
    },
    {
     "ID": 133,
     "Arabic": "يَارَقِيْبُ",
     "Translation Urdu": "اے خیال رکھنے والے",
     "Translation English": "Ya Raqibu: O Watchful"
    },
    {
     "ID": 134,
     "Arabic": "يَامُجِيْبُ",
     "Translation Urdu": "اے دعا قبول کرنیوالے",
     "Translation English": "Ya Mujibu: O Responsive"
    },
    {
     "ID": 135,
     "Arabic": "يَاوَاسِعُ",
     "Translation Urdu": "اے وسعت کرنے والے",
     "Translation English": "Ya Wasiu: O All-Encompassing"
    },
    {
     "ID": 136,
     "Arabic": "يَاحَكِيْمُ",
     "Translation Urdu": "اے حکمت کرنے والے",
     "Translation English": "Ya Hakimu: O Wise"
    },
    {
     "ID": 137,
     "Arabic": "يَاوَدُوْدُ",
     "Translation Urdu": "اے محبت کرنے والے",
     "Translation English": "Ya Wadudu: O Loving"
    },
    {
     "ID": 138,
     "Arabic": "يَامَجِيْدُ",
     "Translation Urdu": "اے بزرگی والے",
     "Translation English": "Ya Majidu: O Glorious"
    },
    {
     "ID": 139,
     "Arabic": "يَابَاعِثُ",
     "Translation Urdu": "اے قبروں سے اٹھانیوالے",
     "Translation English": "Ya Ba'ithu: O Resurrector"
    },
    {
     "ID": 140,
     "Arabic": "يَاشَهِيْدُ",
     "Translation Urdu": "اے حاضر و ناظر",
     "Translation English": "Ya Shahidu: O Witness"
    },
    {
     "ID": 141,
     "Arabic": "يَاحَقُّ",
     "Translation Urdu": "اے وہ ذات جسکا وجود ثابت ہے",
     "Translation English": "Ya Haqqu: O True"
    },
    {
     "ID": 142,
     "Arabic": "يَاوَكِيْلُ",
     "Translation Urdu": "اے کارساز",
     "Translation English": "Ya Wakilu: O Trustee"
    },
    {
     "ID": 143,
     "Arabic": "يَاقَوِىُّ",
     "Translation Urdu": "اے طاقت والے",
     "Translation English": "Ya Qawiyyu: O Strong"
    },
    {
     "ID": 144,
     "Arabic": "يَامَتِيْنُ",
     "Translation Urdu": "اے سنجیدہ",
     "Translation English": "Ya Matinu: O Firm"
    },
    {
     "ID": 145,
     "Arabic": "يَاوَلِىُّ",
     "Translation Urdu": "اے دوستی کرنیوالے",
     "Translation English": "Ya Waliyyu: O Protector"
    },
    {
     "ID": 146,
     "Arabic": "يَاحَمِيْدُ",
     "Translation Urdu": "اے تعریف والے",
     "Translation English": "Ya Hamidu: O Praiseworthy"
    },
    {
     "ID": 147,
     "Arabic": "يَامُحْصِىْ",
     "Translation Urdu": "اے گِننے والے",
     "Translation English": "Ya Muhsi: O All-Knowing Counter"
    },
    {
     "ID": 148,
     "Arabic": "يَامُبْدِئُ",
     "Translation Urdu": "اے پیدا کرنے والے",
     "Translation English": "Ya Mubdi'u: O Originator"
    },
    {
     "ID": 149,
     "Arabic": "يَامُعِيْدُ",
     "Translation Urdu": "اے دوبارہ لوٹانے والے",
     "Translation English": "Ya Mu'eedu: O Restorer"
    },
    {
     "ID": 150,
     "Arabic": "يَامُحْيِىْ",
     "Translation Urdu": "اے زندہ کرنے والے",
     "Translation English": "Ya Muhyi: O Giver of Life"
    },
    {
     "ID": 151,
     "Arabic": "يَامُمِيْتُ",
     "Translation Urdu": "اے مارنے والے",
     "Translation English": "Ya Mumitu: O Bringer of Death"
    },
    {
     "ID": 152,
     "Arabic": "يَاحَىُّ",
     "Translation Urdu": "اے زندہ جاوید",
     "Translation English": "Ya Hayyu: O Ever-Living"
    },
    {
     "ID": 153,
     "Arabic": "يَاقَيُّوْمُ",
     "Translation Urdu": "اے کائنات کو سنبھالنے والے",
     "Translation English": "Ya Qayyumu: O Self-Sustaining"
    },
    {
     "ID": 154,
     "Arabic": "يَاوَاجِدُ",
     "Translation Urdu": "اے صاحب وجود",
     "Translation English": "Ya Qadiru: O Able"
    },
    {
     "ID": 155,
     "Arabic": "يَامَاجِدُ",
     "Translation Urdu": "اے بزرگی والے",
     "Translation English": "Ya Majidu: O Glorious"
    },
    {
     "ID": 156,
     "Arabic": "يَاوَاحِدُ",
     "Translation Urdu": "اے خوبیوں میں یکتا",
     "Translation English": "Ya Wahidu: O One"
    },
    {
     "ID": 157,
     "Arabic": "يَااَحَدُ",
     "Translation Urdu": "اے وجود میں ایک",
     "Translation English": "Ya Ahadu: O Unique"
    },
    {
     "ID": 158,
     "Arabic": "يَاصَمَدُ",
     "Translation Urdu": "اے بے نیاز",
     "Translation English": "Ya Samadu: O Eternal"
    },
    {
     "ID": 159,
     "Arabic": "يَاقَادِرُ",
     "Translation Urdu": "اے قدرت والے",
     "Translation English": "Ya Qadiru: O Able"
    },
    {
     "ID": 160,
     "Arabic": "يَامُقْتَدِرُ",
     "Translation Urdu": "اے اقتدار و عزت والے",
     "Translation English": "Ya Muqtadiru: O All-Powerful"
    },
    {
     "ID": 161,
     "Arabic": "يَامُقَدِّمُ",
     "Translation Urdu": "اے آگے کرنے والے",
     "Translation English": "Ya Muqaddimu: O Advancer"
    },
    {
     "ID": 162,
     "Arabic": "يَامُؤَخِّرُ",
     "Translation Urdu": "اے پیچھے کرنے والے",
     "Translation English": "Ya Mu'akhkhiru: O Delayer"
    },
    {
     "ID": 163,
     "Arabic": "يَااَوَّلُ",
     "Translation Urdu": "اے سب سے پہلے",
     "Translation English": "Ya Awwalu: O First"
    },
    {
     "ID": 164,
     "Arabic": "يَااٰخِرُ",
     "Translation Urdu": "اے سب سے آخر",
     "Translation English": "Ya Akhiru: O Last"
    },
    {
     "ID": 165,
     "Arabic": "يَاظَاهِرُ",
     "Translation Urdu": "اے ظاہر",
     "Translation English": "Ya Zahiro: O Manifest"
    },
    {
     "ID": 166,
     "Arabic": "يَابَاطِنُ",
     "Translation Urdu": "اے پوشیدہ",
     "Translation English": "Ya Batinu: O Hidden"
    },
    {
     "ID": 167,
     "Arabic": "يَاوَالِىْ",
     "Translation Urdu": "اے مالک",
     "Translation English": "Ya Waliyu: O Protector"
    },
    {
     "ID": 168,
     "Arabic": "يَامُتَعَالِىْ",
     "Translation Urdu": "اے بلند",
     "Translation English": "Ya Mut'aali: O Most High"
    },
    {
     "ID": 169,
     "Arabic": "يَابَرُّ",
     "Translation Urdu": "اے احسان کرنیوالے",
     "Translation English": "Ya Barru: O Beneficent"
    },
    {
     "ID": 170,
     "Arabic": "يَاتَوَّابُ",
     "Translation Urdu": "اے توبہ قبول کرنے والے",
     "Translation English": "Ya Tawwabu: O Acceptor of Repentance"
    },
    {
     "ID": 171,
     "Arabic": "يَامُنْعِمُ",
     "Translation Urdu": "اے نعمتیں عطا کرنیوالے",
     "Translation English": "Ya Mun'im: O Bestower of Blessings"
    },
    {
     "ID": 172,
     "Arabic": "يَامُنْتَقِمُ",
     "Translation Urdu": "اے بدلہ لینے والے",
     "Translation English": "Ya Muntaqimu: O Avenger"
    },
    {
     "ID": 173,
     "Arabic": "يَاعَفُوُّ",
     "Translation Urdu": "اے معاف کرنیوالے",
     "Translation English": "Ya 'Afuwu: O Pardoner"
    },
    {
     "ID": 174,
     "Arabic": "يَارَؤُفُ",
     "Translation Urdu": "اے مہربان",
     "Translation English": "Ya Ra'ufu: O Compassionate"
    },
    {
     "ID": 175,
     "Arabic": "يَامَالِكَ  الْمُلْكِ",
     "Translation Urdu": "اے تمام جہاں کے بادشاہ",
     "Translation English": "Ya Malikul-Mulk: O Owner of the Kingdom"
    },
    {
     "ID": 176,
     "Arabic": "يَا  ذَالْجَلَالِ  وَالْاِكْرَامِ",
     "Translation Urdu": "اے عزّت اور بزرگی والے",
     "Translation English": "Ya Dhul-Jalali wal-Ikram: O Possessor of Majesty and Honor"
    },
    {
     "ID": 177,
     "Arabic": "يَارَبُّ",
     "Translation Urdu": "اے پالنے والے",
     "Translation English": "Ya Rabbi: O My Lord"
    },
    {
     "ID": 178,
     "Arabic": "يَامُقْسِطُ",
     "Translation Urdu": "اے انصاف کرنیوالے",
     "Translation English": "Ya Muqsitu: O Just"
    },
    {
     "ID": 179,
     "Arabic": "يَاجَامِعُ",
     "Translation Urdu": "اے جمع کرنے والے",
     "Translation English": "Ya Jami'u: O Gatherer"
    },
    {
     "ID": 180,
     "Arabic": "يَاغَنِىُّ",
     "Translation Urdu": "اے بے نیاز",
     "Translation English": "Ya Ghaniyu: O Self-Sufficient"
    },
    {
     "ID": 181,
     "Arabic": "يَامُغْنِى",
     "Translation Urdu": "اے بے نیاز کرنے والے",
     "Translation English": "Ya Mughni: O Enricher"
    },
    {
     "ID": 182,
     "Arabic": "يَامُعْطِىْ",
     "Translation Urdu": "اے عطا کرنے والے",
     "Translation English": "Ya Mu'ati: O Giver"
    },
    {
     "ID": 183,
     "Arabic": "يَامَانِعُ",
     "Translation Urdu": "برائیوں سے روکنے والے",
     "Translation English": "Ya Mani'u: O Withholder"
    },
    {
     "ID": 184,
     "Arabic": "يَاضَآرُّ",
     "Translation Urdu": "اے نقصان پہنچانے والے",
     "Translation English": "Ya Darru: O Harmer"
    },
    {
     "ID": 185,
     "Arabic": "يَانَافِعُ",
     "Translation Urdu": "اے نفع دینے والے",
     "Translation English": "Ya Nafi'u: O Benefiter"
    },
    {
     "ID": 186,
     "Arabic": "يَانُوْرُ",
     "Translation Urdu": "اے نور بخشنے والے",
     "Translation English": "Ya Nur: O Light"
    },
    {
     "ID": 187,
     "Arabic": "يَاهَادِىْ",
     "Translation Urdu": "اے ہدایت کرنےوالے",
     "Translation English": "Ya Hadi: O Guide"
    },
    {
     "ID": 188,
     "Arabic": "يَابَدِيْعُ",
     "Translation Urdu": "اےپیدا کرنے والے",
     "Translation English": "Ya Badi'u: O Originator"
    },
    {
     "ID": 189,
     "Arabic": "يَابَاقِىْ",
     "Translation Urdu": "اے ہمیشہ رہنے والے",
     "Translation English": "Ya Baqi: O Everlasting"
    },
    {
     "ID": 190,
     "Arabic": "يَاوِارثُ",
     "Translation Urdu": "اے کائنات کے مالک",
     "Translation English": "Ya Warithu: O Inheritor"
    },
    {
     "ID": 191,
     "Arabic": "يَارَشِيْدُ",
     "Translation Urdu": "اے ہدایت کرنیوالے",
     "Translation English": "Ya Rashidu: O Righteous"
    },
    {
     "ID": 192,
     "Arabic": "يَاصَبُوْرُ",
     "Translation Urdu": "اے بہت صبر کرنیوالے",
     "Translation English": "Ya Sabur: O Patient"
    },
    {
     "ID": 193,
     "Arabic": "يَاصَبُوْرُ",
     "Translation Urdu": "اے بہت صبر کرنیوالے",
     "Translation English": "Ya Sabur: O Patient"
    },
    {
     "ID": 194,
     "Arabic": "يَاصَادِقُ",
     "Translation Urdu": "اے سچّے",
     "Translation English": "Ya Saddiqu: O Truthful"
    },
    {
     "ID": 195,
     "Arabic": "يَاسَتَّارُ",
     "Translation Urdu": "اے پردہ کرنیوالے",
     "Translation English": "Ya Sattaru: O Concealer"
    },
    {
     "ID": 196,
     "Arabic": "يَا  مَنْ  تَقَدَّسَتْ  عَنِ  الْاشْبَاهِ  ذَاتُهٗ",
     "Translation Urdu": "اے وہ خدا جس کی ذات ہم شکل ہونے سے پاک ہے",
     "Translation English": "O He whose essence is sanctified from any resemblance."
    },
    {
     "ID": 197,
     "Arabic": "وَ  تَنَزَّهَتْ  عَنْ  مُشَابَهَةِ  الْاَمْثَالِ  صِفَاتُهٗ",
     "Translation Urdu": "اور جس کی صفتیں مثل ہونے سے پاک اور منزّہ ہیں",
     "Translation English": "And He is far removed from any similarity to the created beings in His attributes."
    },
    {
     "ID": 198,
     "Arabic": "يَا  مَنْ  دَلَّتْ  عَلٰى  وَحْدَانِيَّتِهٖ  اٰيَاتُهٗ  وَ  شَهِدَتْ  بِرَبُوْبِيَّتِهٖ  مَصْنُوْعَاتُهٗ",
     "Translation Urdu": "اور اے وہ خدا جس کے ایک ہونے پر اس کی نشانیاں دلالت کرتی ہیں اور اس کی بنائی ہوئی چیزیں اس کے پروردگار ہونے پر گواہ ہیں",
     "Translation English": "O, the One whose signs indicate His unique oneness, and whose creations bear witness to His Lordship."
    },
    {
     "ID": 199,
     "Arabic": "وَاحِدٌ  لَّا  مِنْ  قِلَّةٍ  وَّ  مَوْجُوْدٌ  لَّا  مِنْ  عِلَّةٍ",
     "Translation Urdu": "وہ ایک ہے (مگر) کسی کمی کی وجہ سے نہیں اور موجود ہے (مگر) کسی علّت سے نہیں",
     "Translation English": "O, the One who is not limited by scarcity, and the Existing who is not contingent on a cause."
    },
    {
     "ID": 200,
     "Arabic": "يَا  مَنْ  هُوَ  بِلْبِرِّ  مَعْرُوْفٌ  وَّ  بِالْاِحْسَانِ  مَوْصُوْفٌ  مَّۢعْرُوْفٌ  بِۢلَاْ  غَايَةٍ  وَّ  مَوْصُوْفٌ  بِۢلَاْ  نِهَايَةٍ",
     "Translation Urdu": "اے وہ خدا جو نیکی میں مشہور ہے اور احسان (کی صفت) سے موصوف ہے جس کی مشہوری کی کوئی حد نہیں اور (وہ) بے انتہا تعریف کیا گیا ہے",
     "Translation English": "O, the one whose benevolence is known and whose kindness is described, known with no limit and described with no end."
    },
    {
     "ID": 201,
     "Arabic": "اَوَّلٌ  قَدِيْمٌ  بِۢلَاْ  اِبْتِدَاءٍ  وَّ  اٰخِرٌ  كَرِيْمٌ  بِۢلَاْ  اِنْتِهَآءٍ",
     "Translation Urdu": "(وہ) ابتدا کے بغیر پہلا اور ازلی و ابدی ہے اور بغیر انتہا کے سب سے اخیر اور سخی ہے",
     "Translation English": "O, the First with no beginning and the Last with no end, the Generous with no limit."
    },
    {
     "ID": 202,
     "Arabic": "وَّغَفَرَ  ذَنُوْبَ  الْمُذْنِبِيْنَ  كَرَمً  وَّ  حِلْماً  يَا  مَنْ  لَّيْسَ  كَمِثْلِهٖ  شَىْءٌ  وَّ هُوَ  السَّمِيْعُ  الْبَصِيْرُ",
     "Translation Urdu": "اور اس نے گناہ گاروں کے گناہ اپنے کرم اور بردباری سے معاف کردیئے۔ اے وہ ذات جس کے مثل کوئی چیز نہیں اور وہ (خدا) بہت سننے اور دیکھنے والا ہے",
     "Translation English": "O, who forgives the sins of the sinners out of generosity and forbearance. There is nothing like Him, and He is the All-Hearing, the All-Seeing."
    },
    {
     "ID": 203,
     "Arabic": "حَسْبُنَا  اللّٰهُ  وَ  نِعْمَ  الْوَكِيْلُ  نِعْمَ  الْمَوْلٰى  وَ  نِعْمَ  النَّصِيْرُ",
     "Translation Urdu": "ہمیں اللہ کافی ہے اور (وہ) اچھا کارساز ہے اچھا آقا ہے اور کیا خوب مددگار ہے",
     "Translation English": "Sufficient for us is Allah, and [He is] the best Disposer of affairs. He is the best Master, and the best Helper."
    },
    {
     "ID": 204,
     "Arabic": "يَا  دَآئِمًا  بِۢلَاْ  فَنَآءٍ  وَّ  يَا  قَآئِمًا  بِۢلَاْ  زَوَالٍ  وَ  يَا  مُدَبِّرًا  بِۢلَاْ  وَزِيْر",
     "Translation Urdu": "اے فنا کے بغیر ہمیشہ رہنے والے اور اے زوال کے بغیر قائم رہنے والے اور اے وزیر کے بغیر تدبیر کرنے والے",
     "Translation English": "O Everlasting One, without fading away, O Eternal One, without vanishing, O Administrator, without any assistant."
    },
    {
     "ID": 205,
     "Arabic": "سَهِّلْ  عَلَيْنَا  وَ  عَلٰى  وَالِدَيْنَا  كُلَّ  عَسِيْرٍ",
     "Translation Urdu": "آسان کر ہم پر اور ہمارے ماں باپ پر ہر مشکل کو",
     "Translation English": "Facilitate for us and for our parents every hardship."
    },
    {
     "ID": 206,
     "Arabic": "لَّآ  اُحْصِىْ  ثَنَآءً  عَلَيْكَ  اَنْتَ  كَمَآ  اَثْنَيْتَ  عَلٰى  نَفْسِكَ  عَزَّ  جَارُكَ  وَجَلَّ  ثَنَآؤُكَ",
     "Translation Urdu": "میں تیری تعریف کا شمار نہیں کر سکتا ہوں۔ تو ایسا ہے جیسا کہ تو نے خود اپنی ذات کی صفات بیان کی ہیں۔ غالب ہے وہ جو تیری پناہ میں آئے اور تیری تعریف سب سے برتر ہے",
     "Translation English": "I cannot enumerate Your praises; You are as You have praised Yourself. Glory is to You; Your neighbors are not equivalent to Your glory, and Your praises are majestic."
    },
    {
     "ID": 207,
     "Arabic": "وَ  تَقَدَّسَتْ  اَسْمَآؤُكَ  وَ  عَظُمَ  شَأْنُكَ  وَلَآ  اِلٰهَ  غَيْرُكَ",
     "Translation Urdu": "اور بہت پاکیزہ ہیں تیرے نام اور تیری شان بلند ہے اور تیرے بغیر کوئی معبود نہیں",
     "Translation English": "Your names have been sanctified, and Your status is magnified. There is no deity other than You."
    },
    {
     "ID": 208,
     "Arabic": "يَفْعَلُ  اللّٰهُ  مَا  يَشَآءُ  بِقُدْرَتِهٖ  وَ  يَحْكُمُ  مَا  يُرِيْدُ  بِعِزَّتِهِ",
     "Translation Urdu": "اللہ جو چاہتا ہے کرتا ہے اپنی قدرت سے اور اپنی قوت اور غلبہ سے جو چاہتا ہے حکم دیتا ہے",
     "Translation English": "Allah does what He wills by His power, and He judges as He desires by His might."
    },
    {
     "ID": 209,
     "Arabic": "اَلَآ  اِلَى  اللّٰهِ  تَصِيْرُ  الْاُمُوْرُ  كُلُّ  شَئٍ  هَالِكٌ  اِلَّا  وَجْهَهٗ",
     "Translation Urdu": "خبردار ۔ اللہ کی طرف ہی سب چیزیں لوٹتی ہیں۔ اس کی ذات کے سوا ہر چیز فنا ہونے والی ہے",
     "Translation English": "ll matters will ultimately return to Allah. Everything is perishable except His countenance"
    },
    {
     "ID": 210,
     "Arabic": "لَهُ  الحُكْمُ  وَاِلَيْهِ  تُرْجَعُوْنَ",
     "Translation Urdu": "اور اسی کی طرف تم لوٹائے جاؤ گے",
     "Translation English": "Judgment belongs to Him, and to Him you will be returned."
    },
    {
     "ID": 211,
     "Arabic": "فَسَيَكْفِيْكَهُمُ  اللّٰهُ  وَ  هُوَ  السَّمِيْعُ  الْعَلِيْمُ",
     "Translation Urdu": "پس جلد ہی آپ کو (اے محمدؐ) اللہ تعالیٰ ان (منافقوں) سے کفایت کرے گا وہ بہت سننے اور جاننے والا ہے",
     "Translation English": "Allah is sufficient for you, and He is the All-Hearing, All-Knowing"
    },
    {
     "ID": 212,
     "Arabic": "حَسْبُنَا  اللّٰهُ  وَكَفٰى  سَمِعَ  اللّٰهُ  لِمَنْ  دَعَا وَ لَيْسَ  وَرَآءَ  اللّٰهِ  الْمُنْتَهٰى  مَنِ  اعْتَصَمَ  بِااللّٰهِ  فَقَدْ  نَجٰى",
     "Translation Urdu": "اللہ ہمارے لیے کافی ہے۔ خدا نے اس کی سن لی جس نے اس کو پکارا۔ خدا کے بعد لوگوں کی مرادوں کی اور کہیں انتہا نہیں جس شخص نے اللہ کا دامن پکڑا وہ نجات پاگیا",
     "Translation English": "Allah hears the one who calls upon Him, and there is nothing beyond Allah's reach. Whoever holds fast to Allah has truly attained salvation."
    },
    {
     "ID": 213,
     "Arabic": "سُبْحَانَ  مَنْ  لَّمْ  يَزَلْ  رَبَّا  رَّحِيْمًا  وَّ  لَا  يَزَالُ  كَرِيْماً",
     "Translation Urdu": "پاک ہے وہ ذات جو ہمیشہ سے رحم کرنے والا پروردگار ہے اور ہمیشہ سے سخی رہا ہے",
     "Translation English": "Glory be to the One who remains a compassionate Lord, continuously generous"
    },
    {
     "ID": 214,
     "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  الْحلِيْمُ  الْكَرِيْمُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں جو بردبار سخی ہے",
     "Translation English": "There is no deity except Allah, the Clement, the Generous."
    },
    {
     "ID": 215,
     "Arabic": "سُبْحَانَ  اللّٰهِ  وَتَبَارَكَ  اللّٰهُ  رَبُّ  السَّمٰوَاتِ  وَ  رَبُّ  الْعَرْشِ  الْعَظِيْمِ",
     "Translation Urdu": "اللہ پاک ہے اور بابرکت ہے اللہ جو سات آسمانوں اور عرش عظیم کا پالنے والا ہے",
     "Translation English": "Glory be to Allah, and blessed is Allah, the Lord of the heavens and the Lord of the mighty throne"
    },
    {
     "ID": 216,
     "Arabic": "وَالْحَمَدُ  لِلّٰهِ  رَبِّ  الْعٰلَمِيْنَ",
     "Translation Urdu": "اور تمام تعریفیں اللہ کے لئے ہیں جو تمام جہانوں کا پروردگار ہے",
     "Translation English": "All praise is due to Allah, the Lord of all worlds."
    },
    {
     "ID": 217,
     "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  وَحْدَهُ  لَا  شَرِيْكَ  لَهٗ  اِلٰهًا  وَّاحِدًا  اَحَدًا  صَمَدًا  فَرْدًا  وِّتْرًا  حَيًّا  قَيُّوْمًا  دَآئِمًا  اَبَدًا",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں، اکیلا ہے، اس کا کوئی شریک نہیں جو صفت اور ذات میں ایک ہے۔ بے نیاز، یگانہ اور طاق ہے۔ زندہ ہے قائم، دائم اور ہمیشہ رہنے والا",
     "Translation English": "There is no god but Allah, alone, without any partner. He is the only God, the Eternal, Absolute. He neither begets nor is born, and there is none comparable to Him. He is self-sufficient, and everything in the heavens and the earth depends on Him. He is the Ever-Living, the Sustainer of existence, and He is eternal."
    },
    {
     "ID": 218,
     "Arabic": "لَّمْ  يَتَّخِذْ  صَاحِبَةً  وَّلَا  وَلَدًا  وَّ  لَمْ  يَكُنْ  لَّهُ  شَرِيْكٌ  فِى  الْمُلْكِ  وَلَمْ  يَكُنْ  لَّهُ  وَلِىٌّ  مِّنَ  الذُّلِّ  وَكَبِّرْهُ  تَكُبِيْرًا",
     "Translation Urdu": "جس کی نہ بیوی ہے اور نہ اوالاد۔ جس کا ملک میں کوئی شریک نہیں ۔ جو کسی عیب یا کمزوری کے سبب مددگار کا محتاج نہیں ہے۔ اس خدا کی بڑائی بیان کرو",
     "Translation English": "He has not taken a wife or a son, and He has no partner in the dominion. He created everything and determined it precisely"
    },
    {
     "ID": 219,
     "Arabic": "اَللّٰهُ  اَكْبَرُ",
     "Translation Urdu": "اللہ بہت بڑا ہے",
     "Translation English": "Allah is the Greatest"
    },
    {
     "ID": 220,
     "Arabic": "حَسْبُنَا  اللّٰهُ  لِدِيْنِنَا",
     "Translation Urdu": "ہمیں ہمارے دین کے لیے کافی ہے",
     "Translation English": "\"Allah is sufficient for our religion.\""
    },
    {
     "ID": 221,
     "Arabic": "حَسْبُنَا  اللّٰهُ  لِدُنْيَانَا",
     "Translation Urdu": "اللہ ہمیں ہماری دنیا کے لئے کافی ہے",
     "Translation English": "\"Allah is sufficient for our worldly affairs.\""
    },
    {
     "ID": 222,
     "Arabic": "حَسْبُنَا  اللّٰهُ  لِمَا  اَهَمَّنَا",
     "Translation Urdu": "اللہ ہمیں ہماری مصیبت کے لئے کافی ہے",
     "Translation English": "\"Allah is sufficient for what concerns us.\""
    },
    {
     "ID": 223,
     "Arabic": "حَسْبُنَا  اللّٰهُ  لِمَنْ  بَۢغٰى  عَلَيْنَا",
     "Translation Urdu": "اللہ ہمیں اس شخص کے لئے کافی ہے جو ہم پر ظلم کرے",
     "Translation English": "\"Allah is sufficient against those who transgress against us.\""
    },
    {
     "ID": 224,
     "Arabic": "حَسْبُنَا  اللّٰهُ  لِمَنْ  حَسَدَنَا",
     "Translation Urdu": "اللہ ہمیں اس شخص کے لئے کافی ہے جو ہم سے حسد کرے",
     "Translation English": "\"Allah is sufficient against those who envy us.\""
    },
    {
     "ID": 225,
     "Arabic": "حَسْبُنَا  اللّٰهُ  لِمَنْ  كَادَنَا  بالسُّوْءِ",
     "Translation Urdu": "اللہ ہمیں اس شخص کے لئے کافی ہے جو ہمارے خلاف سازش کرے",
     "Translation English": "\"Allah is sufficient against those who plot evil against us.\""
    },
    {
     "ID": 226,
     "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  المَوْتِ",
     "Translation Urdu": "اللہ ہمیں موت کے وقت کافی ہے",
     "Translation English": "\"Allah is sufficient at the time of death.\""
    },
    {
     "ID": 227,
     "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  القَبْرِ",
     "Translation Urdu": "اللہ ہمیں قبر کے وقت کافی ہے",
     "Translation English": "\"Allah is sufficient at the grave.\""
    },
    {
     "ID": 228,
     "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  المَسَآئِلِ",
     "Translation Urdu": "اللہ ہمیں کافی ہے سوالوں کے وقت",
     "Translation English": "\"Allah is sufficient in matters of concern.\""
    },
    {
     "ID": 229,
     "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  الصِّرَاطِ",
     "Translation Urdu": "اللہ ہمیں پل صراط کے وقت کافی ہے",
     "Translation English": "\"Allah is sufficient at the Bridge (Sirat).\""
    },
    {
     "ID": 230,
     "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  الْحِسَابِ",
     "Translation Urdu": "اللہ ہمیں حساب کے وقت کافی ہے",
     "Translation English": "\"Allah is sufficient at the time of reckoning.\""
    },
    {
     "ID": 231,
     "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  المِيْزَانِ",
     "Translation Urdu": "اللہ ہمیں تولنے کے وقت کافی ہے",
     "Translation English": "\"Allah is sufficient at the Scale (Mizan).\""
    },
    {
     "ID": 232,
     "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  الجَنَّةِ  وَالنَّارِ",
     "Translation Urdu": "اللہ ہمیں جنّت اور جہنم میں جانےکے وقت کافی ہے",
     "Translation English": "\"Allah is sufficient at the entrance to Paradise and Hell.\""
    },
    {
     "ID": 233,
     "Arabic": "حَسْبُنَا  اللّٰهُ  عِنْدَ  اللِّقآءِ",
     "Translation Urdu": "اللہ ہمیں کافی ہے اللہ کے دیدار کے وقت",
     "Translation English": "\"Allah is sufficient at the time of meeting Him.\""
    },
    {
     "ID": 234,
     "Arabic": "حَسْبِىَ  اللّٰهُ  الَّذِىْ  لَآ  اِلٰهَ  اِلَّا  هُوَ  عَلَيْهِ  تَوَكَّلْتُ  وَ هُوَ  رَبُّ  الْعَرْشِ الْعَظِيْمِ",
     "Translation Urdu": "مجھے اللہ کافی ہے جس کے بغیر کوئی اور معبود نہیں اسی پر میں بھروسہ کرتا ہوں اور اسی کی طرف میں لوٹوں گا",
     "Translation English": "Allah is sufficient for me; there is no deity except Him. Upon Him I have relied, and He is the Lord of the Great Throne"
    },
    {
     "ID": 235,
     "Arabic": "لآ  اِلٰهَ  اِلَّا  اللّٰهُ  سُبْحٰنَ  اللّٰهِ  مَآ  اَعْظَمَ  اللّٰهُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں۔ سبحان اللہ (کلمہ تعجب) خدا کس قدر بڑا ہے",
     "Translation English": "There is no deity except Allah. Glory be to Allah. How great is Allah!"
    },
    {
     "ID": 236,
     "Arabic": "لَآ  اِلٰهَ  الَّا  اللّٰهُ  سُبْحٰنَ  اللّٰهِ  مَآ  اَحْلَمَ  اللّٰهُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں ۔ سبحان اللہ ۔ اللہ کس قدر بردبار ہے",
     "Translation English": "\"There is no deity except Allah. Glory be to Allah. How sublime is Allah!\""
    },
    {
     "ID": 237,
     "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  سُبْحٰنَ  اللّٰهِ  مَا  اَكْرَمَ  اللّٰهُ",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں۔ سبحان اللہ ۔ اللہ کس قدر بزرگ ہے",
     "Translation English": "\"There is no deity except Allah. Glory be to Allah. How generous is Allah!\""
    },
    {
     "ID": 238,
     "Arabic": "لَآ  اِلٰهَ  اِلَّا  اللّٰهُ  وَحْدَهٗ  لَا  شَرِيْكَ  لَهٗ  مُحَمَّدٌ  رَّسُوْلُ  اللّٰهِ  حَقًا",
     "Translation Urdu": "اللہ کے بغیر کوئی اور معبود نہیں۔ وہ ایک ہے اس کا کوئی شریک نہیں۔ (حضرت) محمدؐ سچّے طور اللہ کے بیغمبر ہیں",
     "Translation English": "\"There is no deity except Allah, alone, without any partner. Muhammad is the Messenger of Allah, truly.\""
    },
    {
     "ID": 239,
     "Arabic": "اَللّٰهُمَّ  صَلِّ  عَلٰى سَيِّدِنَا  مُحَمَّدٍ وَ عَلٰى اٰلِ سَيِّدِنَا  مُحَمَّدٍ كُلَّمَا  ذَكَرَهُ  الذَّاكِرُوْنَ",
     "Translation Urdu": "اے میرے اللہ درود بھیج (حضرت) محمدؐ پر اور (حضرت) محمدؐ کی آل پر جب جب کہ ذکر کرنے والے آپ کا ذکر کریں",
     "Translation English": "O Allah, bless our master Muhammad and his family whenever he is remembered by those who remember."
    },
    {
     "ID": 240,
     "Arabic": "وَ  صَلِّ  عَلٰى سَيِّدِنَا  مُحَمَّدٍ وَ عَلٰى اٰلِ سَيِّدِنَا  مُحَمَّدٍ  كُلَّمَا  غَفَلَ  عَنْ  ذِكْرِهِ  الغَافِلُوْنَ",
     "Translation Urdu": "اور درود بھیج (حضرت) محمدؐ پر جب جب کہ غافل لوگ آپ کے ذکر سے غفلت کریں",
     "Translation English": "\"O Allah, bless our master Muhammad and his family whenever he is neglected by those who neglect.\""
    },
    {
     "ID": 241,
     "Arabic": "رَضِيْنَا  بِاللّٰهِ  تَعَالٰى  رَبًّا  وَّ  بِالْاِسْلامِ  دِيْنًا  وَّ  سَيِّدِنَا  مُحَمَّدٍ  صَلَّى  اللُّٰهُ  عَلَيْهِ  وَسَلَّمَ  نَبِيًّا  وَّ  رَسُوْلًا",
     "Translation Urdu": "۔ ہم اللہ تعالیٰ سے راضی ہیں کہ وہ ربّ ہے اور اسلام سے کہ وہ دین ہے اور (حضرت ) محمد صلی اللہ علیہ وسلم سے کہ وہ نبی اور رسول ہیں",
     "Translation English": "\"We are pleased with Allah as our Lord, Islam as our religion, and Muhammad, may Allah's peace and blessings be upon him, as our Prophet and Messenger.\""
    },
    {
     "ID": 242,
     "Arabic": "وَ  بِا  لْقُرْاٰنِ  اِمَامًا  وَّ  بِالْكَعْبَةِ  قِبْلَةً  وَّ  بِالصَّلوٰةِ  فَرِيْضَةً",
     "Translation Urdu": "او رقرآن سے کہ وہ راہنما ہے اور کعبہ سے کہ وہ ہمارا قبلہ ہے اور نماز سے کہ وہ ہم پر فرض ہے",
     "Translation English": "We take the Quran as our guide, the Kaaba as our direction in prayer, and prayer as our obligatory duty.\""
    },
    {
     "ID": 243,
     "Arabic": "وَّبِالْمُؤْمِنِيْنَ  اِخْوَانًا  وَ  بسَيِّدِنَا اِلصِّدِّيْقِ  وَ  سَيِّدِنَا الْفَارُوْقِ  وَ  سَيِّدِنَا ذِى النُّوْرَيْنِ  وَ  سَيِّدِنَا الْمُرْتَضٰى  اَئِمَّةً  الْهُدَاْ  رِضْوَانُ  اللّٰهِ  تَعَالٰى  عَلَيْهِمْ  اَجْمَعِيْنْ",
     "Translation Urdu": "اور مومنوں سے کہ وہ (ہمارے ) بھائی ہیں اور حضرت ابوبکر صدیقؓ اور حضرت عمر فاروقؓ، حضرت عثمانؓ ذو النورین اور حضرت علی المرتضیٰؓ سے کہ وہ (ہمارے) پیشوا ہیں۔ ان سب پر اللہ تعالیٰ کی رضامندیاں ہوں",
     "Translation English": "And we consider the believers as our brothers, and our leaders are the Truthful, the Trustworthy, the Possessor of the Two Lights, the Chosen One, the Imams of guidance. May Allah be pleased with all of them.\""
    },
    {
     "ID": 244,
     "Arabic": "مَرْحَبًا  بِۢالصَّبَاحِ  الْجَدِيْدِ  وَ  بِالْيَوْمِ  السَّعِيْدِ  وَبِالْمَلَكَيْنِ  الْكَاتِبَيْنِ  الشَّاهِدَيْنِ  العَادِلَيْنِ",
     "Translation Urdu": "مبارک ہو نئی صبح اور اچھا دن اور مبارک ہو ہمارے اعمال لکھنے والے دہ فرشتوں کو جو عدل و انصاف والے گواہ ہیں",
     "Translation English": "Welcome to the new morning, to the blessed day, and to the two angels, the recorders, the witnesses, the just ones.\""
    },
    {
     "ID": 245,
     "Arabic": "حَيَّا كُمَا  اللّٰهُ  تَعَالٰى  فِى  غُرَّةِ  يَوْمِنَا  هٰذَا  اكْتُبَا  فِى  اوَّلِ  صَحِيْفَتِنَا",
     "Translation Urdu": "اللہ تم دونوں کو اپنے سلام کے تحفے ہمارے اس دن کے آغاز میں عنایت کرے۔ ہمارے نامئہ اعمال کے پہلے صفحہ میں لکھئ",
     "Translation English": "\"Live today as Allah, the Most High, in the beginning of our day, has ordained you to live.\""
    },
    {
     "ID": 246,
     "Arabic": "بِسْمِ  اللّٰهِ  الرَّحْمٰنِ  الرَّحِيْمِ",
     "Translation Urdu": "اللہ کے نام سے جو نہایت مہربان اور رحم والا ہے",
     "Translation English": "\"In the name of Allah, the Most Gracious, the Most Merciful.\""
    },
    {
     "ID": 247,
     "Arabic": "وَ اَشْهَدُ  اَنْ  لَّآ  اِلٰهَ  اِلَّا  اللّٰهُ  وَحْدَهٗ  لَا  شَرِيْكَ  لَهٗ  وَاَشْهَدُ  اَنَّ  مُحَمَّدًا  اعَبْدَهٗ  وَ  رَسُوْلُهٗ",
     "Translation Urdu": "اور تم (دونوں) گواہ ہو کہ ہم گواہی دیتے ہیں کہ اللہ کے بغیر کوئی اور معبود نہیں، وہ ایک ہے۔ اس کوئی شریک نہیں اور ہم گواہی دیتے ہیں کہ (حضرت محمدؐ) اس (اللہ) کے بندے اور رسول ہیں",
     "Translation English": "\"I bear witness that there is no deity except Allah, alone, without any partner, and I bear witness that Muhammad is His servant and Messenger.\""
    },
    {
     "ID": 248,
     "Arabic": "اَرْسَلَهٗ  بِالْهُدٰى  وَ  دِيْنِ  الْحَقِّ  لِيُظْهِرَهُ  عَلَى  الدِّيْنِ  كُلِّهِ  وَلَوْ  كَرِهَ  المُشْرِكُوْنَ",
     "Translation Urdu": "جنھیں اللہ نے ہدایت (قرآن) اور سچّے دین (اسلام) کے ساتھ بحھیجا ہے تاکہ وہ اس (اسلام) کو باقی تمام دینوں پر غالب کر دے۔ اگر چہ مشرک لوگ اسے ناپسند ہی کریں",
     "Translation English": "\"He sent him with guidance and the true religion to make it prevail over all religions, even if the disbelievers dislike it.\""
    },
    {
     "ID": 249,
     "Arabic": "علٰى  هٰذِهِ  الشَّهَادةِ  نَحْيٰ  وَ  عَلَيْهَا  نَمُوْتُ  وَ  عَلَيْهَا  نُبْعَثُ",
     "Translation Urdu": "اسی شہادت پر ہم زندہ ہیں اور اسی پر ہم مریں گے۔ اور اسی پر ہم قیامت کے دن اٹھائے جائیں گے",
     "Translation English": "\"By this testimony, we live, and upon it, we die, and unto it, we will be resurrected.\""
    },
    {
     "ID": 250,
     "Arabic": "اِنْ  شَآءَ  اللّٰهُ  تَعَالٰى  اَعُوْذُ  بِكَلِمٰتِ  اللّٰهِ  التَّآمَّاتِ  كُلِّهَا  مِنْ  شَرِّ  مَا خَلَقَ",
     "Translation Urdu": "انشاء اللہ تعالیٰ میں اللہ تعالیٰ کے ان پورے اور تمام کلمات کے ساتھ مخلوق کے شر سے پناہ مانگتا ہوں",
     "Translation English": "\"If Allah wills, I seek refuge in Allah's perfect words from the evil of what He has created.\""
    },
    {
     "ID": 251,
     "Arabic": "بِسْمِ  اللّٰهِ  خَيْرِ  الْاَسْمَآءِ",
     "Translation Urdu": "اللہ کے نام سے جو تمام ناموں سے بہتر ہے",
     "Translation English": "\"In the name of Allah, the best of names.\""
    },
    {
     "ID": 252,
     "Arabic": "بِسْمِ  اللّٰهِ  رَبِّ  الْاَرْضِ  وَ  رَبِّ  السَّمَآءِ",
     "Translation Urdu": "اللہ کے نام سے جو زمین اور آسمان کا رب ہے",
     "Translation English": "\"In the name of Allah, the Lord of the earth and the heavens.\""
    },
    {
     "ID": 253,
     "Arabic": "بِسْمِ  اللّٰهِ  الَّذِىْ  لَا  يَضُرُّ  مَعَ  اِسْمِهِ  شَىْءٌ  فِىْ  الْاَرْضِ  وَ لَا  فِى  السَّمَآءِ  وَ  هُوَ  السَّمِيْعُ  الْعَلِيْمُ",
     "Translation Urdu": "اللہ کے نام سے جس کا نام لے کر کوئی چیز نقصان نہیں پہنچا سکتی نہ زمین میں اور نہ آسمان میں وہ بہت سننے اور جاننے والا ہے",
     "Translation English": "\"In the name of Allah, with whose name nothing in the earth or heavens can cause harm, and He is the All-Hearing, the All-Knowing.\""
    },
    {
     "ID": 254,
     "Arabic": "اَلْحَمْدُ  لِلّٰهِ  الَّذِىْ  اَحْيَانَا  بَعْدَ  مَا  اَمَاتَنَا  وَ  اِلَيْهِ  الْبَعْثَ  وَ  النُّشُوْرُ  اَصْبَحْنَا",
     "Translation Urdu": "تمام تعریفیں ہیں اس اللہ کے لئے جس نے ہمیں مارنے کے بعد زندہ کیا اور قیامت کے دن قبروں سے اٹھ کر اسی کی طرف لوٹنا ہے",
     "Translation English": "\"All praise is due to Allah, who revived us after He caused us to die, and to Him is the resurrection.\""
    },
    {
     "ID": 255,
     "Arabic": "وَ  اَصْبَحَ  الْمُلْكُ  لِلّٰهِ  الْعِزَّةُ  وَالْعَظْمَةُ  وَالْكِبْرِيَآءِ  والْجَبَرُوْتُ",
     "Translation Urdu": "ہم نے اور تمام ملک نے اللہ کے فضل و کرم سے صبح کی اور قوّت، عظمت، بڑائی و بزرگی اور طاقت",
     "Translation English": "\"And the dominion belongs to Allah, the Mighty, the Exalted, the Majestic, the Powerful, the Sovereign, and the Evident Proof. All the goodness and blessings belong to Allah, and the night and the day belong to Allah.\""
    },
    {
     "ID": 256,
     "Arabic": "وَالسَّلْطَانُ  والْبُرْهَانُ  لِلّٰهِ  والْاٰلٰآءُ  وَالنَّعْمَآءُ  لِلّٰهِ  وَالَّيْلُ  وَالنَّهَارُ  لِلّٰهِ",
     "Translation Urdu": "اور بادشاہت اور روشن دلیلیں اللہ ہی کو شایان ہیں۔ تمام ظاہری اور باطنی نعمتیں اللہ ہی کی طرف سے ہیں۔ رات اور دن اللہ کی مخلوق ہیں اور جو چیزیں رات دن میں داخل ہیں",
     "Translation English": "\"And whatever dwells in them belongs to Allah, the One, the Irresistible.\""
    },
    {
     "ID": 257,
     "Arabic": "وَمَا  سَكَنَ  فِيْهِمَا  لِلّٰهِ  الْوَاحِدِ  الْقَهَّارِ",
     "Translation Urdu": "وہ بھی خدائے واحد و قہار کی مخلوق ہیں",
     "Translation English": "\"We have entered this morning upon the fitrah (natural disposition) of Islam, the word of sincerity, and upon the religion of our master and Prophet Muhammad, the Chosen One, peace and blessings be upon him.\""
    },
    {
     "ID": 258,
     "Arabic": "اَصْبَحْنَا  عَلٰى  فِطْرَةِ  الْاِسْلَامِ  وَكَلِمَةِ  الْاِخْلَاصِ  وَ  عَلٰى  دِيْنِ سَيِّدِنَاْ  وَنَبِيِّنَا  مُحَمَّدِ نِ الْمُصْطَفٰى  صَلَّى  اللّٰهُ  عَلَيْهِ  وَسَلَّمَ",
     "Translation Urdu": "ہم نے دین فطرت اسلام پر صبح کی اور کلمہ توحید پر اور اپنے پیغمبر (حضرت ) محمدؐ کے دین پر",
     "Translation English": "\"And upon the religion of our father Abraham, who was a true monotheist, a Muslim, and not one of the polytheists.\""
    },
    {
     "ID": 259,
     "Arabic": "وَ  عَلٰى  مِلَّةِ  اَبِيْنَا  اِبْرَاهِيْمَ  عَلَيْهِمُ  السَّلَاٰمُ حَنِيْفًا  مُّسْلِمًا  وَ  مَا  كَانَ  مِنَ  الْمُشْرِكِيْنَ",
     "Translation Urdu": "اور اپنے باپ حضرت ابراہیم علیہ السلام کی منّت حنیفہ پر۔ جو خالص موحد ومسلم تھے، مشرکوں میں سے نہیں تھ",
     "Translation English": "\"May Allah's blessings and peace be upon our master Muhammad, his family, his companions, and all of his followers.\""
    },
    {
     "ID": 260,
     "Arabic": "صَلَوَاتُ  اللّٰهِ  وَ  مَلٰٓئِكَتِهٖ  وَ  اَنْۢبِيَآئِهٖ  وَ  رُسُلِهٖ  وَ  حَمَلَةِ  عَرْشِهٖ  وَ  جَمِيْعِ  خَلْقِهٖ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ  وَ اٰلِهٖ  وَ  اَصْحَابِهٖ  عَلَيْهِ  وَ  عَلَيْهِمُ  السَّلاٰمُ  وَ  رَحْمَةُ  اللّٰهِ  وَ  بَرَكٰاتُهُ",
     "Translation Urdu": "درود رحمتیں ہوں اللہ تعالیٰ کی ، اس کے فرشتوں اور پیغمبروں کی اس کے رسولوں اور اس کا عرش اٹھانے والوں اور اس کی تمام مخلوق کی ہمارے سردار حضرت محمدؐ اور ان کی اولاد پر اور ان کے صحابہ کرامؓ پر، آپؐ پر اور آپؐ کے اصحاب پر سلام، اللہ کی رحمت اور اس کی برکتیں ہوں",
     "Translation English": "Allah's blessings, the angels' and His messengers', and the prayers of those who carry His Throne, and all of His creation, be upon our master Muhammad, his family, his companions, peace be upon them, and mercy and blessings of Allah.\""
    },
    {
     "ID": 261,
     "Arabic": "اَلصَّلوٰةُ  وَالسَّلَامُ  عَلَيْكَ يَاسَيِّدِىْ يَا  رَسُوْلَ  اللّٰهِ",
     "Translation Urdu": "درود سلام ہو آپ پر اے خدا کے رسول",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O Messenger of Allah.\""
    },
    {
     "ID": 262,
     "Arabic": "الصَّلوٰةُ  وَالسَّلَامُ  عَلَيْكَ يَاسَيِّدِىْ يَا  حَبِيْبَ  اللّٰهِ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے اللہ کے محبوب",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O Beloved of Allah.\""
    },
    {
     "ID": 263,
     "Arabic": "اَلصَّلوٰةُ  والسَّلَامُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  خَلِيْلَ  اللّٰهِ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے اللہ کے دوست",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O Friend of Allah.\""
    },
    {
     "ID": 264,
     "Arabic": "اَلصَّلوٰةُ  وَالسَّلَامُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  نَبِىَّ  اللّٰهِ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے اللہ کے نبی",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O Prophet of Allah.\""
    },
    {
     "ID": 265,
     "Arabic": "اَلصَّلوٰةُ  والسَّلَامُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  صَفِىَّ  اللّٰه",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے خدا کے برگزیدہ",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O Prophet of Allah.\""
    },
    {
     "ID": 266,
     "Arabic": "اَلصَّلوٰةُ  والسَّلَامُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  خَيْرَ  خَلْقِ  اللّٰهِ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے تمام خلقِ خدا سے بہتر",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O Best of Allah's creation.\""
    },
    {
     "ID": 267,
     "Arabic": "اَلصَّلوٰةُ  وَالسَّلٰامُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنِ  اخْتَارَهُ  اللّٰهِ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اےوہ ذات جسے خدا نے پسند کیا ہے",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O the one whom Allah has chosen.\""
    },
    {
     "ID": 268,
     "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنْ  اَرْسَلَهُ  اللّٰهِ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے وہ ذات جسے اللہ نے رسول بنا کر بھیجا",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O the one whom Allah has sent.\""
    },
    {
     "ID": 269,
     "Arabic": "اَلصَّلوٰةُ  وَالسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنْ  زَيَّنَهُ  اللّٰهُ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے وہ ذات جسے خدا نے زینت دی ہے",
     "Translation English": "Salutations and peace be upon you, O my Master, O the one whom Allah has adorned.\""
    },
    {
     "ID": 270,
     "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنْ  شَرَّفَهُ  اللّٰهُ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے وہ ذات جسے خدا نے مشّرف بنایا ہے",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O the one whom Allah has honored.\""
    },
    {
     "ID": 271,
     "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنْ  كَرَّمَهُ  اللّٰهُ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے وہ ذات گرامی جسے خدا نے عزت بخشی ہے",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O the one whom Allah has favored.\""
    },
    {
     "ID": 272,
     "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  مَنْ  عَظَّمَهُ  اللّٰهُ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے وہ ذات بابرکت جسے خدا نے عظیم بنایا ہے",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O the one whom Allah has exalted.\""
    },
    {
     "ID": 273,
     "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  سَيِّدَ  الْمُرْسَلِيْنَ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے پیغمبروں کے سردار",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O the Leader of the Messengers.\""
    },
    {
     "ID": 274,
     "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  اِمَامَ  الْمُتَّقِيْنَ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے تمام پرہیزگاروں کے پیشوا",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O the Imam of the God-fearing.\""
    },
    {
     "ID": 275,
     "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  خَاتِمَ  النَّبِيِّيْنَ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے تمام نبیوں کے بعد آنے والے",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O the Seal of the Prophets.\""
    },
    {
     "ID": 276,
     "Arabic": "اَلصَّلوٰةُ  والسَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  شَفِيْعَ  الْمَذْنِبِيْنَ  (3)",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے گناہ گاروں کی سفارش کرنے والے -۳ بار-",
     "Translation English": "\"Salutations and peace be upon you, O my Master, O the Intercessor for the sinners"
    },
    {
     "ID": 277,
     "Arabic": "اَلصَّلوٰةُ  وَ  السَّلاٰمُ  عَلَيْكَ  يَاسَيِّدِىْ يَا  رَحْمَةً  الِّلْعٰلَمِيْنَ  اَلصَّلوٰةُ  وَ  السَّلاٰمُ  عَلَيْكَ يَاسَيِّدِىْ  يَا  رَسُوْلَ  رَبِّ  الْعٰلَمِيْنَ",
     "Translation Urdu": "درود اور سلام ہو آپ پر اے تمام جہانوں کے پروردگار کے پیغمبر",
     "Translation English": "Salutations and peace be upon you, O my Master, O the Mercy for all the worlds. Salutations and peace be upon you, O my Master, O the Messenger of the Lord of the worlds.\""
    },
    {
     "ID": 278,
     "Arabic": "صَلَوَاتُ  اللّٰهِ  تَعَالٰى  وَ  مَلٰئِكَتِهٖ  وَ  اَنْۢبِيَآئِهٖ  وَ  رُسُلِهٖ  وَ  حَمَلَةَ  عَرْشِهٖ  وَ  جَمِيْعَ  خَلْقِهٖ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ",
     "Translation Urdu": "درود ہوں اللہ تعالیٰ کے اس کے فرشتوں کے اور اسے نبیوں اور رسولوں کے اس کا عرش اٹھانے والوں کے اور اس کی ساری مخلوقات کے، ہمارے سردار (حضرت) محمدؐ پر",
     "Translation English": "May the blessings of Allah, His angels, His prophets, His messengers, those who carry His Throne, and all of His creation be upon our master Muhammad"
    },
    {
     "ID": 279,
     "Arabic": "وَ عَلٰى اٰلِهٖ  وَ  اَصْحَابِهٖ  اَجْمَعِيْنَ  عَلَيْهِ  وَ  عَلَيْهِمُ  السَّلاٰمُ  وَ  رَحْمَةُ  اللّٰهِ  وَ  بَرَكَاتُهُ",
     "Translation Urdu": "آپؐ کی اولاد اور آپؐ کے اصحاب پر۔ آپؐ پر اور ان سب اصحاب پر سلا م اور اس کی رحمت اور اس کی برکتیں ہوں",
     "Translation English": "\"And upon his family and all of his companions, all together. Peace and blessings of Allah be upon him and upon them.\""
    },
    {
     "ID": 280,
     "Arabic": "اللّٰهُمَّ  صَلِّ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ  فِىْ  الْاَوَّلِيْنَ",
     "Translation Urdu": "۔ اے میرے اللہ ہمارے سردار (حضرت) محمدؐ پر درود بھیج ہم سے پہلے لوگوں میں",
     "Translation English": "\"O Allah, send blessings upon our master Muhammad among the early generations,\""
    },
    {
     "ID": 281,
     "Arabic": "وَ  صَلِّ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ  فِى  الْاٰخِرِيْنَ",
     "Translation Urdu": "اور درود بھیج ہمارے سردار (حضرت) محمدؐ پر ہمارے بعد آنے والے لوگوں میں",
     "Translation English": "\"And send blessings upon our master Muhammad among the later generations.\""
    },
    {
     "ID": 282,
     "Arabic": "و  صَلِّ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ  فِى  الْمَلَآءِ  الْاَعْلٰى  اِلٰى  يَوُمِ  الدِّيْنِ",
     "Translation Urdu": "اور درود بھیج ہمارے سردار (حضرت) محمدؐ پر ملائکہ مقربین میں قیامت کے دن تک",
     "Translation English": "\"And send blessings upon our master Muhammad in the highest company until the Day of Judgment.\""
    },
    {
     "ID": 283,
     "Arabic": "وَ  صَلِّ  عَلٰى  سَيِّدِنَا  مُحَمَّدٍ  فِى  كُلِّ  وَقْتٍ  وَّحِيْنٍ",
     "Translation Urdu": "اور درود بھیج ہمارے سردار (حضرت ) محمدؐ پر ہر وقت اور ہر گھڑی میں",
     "Translation English": "\"And send blessings upon our master Muhammad at all times and in every circumstance.\""
    },
    {
     "ID": 284,
     "Arabic": "وَّ  صَلِّ  عَلٰى  جَمِيْعِ  الْاَنْۢبِيَآءِ  وَالْمُرْسَلِيْنَ  وَ  عَلٰى  مَلٰئِكَتِكَ  المُقَرَّبِيْنَ",
     "Translation Urdu": "اور درود بھیج تمام نبیوں پر اور رسولوں پر اور اپنے تمام مقرّب فرشتوں پر",
     "Translation English": "\"And send blessings upon all the prophets and messengers, and upon your close angels.\""
    },
    {
     "ID": 285,
     "Arabic": "وَ  عَلٰى  عِبَادِكَ  الصّٰلِحِيْنَ  وَ  عَلٰى  اَهْلِ  طَاعَتِكَ  اَجْمَعِيْنَ  والرّْحَمْنَا  مَعَهُمْ  بِرَحْمَتِكَ  يَااَرْحَمَ  الرَّاحِمِيْنَ",
     "Translation Urdu": "اور اپنے تمام نیک بندوں پر اور اپنے سب اطاعت گزار بندوں پر اور ہم پر رحم کر ان کے ساتھ اپنی مہربانی سے اے تمام رحم کرنیوالوں میں سب سے زیادہ رحم کرنیوالے",
     "Translation English": "\"And upon Your righteous servants, and all those who obey You, collectively. And may Your mercy be with them, O Most Merciful of the merciful.\""
    },
    {
     "ID": 286,
     "Arabic": "دُعاءِ  رِقَابْ",
     "Translation Urdu": "دعاءِ رقاب",
     "Translation English": "Dua 'i riqab"
    },
    {
     "ID": 287,
     "Arabic": "بِسْمِ  اللّٰهِ  الرَّحْمٰنِ  الرَّحِيْمٌ",
     "Translation Urdu": "میں اللہ کے نام سے شروع کرتا ہوں جو بہت مہربان اور رحم والا ہے",
     "Translation English": "In the name of Allah, the Most Gracious, the Most Merciful.\""
    },
    {
     "ID": 288,
     "Arabic": "اَللّٰهُمَّ  يا  مَالِكَ  الرِّقَابِ  وَ  يَا  مُفَتِّحَ  الْاَبْواْبِ  وَ  يَا  مُسَبِّبَ  الْاَسْبَابِ  هَيِّئْ  لَنَا  سَبَبًا  لَّا  نَسْتَطِيْعُ  لَهٗ  طَلَبًا",
     "Translation Urdu": "اے اللہ ۔ اے گردنوں کے مالک اے رحمت کے دروازے کھولنے والے اور اے سبب ساز ہمارے لئے (رزق کا) ایسا سبب مہیّا کر جس کی تلاش کی ہمیں طاقت نہیں",
     "Translation English": "O Allah, O Possessor of the necks (i.e., in control of people's destinies), O Opener of doors, O Causer of causes, prepare for us a means that we are unable to seek.\""
    },
    {
     "ID": 289,
     "Arabic": "اَللّٰهُمَّ  اجْعَلْنَا  مَشْغُوْلِيْنَ  بِاَمْرِكَ",
     "Translation Urdu": "خدایا ہمیں اپنے حکم کی تعمیل میں مشغول رکھ",
     "Translation English": "O Allah, make us occupied with Your command"
    },
    {
     "ID": 290,
     "Arabic": "اٰمِنِيْنَ  بِعَدْلِكَ  اٰئِسِيْنَ  مِنْ  خَلْقِكَ",
     "Translation Urdu": "۔ اپنے انصاف سے امن میں رکھ اپنی مخلوق سے بے نیاز بنا",
     "Translation English": "We believe in Your justice, and we are hopeful in Your creation."
    },
    {
     "ID": 291,
     "Arabic": "اٰنِسِيْنَ  بِكَ  مُستَوْحِشِيْنَ  عَنْ  غَيْرِكَ  رَاضِيْنَ  بِقَضَآئِكَ  صَابِرِيْنَ  علٰى  بَلَآئِكَ",
     "Translation Urdu": "اپنی ذات سے مانوس رکھ اپنے غیر سے ہراسان رکھ اپنے فیصلہ سے راضی رہنے والے بنا تیری آزمایش پر صبر گزار",
     "Translation English": "Grant us peace, feeling secure in You, detached from others, content with Your decree, patient in the face of Your trials"
    },
    {
     "ID": 292,
     "Arabic": "قَانِعِيْنَ  لِعَطَائِكَ  شَاكِرِيْنَ  لِنِعْمَآئِكَ",
     "Translation Urdu": "تیری بخشش پر قناعت کرنے والے، تیری نعمتوں کے شکر گزار بنا دے",
     "Translation English": "Content with Your giving, grateful for Your blessings."
    },
    {
     "ID": 293,
     "Arabic": "مُتَلَذِّذِيْنَ  بِذِكْرِكَ  فَرِحِيْنَ  بِكِتَابِكَ  مُنَاجِيْنَ  بِكَ  فِىْ  اٰنَآءِ  اللَّيْلِ  وَ  اَطْرَافِ  النَّهَارِ",
     "Translation Urdu": "تیری یاد سے لذّت اٹھانے والے تیری کتاب (قرآن) پر خوش ہونیوالے تیرے ساتھ راتوں کے وقت اور دن کے حصّوں میں سرگوشی کرنے والے بنا دے",
     "Translation English": "Delighting in Your remembrance, joyful with Your Book, seeking refuge in You in the depths of the night and at the edges of the day"
    },
    {
     "ID": 294,
     "Arabic": "مُبْغِضِيْنَ  لِلدُّنْيَا  وَ  مُحِبِّيْنَ  لِلْآخِرَةِ  مُشْتَاقِيْنَ  اِلٰى  لِقَآئِكَ",
     "Translation Urdu": "دنیا سے نفرت کرنے والے اور آخرت کی محبت رکھنے والے، تیرے دیدار کے شوقین",
     "Translation English": "\"Hating the worldly life, loving the Hereafter, longing for Your meeting.\""
    },
    {
     "ID": 295,
     "Arabic": "مُتَوَجِّهِيْنَ  اِلٰى  جَنَابِكَ  مُسْتَعِدِّيْنَ  لِلمَوْتِ",
     "Translation Urdu": "تیرے دربار کی طرف متوجہ ہونے والے، موت کے لئے ہر وقت تیار رہنے والے بناؤ",
     "Translation English": "\"Turning towards Your side, prepared for death.\""
    },
    {
     "ID": 296,
     "Arabic": "رَبَّنَا  وَ  اٰتِنَا  مَا  وَعَدْتَّنَا  عَلٰى  رُسُلِكَ  وَ  لَا  تُخْزِنَا  يَوْمَ  الْقِيٰمَةِ  اِنَّكَ  لَا  تُخْلِفُ  الْميْعَادَ",
     "Translation Urdu": "اے ہمارے پروردگار ہمیں وہ چیز دے جس کا تونے ہمیں وعدہ دیا ہے اپنے رسولوں کی زبانی اور ہمیں قیامت کے دن رسوا نہ کر ۔بے شک تو وعدہ کو پورا کرنے والا ہے",
     "Translation English": "\"Our Lord, grant us what You promised us through Your messengers, and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.\""
    },
    {
     "ID": 297,
     "Arabic": "اَللّٰهُمَّ  اجْعَلِ  التَّوْفِيْقَ  رَفِيْقَنَا  وَالصِّرَاطَ  الْمُسْتَقِيْمَ  طَرِيْقَنَا",
     "Translation Urdu": "اے اللہ توفیق کو ہمارا ساتھی بنا اور سیدھے راستے کو ہمارا راستہ بنا",
     "Translation English": "O Allah, make success our companion and the straight path our way."
    },
    {
     "ID": 298,
     "Arabic": "اَللّٰهُمَّ  اَوْصِلْنَا  اِلٰى  مَقَاصِدِنَا  وَتُبْ  عَلَيْنَا  اِنَّكَ  اَنْتَ  التَّوَّابُ  الرَّحِيْمُ",
     "Translation Urdu": "یا اللہ ۔ ہمیں اپنے مقصد تک پہنچا اور ہمیں توبہ کی توفیق بخش۔ بے شک تو اپنے بندوں کو توبہ کی توفیق بخشنے والا مہربان ہے",
     "Translation English": "\"O Allah, bring us to our goals, and turn towards us. Indeed, You are the Accepting of Repentance, the Merciful.\""
    },
    {
     "ID": 299,
     "Arabic": "اَللّٰهُمَّ  بِكَ  اَصْبَحْنَا  وَبِكَ  اَمْسَيْنَا  وَبِكَ  نَحْيٰ  وَبِكَ  نَمُوْتَ  وَ  اِلَيْكَ  المَصِيْرُ",
     "Translation Urdu": "اے اللہ ہم نے تیری ہی مہربانی سے صبح اور شام کی اور تیری ہی مہربانی سے زندہ ہیں اور تیرے ہی نام پر مر جائیں گے اور تیری ہی طرف لوٹ آئیں گے",
     "Translation English": "O Allah, by Your grace, we have reached the morning and by Your grace, we reach the evening, and by Your grace, we live, and by Your grace, we die, and to You is our final destination."
    },
    {
     "ID": 300,
     "Arabic": "اَللّٰهُمَّ  رْزُقْنَا  لَذَّةَ  النَّظَرَ  اِلٰى  وَجْهِكَ  وَالشَّوْقَ  اِلٰى  لِقَآئِكَ",
     "Translation Urdu": "اے خدا ہمیں اپنی ذات کی طرف دیکھنے کی لذّت اور اپنے دیدار کا اشتیاق عطا فرما",
     "Translation English": "\"O Allah, grant us the delight of looking at Your face and the longing to meet You.\""
    },
    {
     "ID": 301,
     "Arabic": "اَللّٰهُمَّ  اَرِنَا  الْحَقَّ  حَقًّا  وَّارْزُقْنَا  اِتِّبَاعَهُ  وَاَرِنَا  الْبَاطِلَ  بَاطِلًا  وَّارْزُقْنَا  اجْتِنَابَهُ",
     "Translation Urdu": "اے اللہ۔ ہمیں سچ کو سچ ہی دکھا اور اس کی پیروی کی توفیق دے اور ہمیں جھوٹ کو جھوٹ ہی دکھا اور ہمیں اس سے بچنے کی توفیق بخش",
     "Translation English": "O Allah, show us the truth as true, and grant us the ability to follow it. Show us falsehood as false, and grant us the ability to avoid it."
    },
    {
     "ID": 302,
     "Arabic": "اَللّٰهُمَّ  اَرِنَا  حَقَآئِقَ  الْاَشْيآءِ  كَمَا  هِيَ  تَوَفَّنَا  مُسْلِمِيْنَ  وَاَلحِقْنَا  بِا  الصّٰلِحِيْنَ",
     "Translation Urdu": "اے خدا ہمیں تمام چیزوں کی حقیقتیں ایسی ہی دکھا جیسی کہ وہ ہیں۔ ہمیں مسلمان ہونے کی حالت میں مار اور نیک لوگوں کے ساتھ مل",
     "Translation English": "O Allah, show us the realities of things as they truly are. Grant us a death as Muslims and join us with the righteous.\""
    },
    {
     "ID": 303,
     "Arabic": "وَادْفَعْ  عَنَّاشَرَّ  الظّٰلِمِيْنَ  وَ  شَارِكْنَا  فِىْ  دَعَآءِ  الْمُؤْمِنِيْنَ",
     "Translation Urdu": "اور ہم سے ظالموں کا شر دور کر اور ہمیں شریک ٹھہرا مومنوں کی دعائوں میں",
     "Translation English": "And repel from us the evil of the oppressors, and make us share in the supplication of the believers"
    },
    {
     "ID": 304,
     "Arabic": "وَ نَبِّهْنَا  عَنْ  نَوْمَةِ  الْغَافِلِيْنَ  وَارْزُقْنَا  شَفَاعَةَ  سَيِّدِ  الْمُرْسَلِيْنَ",
     "Translation Urdu": "اور ہمیں غافلانہ نیند سے بیدار کر اور ہمیں تمام رسولوں کے سردار (حضرت محمدؐ) کی شفاعت نصیب کر",
     "Translation English": "And awaken us from the heedless slumber, and grant us the intercession of the Master of the Messengers"
    },
    {
     "ID": 305,
     "Arabic": "وَاَدْخِلْنَا  الْجَنَّةَ  بِسَلَامٍ  اٰمِنِيْنَ  وَ  احْشُرْنَا  مَعَ  الْمُتَّقِيْنَ  وَخَلِّصْنَا  مِنَ  النَّارِ  يَا  مُجِيْرُ",
     "Translation Urdu": "اور ہمیں سلامتی اور امن کے ساتھ جنّت میں لے جا اور ہمیں قیامت کے روز پرہیزگاروں کے ساتھ اُٹھاؤ اور ہمیں آگ سے آزاد کر دے ، اے پناہ دینے والے خدا",
     "Translation English": "And admit us to Paradise in peace, safe and secure, and gather us with the righteous. Save us from the Fire, O Rescuer."
    },
    {
     "ID": 306,
     "Arabic": "اَللّٰهُمَّ  اغْفِرْ  لِاُمَّةِ  سَىِّدِنَا  مُحَمَّدٍ ﷺ",
     "Translation Urdu": "اے اللہ۔ حضرت محمدؐ کی اُمت کے گناہ بخش دے",
     "Translation English": "\"O Allah, forgive the nation of our master Muhammad (peace be upon him).\""
    },
    {
     "ID": 307,
     "Arabic": "اَللّٰهُمَّ  ارْحَمْ  اُمَّةَ  سَىِّدِنَا  مُحَمَّدٍ ﷺ",
     "Translation Urdu": "اے اللہ ۔ حضرت محمدؐ کی امّت پر رحم کر",
     "Translation English": "\"O Allah, have mercy on the nation of our master Muhammad (peace be upon him).\""
    },
    {
     "ID": 308,
     "Arabic": "اَللّٰهُمَّ  انْصُرْ  اُمَّةَ  سَىِّدِنَا  مُحَمَّدٍ ﷺ",
     "Translation Urdu": "اے اللہ ۔ حضرت محمدؐ کی امّت کی مدد کر",
     "Translation English": "O Allah, support the nation of our master Muhammad (peace be upon him).\""
    },
    {
     "ID": 309,
     "Arabic": "اَللّٰهُمَّ  افْتَحْ  لِاُمَّةِ  سَىِّدِنَا  مُحَمَّدٍ  ﷺ",
     "Translation Urdu": "اے اللہ۔ حضرت محمدؐ کی امّت کو (دشمنوں پر) فتح دے",
     "Translation English": "O Allah, open the way for the nation of our master Muhammad (peace be upon him)."
    },
    {
     "ID": 310,
     "Arabic": "اَللّٰهُمَّ  اَصْلِحْ  اُمَّةَ  سَىِّدِنَا  مُحَمَّدٍ  ﷺ  اَللّٰهُمَّ  فَرِّجْ  عَنْ  اُمَّةِ  سَىِّدِنَا مُحَمَّدٍ  ﷺ",
     "Translation Urdu": "اے اللہ ۔ حضرت محمدؐ کی امّت کی اصلاح فرما۔ اے اللہ ۔ حضرت محمدؐ کی امّت کی پریشانی دور کر",
     "Translation English": "O Allah, rectify the nation of our master Muhammad (peace be upon him). O Allah, relieve the distress from the nation of our master Muhammad (peace be upon him)."
    },
    {
     "ID": 311,
     "Arabic": "اَللّٰهُمَّ  كَرِّمْ  اُمَّةَ  سَىِّدِنَا  مُحَمَّدٍ  ﷺ",
     "Translation Urdu": "اے اللہ ۔ حضرت محمدؐ کی امّت کو عزّت مند بنا",
     "Translation English": "O Allah, honor the nation of our master Muhammad (peace be upon him).\""
    },
    {
     "ID": 312,
     "Arabic": "اَللّٰهُمَّ  عَظِّمْ  اُمَّةَ  سَىِّدِنَا  مُحَمَّدٍ ﷺ",
     "Translation Urdu": "اے اللہ ۔ حضرت محمدؐ کی امّت کو عظمت عطا کر",
     "Translation English": "O Allah, magnify the nation of our master Muhammad (peace be upon him).\""
    },
    {
     "ID": 313,
     "Arabic": "اَللّٰهُمَّ  تَجَاوَزْ  عَنْ اُمَّةِ  سَىِّدِنَا  مُحَمَّدٍ ﷺ",
     "Translation Urdu": "اے اللہ ۔ حضرت محمدؐ کی امّت کی درگزر کر",
     "Translation English": "\"O Allah, overlook the faults of the nation of our master Muhammad (peace be upon him).\""
    },
    {
     "ID": 314,
     "Arabic": "اَللّٰهُمَّ  يَا  حَبِيْبَ  التَّوَّابِيْنَ  تُبْ  عَلَيْنَا  وَ  يَآ  اَمَانَ  الْخَآئِفِيْنَ  اٰمِنَّا",
     "Translation Urdu": "اے اللہ اے توبہ کرنیوالوں کو دوست رکھنے والے ہمیں توبہ کی توفیق دے۔ تو امان ہے خوف کے ماروں کا ہمیں امان دے",
     "Translation English": "O Allah, O Beloved of those who repent, turn towards us, O Guardian of those who fear, grant us safety."
    },
    {
     "ID": 315,
     "Arabic": "وَ  يَا  دَلِيْلَ  الْمُتَحَيِّرِيْنَ  دُلَّنَا  وَ  يَا  هَادِيَ  الْمُضَلِّيْنَ  اهْدِنَا",
     "Translation Urdu": "اور اے راستہ بھولے ہوئے لوگوں کو راستہ دکھانے والے ہمیں راستہ دکھا اور اے گمراہوں کو ہدایت کرنے والے ہمیں ہدایت دے",
     "Translation English": "O Allah, O Guide of those who are perplexed, guide us, and O Leader of the misguided, lead us."
    },
    {
     "ID": 316,
     "Arabic": "وَ  يَا  غِيَاثَ  الْمُسْتَغِيْثِيْنَ  اَغِثْنَا",
     "Translation Urdu": "اور اے فریادیوں کی فریاد کو پہنچنے والے ہماری فریاد رسی کر",
     "Translation English": "O Allah, O Helper of those who seek help, help us"
    },
    {
     "ID": 317,
     "Arabic": "وَ  يَا  رَجَآءَ  الْمُنْقَطِعِيْنَ  لَا  تَقْطَعْ  رَجَآءَنَا",
     "Translation Urdu": "اے نا امیدوں کی امید ہماری امید مت توڑ",
     "Translation English": "\"O Allah, O Hope of those who have cut off hope, do not cut off our hope.\""
    },
    {
     "ID": 318,
     "Arabic": "وَ  يَا  رَاحِمَ  الْعَاصِيْنَ  اِرْحَمْنَا",
     "Translation Urdu": "اے نافرمانوں پر رحم کرنے والے ہم پر رحم کر",
     "Translation English": "O Allah, O Merciful to the disobedient, have mercy on us.\""
    },
    {
     "ID": 319,
     "Arabic": "وَ  يَا  غَافِرَ  الْمُذْنِبِيْنَ  اغْفِرْ  لَنَا  ذُنُوْبَنَا  وَ  كَفِّرْ  عَنَّا  سَيِّئٰاتِنَا  وَ  تَوَفَّنَا  مَعَ  الْاَبْرَارِ",
     "Translation Urdu": "اے گناہگاروں کی مغفرت کرنے والے ہمارے گناہوں کی مغفرت کر اور ہمارے برائیاں ہم سے دور کر اور ہمیں نیک لوگوں کے ساتھ وفات دے",
     "Translation English": "O Allah, O Forgiver of sinners, forgive our sins, expiate our wrongdoings, and grant us to be among the virtuous."
    },
    {
     "ID": 320,
     "Arabic": "اَللّٰهُمَّ  اسْتُرْ  عُيُوْبَنَا",
     "Translation Urdu": "اے اللہ۔ ہمارے گناہ بخش دے",
     "Translation English": "\"O Allah, conceal our faults.\""
    },
    {
     "ID": 321,
     "Arabic": "اَللّٰهُمَّ  اغْفِرْ  ذُنُوْبَنَا",
     "Translation Urdu": "اے اللہ۔ ہمارے عیبوں پر پردہ ڈال",
     "Translation English": "\"O Allah, forgive our sins.\""
    },
    {
     "ID": 322,
     "Arabic": "اَللّٰهُمَّ  احْفَظْ  قُلُوْبَنَا",
     "Translation Urdu": "اے اللہ۔ ہمارے سینوں کو کھول دے",
     "Translation English": "\"O Allah, safeguard our hearts.\""
    },
    {
     "ID": 323,
     "Arabic": "اَللّٰهُمَّ  شْرَحْ  صُدُوْرَنَا",
     "Translation Urdu": "اے اللہ ۔ ہمارے دلوں کو محفوظ رکھ",
     "Translation English": "O Allah, expand our chests.\""
    },
    {
     "ID": 325,
     "Arabic": "اَللّٰهُمَّ  نَوِّرْ  قُبُوْرَنَا",
     "Translation Urdu": "اے اللہ۔ ہماری قبروں کو روشن کر",
     "Translation English": "O Allah, illuminate our graves.\""
    },
    {
     "ID": 326,
     "Arabic": "اَللّٰهُمَّ  يَسِّرْ  اُمُوْرَنَا",
     "Translation Urdu": "اے اللہ۔ ہمارے کاموں کو آسان بنا دے",
     "Translation English": "O Allah, facilitate our affairs.\""
    },
    {
     "ID": 327,
     "Arabic": "اَللّٰهُمَّ  حَصِّلْ  مُرَادَنَا",
     "Translation Urdu": "اے اللہ۔ ہماری مراد پوری کر",
     "Translation English": "\"O Allah, accomplish our goals.\""
    },
    {
     "ID": 328,
     "Arabic": "اَللّٰهُمَّ  تَمِّمْ  تَقَاصِيْرَنَا",
     "Translation Urdu": "اے اللہ۔ ہمارے تمام کوتاہیوں کو پورا کر دے",
     "Translation English": "O Allah, perfect our destinies.\""
    },
    {
     "ID": 329,
     "Arabic": "اَللّٰهُمَّ  نَجِّنَا  مِمَّا  نَخَافُ  يَا  خَفِيَّ  الْاَلْطَافِ",
     "Translation Urdu": "اے اللہ۔ ہمیں اس چیز سے نجات دے جس سے ہم ڈرتے ہیں اے پوشیدہ مہربانیوں والے",
     "Translation English": "O Allah, save us from what we fear, O Concealer of faults"
    },
    {
     "ID": 330,
     "Arabic": "اَللّٰهُمَّ  اغْفِرْلَنَا  وَلِوَالِدَيْنَا  وَلِمَشَآئِخِنَا  وَلِاُسْتَاذِنَا  وَلِاَصْحَابِنَا  وَلِاَحْبَابِنَا  وَ  لِعَشَآئِرِنَا  وَلِقَبَآئِلِنَا",
     "Translation Urdu": "اے اللہ۔ مغفرت کر ہماری ، ہمارے ماں باپ کی، ہمارے بزرگوں کی، ہمارے استاد کی، ہمارے دوستوں کی، ہمارے رشتہ داروں کی، ہمارے قبیلہ والوں کی",
     "Translation English": "O Allah, forgive us, our parents, our elders, our teachers, our companions, our friends, our families, and our tribes"
    },
    {
     "ID": 331,
     "Arabic": "وَلِمَنْ  لَّهٗ  حَقَّ  عَلَيْنَا  وَ  لِجَمِيْعِ  اُمَّةِ سَىِّدِنَا مُحَمَّدٍ  عَلَيْهِ  الصَّلوٰةُ  وَالسَّلَامُ",
     "Translation Urdu": "اور اس کی بھی جس کا ہم پر کوئی حق ہے اور تمام امّت محمدؐ کی۔ آپؐ پر درود اور سلام ہو",
     "Translation English": "And for whoever has a right upon us, and for the entire nation of our master Muhammad (peace be upon him"
    },
    {
     "ID": 332,
     "Arabic": "وَقِنَا  رَبَّنَا  شَرَّ  مَا  قَضَيْتَ لَنَا  وَقِنَا  عَذَابَ  النَّارْ",
     "Translation Urdu": "اے ہمارے پروردگار ہمیں اس شر سے بچا جو تونے مقدر کیا ہو",
     "Translation English": "And save us, our Lord, from the evil of what You have decreed for us, and protect us from the punishment of the Fire."
    },
    {
     "ID": 333,
     "Arabic": "وَقِنَا عَذَابَ  الْقَبْرِ  وَ قِنَا  عَذَابَ  يَوْمِ  الْقِيٰمَةِ",
     "Translation Urdu": "اور بچاؤ ہمیں اے ہمارے رب قبر اور جہنم کی آگ اور قیامت کے دن کے عذاب سے",
     "Translation English": "And save us from the punishment of the grave and protect us from the punishment of the Day of Judgment."
    },
    {
     "ID": 334,
     "Arabic": "وَاحْشُرْنَا  مَعَ  الْمُتَّقِيْنَ  وَلْاَبْرَارِ",
     "Translation Urdu": "اور قیامت کے دن ہمیں پرہیزگاروں اور نیکوکاروں کے ساتھ اٹھا",
     "Translation English": "And gather us with the righteous and the virtuous"
    },
    {
     "ID": 335,
     "Arabic": "اَللّٰهُمَّ بِحُرْمَةِ  هٰذِهِ  الْاَوْرَادِ  الْفَتْحِيَّةِ  اِفْتَحْ  لَنَا  اَبْوَابَ  الْعِنَايَاتِ  وَالْكَرَامَاتِ",
     "Translation Urdu": "اے اللہ۔ اس اوراد فتحیہ کی برکت سے کھول دے ہمارے لئے اپنی مہربانیوں اور بخششوں کے دروازے",
     "Translation English": "O Allah, by the sanctity of these opening prayers, open for us the doors of blessings and honors."
    },
    {
     "ID": 336,
     "Arabic": "وَ  وَفِّقْنَا  لِلطَّاعَاتِ  وَالْعِبَادَاتِ  وَاحْفَظْنَا  مِنَ  الْاٰفَاتِ  وَالْبَلِيَّاتِ  وَبَارِكْ  لَنَا  فِى  الرِّزْقِ  وَالْحَسَنٰتِ",
     "Translation Urdu": "اور ہمیں توفیق دے اپنی فرمانبرداریوں اور عبادتوں کی اور ہمیں محفوظ رکھ آفتوں اور آزمایشوں سے اور برکت دے ہمیں رزق، عمر اور نیکیوں میں",
     "Translation English": "And grant us success in obedience and worship, protect us from harm and calamities, and bless us in our provisions and good deeds."
    },
    {
     "ID": 337,
     "Arabic": "اَللّٰهُمَّ  احْفَظْنَا  يَا  فَيَّاضُ  مِنْ  جَمِيْعِ  الْبَلَاْ  يَا  وَالْاَمْرَاضِ",
     "Translation Urdu": "یا اللہ۔ اے فیض و برکت والے خدا۔ ہمیں محفوظ رکھ تمام آزمائشوں اور بیماریوں سے",
     "Translation English": "O Allah, protect us, O Bestower of blessings, from all calamities and diseases"
    },
    {
     "ID": 338,
     "Arabic": "وَ  صَلَّى  اللّٰهُ  تَعٰلٰى  عَلٰى  خَيْرِ  خَلْقِهٖ  سَىِّدِنَاْ  مُحَمَّدٍ  وَّ  اٰلِهٖ  وَاَصْحَابِهٖ  اَجْمَعِيْنَ  بِرَحْمَتِكَ  يَا  اَرْحَمَ  الْرّٰحِمِيْنَ",
     "Translation Urdu": "اللہ تعالیٰ درود و رحمت بھیجے اپنی مخلوقات میں سے سب سے بہترین (حضرت) محمدؐ پر، آپؐ کی اولاد اور آپؐ کے تمام صحابہ کرامؓ پر",
     "Translation English": "And may Allah, the Most High, send blessings upon the best of His creation, our master Muhammad, and upon his family and all of his companions, all together, by Your mercy, O Most Merciful of the merciful.\""
    }
   ]